/* automatically generated by rust-bindgen 0.70.1 */

#[repr(C)]
pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
impl<T> __BindgenUnionField<T> {
    #[inline]
    pub const fn new() -> Self {
        __BindgenUnionField(::std::marker::PhantomData)
    }
    #[inline]
    pub unsafe fn as_ref(&self) -> &T {
        ::std::mem::transmute(self)
    }
    #[inline]
    pub unsafe fn as_mut(&mut self) -> &mut T {
        ::std::mem::transmute(self)
    }
}
impl<T> ::std::default::Default for __BindgenUnionField<T> {
    #[inline]
    fn default() -> Self {
        Self::new()
    }
}
impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
    #[inline]
    fn clone(&self) -> Self {
        *self
    }
}
impl<T> ::std::marker::Copy for __BindgenUnionField<T> {}
impl<T> ::std::fmt::Debug for __BindgenUnionField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__BindgenUnionField")
    }
}
impl<T> ::std::hash::Hash for __BindgenUnionField<T> {
    fn hash<H: ::std::hash::Hasher>(&self, _state: &mut H) {}
}
impl<T> ::std::cmp::PartialEq for __BindgenUnionField<T> {
    fn eq(&self, _other: &__BindgenUnionField<T>) -> bool {
        true
    }
}
impl<T> ::std::cmp::Eq for __BindgenUnionField<T> {}
pub const _STL_COMPILER_PREPROCESSOR: u32 = 1;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;

pub const LC_COLLATE: u32 = 1;
pub const LC_CTYPE: u32 = 2;
pub const LC_MONETARY: u32 = 3;
pub const LC_NUMERIC: u32 = 4;
pub const LC_TIME: u32 = 5;
pub const LC_MIN: u32 = 0;
pub const LC_MAX: u32 = 5;
pub const _ENABLE_PER_THREAD_LOCALE: u32 = 1;
pub const _DISABLE_PER_THREAD_LOCALE: u32 = 2;
pub const _ENABLE_PER_THREAD_LOCALE_GLOBAL: u32 = 16;
pub const _DISABLE_PER_THREAD_LOCALE_GLOBAL: u32 = 32;
pub const _ENABLE_PER_THREAD_LOCALE_NEW: u32 = 256;
pub const _DISABLE_PER_THREAD_LOCALE_NEW: u32 = 512;
pub const _X_ALL: u32 = 0;
pub const _X_COLLATE: u32 = 1;
pub const _X_CTYPE: u32 = 2;
pub const _X_MONETARY: u32 = 3;
pub const _X_NUMERIC: u32 = 4;
pub const _X_TIME: u32 = 5;
pub const _X_MAX: u32 = 5;
pub const _X_MESSAGES: u32 = 6;
pub const _NCAT: u32 = 7;
pub const _XA: u32 = 256;
pub const _BB: u32 = 32;
pub const _CN: u32 = 8;
pub const _DI: u32 = 4;
pub const _LO: u32 = 2;
pub const _PU: u32 = 16;
pub const _SP: u32 = 64;
pub const _UP: u32 = 1;
pub const _XD: u32 = 128;
pub const _MAX_SIG_DIG_V2: u32 = 768;
pub const _MAX_EXP_DIG: u32 = 8;
pub const _FLOATING_BUFFER_SIZE: u32 = 792;
pub const _MAX_SIG_DIG_V1: u32 = 36;
pub const _ENABLE_V2_BEHAVIOR: u32 = 1000000000;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut va_list, ...);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __vcrt_va_list_is_reference {
    pub _address: u8,
}
pub const __vcrt_va_list_is_reference___the_value: __vcrt_va_list_is_reference__bindgen_ty_1 =
    false;
pub type __vcrt_va_list_is_reference__bindgen_ty_1 = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __vcrt_assert_va_start_is_not_reference {
    pub _address: u8,
}
pub type __vcrt_bool = bool;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const u16,
        _FunctionName: *const u16,
        _FileName: *const u16,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
pub type std_align_val_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_nothrow_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_nothrow_t"][::std::mem::size_of::<std_nothrow_t>() - 1usize];
    ["Alignment of std_nothrow_t"][::std::mem::align_of::<std_nothrow_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}?nothrow@std@@3Unothrow_t@1@B"]
    pub static std_nothrow: std_nothrow_t;
}
pub const std__Uninitialized__Noinit: std__Uninitialized = 0;
pub type std__Uninitialized = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug)]
pub struct std__Lockit {
    pub _Locktype: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Lockit"][::std::mem::size_of::<std__Lockit>() - 4usize];
    ["Alignment of std__Lockit"][::std::mem::align_of::<std__Lockit>() - 4usize];
    ["Offset of field: std__Lockit::_Locktype"]
        [::std::mem::offset_of!(std__Lockit, _Locktype) - 0usize];
};
extern "C" {
    #[link_name = "\u{1}?_Lockit_ctor@_Lockit@std@@SAXH@Z"]
    pub fn std__Lockit__Lockit_ctor(arg1: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "\u{1}?_Lockit_dtor@_Lockit@std@@SAXH@Z"]
    pub fn std__Lockit__Lockit_dtor(arg1: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "\u{1}??0_Lockit@std@@QEAA@XZ"]
    pub fn std__Lockit__Lockit(this: *mut std__Lockit);
}
extern "C" {
    #[link_name = "\u{1}??0_Lockit@std@@QEAA@H@Z"]
    pub fn std__Lockit__Lockit1(this: *mut std__Lockit, arg1: ::std::os::raw::c_int);
}
extern "C" {
    #[link_name = "\u{1}??1_Lockit@std@@QEAA@XZ"]
    pub fn std__Lockit__Lockit_destructor(this: *mut std__Lockit);
}
impl std__Lockit {
    #[inline]
    pub unsafe fn _Lockit_ctor(arg1: ::std::os::raw::c_int) {
        std__Lockit__Lockit_ctor(arg1)
    }
    #[inline]
    pub unsafe fn _Lockit_dtor(arg1: ::std::os::raw::c_int) {
        std__Lockit__Lockit_dtor(arg1)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std__Lockit__Lockit(__bindgen_tmp.as_mut_ptr());
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn new1(arg1: ::std::os::raw::c_int) -> Self {
        let mut __bindgen_tmp = ::std::mem::MaybeUninit::uninit();
        std__Lockit__Lockit1(__bindgen_tmp.as_mut_ptr(), arg1);
        __bindgen_tmp.assume_init()
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        std__Lockit__Lockit_destructor(self)
    }
}
pub type std_integral_constant_value_type<_Ty> = _Ty;
pub type std_integral_constant_type = u8;
pub type std_bool_constant = u8;
pub type std_true_type = u8;
pub type std_false_type = u8;
pub type std_enable_if_t = u8;
pub type std_conditional_type<_Ty1> = _Ty1;
pub type std_conditional_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_same {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_const {
    pub _address: u8,
}
pub type std_remove_const_type<_Ty> = _Ty;
pub type std_remove_const_t = std_remove_const;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_volatile {
    pub _address: u8,
}
pub type std_remove_volatile_type<_Ty> = _Ty;
pub type std_remove_volatile_t = std_remove_volatile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_cv {
    pub _address: u8,
}
pub type std_remove_cv_type<_Ty> = _Ty;
pub type std_remove_cv__Apply = u8;
pub type std_remove_cv_t = std_remove_cv;
pub type std__Disjunction_type<_First> = _First;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_disjunction {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_integral {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_floating_point {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_arithmetic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_reference {
    pub _address: u8,
}
pub type std_remove_reference_type<_Ty> = _Ty;
pub type std_remove_reference__Const_thru_ref_type<_Ty> = _Ty;
pub type std_remove_reference_t = std_remove_reference;
pub type std__Const_thru_ref = std_remove_reference;
pub type std__Remove_cvref_t = std_remove_cv_t;
pub type std_streamoff = ::std::os::raw::c_longlong;
pub type std_streamsize = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_fpos<_Statetype> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Statetype>>,
    pub _Myoff: std_streamoff,
    pub _Fpos: ::std::os::raw::c_longlong,
    pub _Mystate: _Statetype,
}
pub type std_streampos = std_fpos<_Mbstatet>;
pub type std_wstreampos = std_streampos;
pub type std_u16streampos = std_streampos;
pub type std_u32streampos = std_streampos;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_stringbuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_istringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ostringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_stringstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_filebuf {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ifstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_ofstream {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_fstream {
    pub _address: u8,
}
pub type std_ios = std_basic_ios<::std::os::raw::c_char>;
pub type std_streambuf = std_basic_streambuf<::std::os::raw::c_char>;
pub type std_istream = std_basic_istream<::std::os::raw::c_char>;
pub type std_ostream = std_basic_ostream<::std::os::raw::c_char>;
pub type std_iostream = std_basic_iostream<::std::os::raw::c_char>;
pub type std_stringbuf = std_basic_stringbuf;
pub type std_istringstream = std_basic_istringstream;
pub type std_ostringstream = std_basic_ostringstream;
pub type std_stringstream = std_basic_stringstream;
pub type std_filebuf = std_basic_filebuf;
pub type std_ifstream = std_basic_ifstream;
pub type std_ofstream = std_basic_ofstream;
pub type std_fstream = std_basic_fstream;
pub type std_wios = std_basic_ios<u16>;
pub type std_wstreambuf = std_basic_streambuf<u16>;
pub type std_wistream = std_basic_istream<u16>;
pub type std_wostream = std_basic_ostream<u16>;
pub type std_wiostream = std_basic_iostream<u16>;
pub type std_wstringbuf = std_basic_stringbuf;
pub type std_wistringstream = std_basic_istringstream;
pub type std_wostringstream = std_basic_ostringstream;
pub type std_wstringstream = std_basic_stringstream;
pub type std_wfilebuf = std_basic_filebuf;
pub type std_wifstream = std_basic_ifstream;
pub type std_wofstream = std_basic_ofstream;
pub type std_wfstream = std_basic_fstream;
pub type std_nullptr_t = *const ::std::os::raw::c_void;
pub const std_float_denorm_style_denorm_indeterminate: std_float_denorm_style = -1;
pub const std_float_denorm_style_denorm_absent: std_float_denorm_style = 0;
pub const std_float_denorm_style_denorm_present: std_float_denorm_style = 1;
pub type std_float_denorm_style = ::std::os::raw::c_int;
pub const std_float_round_style_round_indeterminate: std_float_round_style = -1;
pub const std_float_round_style_round_toward_zero: std_float_round_style = 0;
pub const std_float_round_style_round_to_nearest: std_float_round_style = 1;
pub const std_float_round_style_round_toward_infinity: std_float_round_style = 2;
pub const std_float_round_style_round_toward_neg_infinity: std_float_round_style = 3;
pub type std_float_round_style = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Num_base {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?has_denorm@_Num_base@std@@2W4float_denorm_style@2@B"]
    pub static std__Num_base_has_denorm: std_float_denorm_style;
}
pub const std__Num_base_has_denorm_loss: bool = false;
pub const std__Num_base_has_infinity: bool = false;
pub const std__Num_base_has_quiet_NaN: bool = false;
pub const std__Num_base_has_signaling_NaN: bool = false;
pub const std__Num_base_is_bounded: bool = false;
pub const std__Num_base_is_exact: bool = false;
pub const std__Num_base_is_iec559: bool = false;
pub const std__Num_base_is_integer: bool = false;
pub const std__Num_base_is_modulo: bool = false;
pub const std__Num_base_is_signed: bool = false;
pub const std__Num_base_is_specialized: bool = false;
pub const std__Num_base_tinyness_before: bool = false;
pub const std__Num_base_traps: bool = false;
extern "C" {
    #[link_name = "\u{1}?round_style@_Num_base@std@@2W4float_round_style@2@B"]
    pub static std__Num_base_round_style: std_float_round_style;
}
pub const std__Num_base_digits: ::std::os::raw::c_int = 0;
pub const std__Num_base_digits10: ::std::os::raw::c_int = 0;
pub const std__Num_base_max_digits10: ::std::os::raw::c_int = 0;
pub const std__Num_base_max_exponent: ::std::os::raw::c_int = 0;
pub const std__Num_base_max_exponent10: ::std::os::raw::c_int = 0;
pub const std__Num_base_min_exponent: ::std::os::raw::c_int = 0;
pub const std__Num_base_min_exponent10: ::std::os::raw::c_int = 0;
pub const std__Num_base_radix: ::std::os::raw::c_int = 0;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Num_base"][::std::mem::size_of::<std__Num_base>() - 1usize];
    ["Alignment of std__Num_base"][::std::mem::align_of::<std__Num_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_numeric_limits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Num_int_base {
    pub _address: u8,
}
pub const std__Num_int_base_is_bounded: bool = true;
pub const std__Num_int_base_is_exact: bool = true;
pub const std__Num_int_base_is_integer: bool = true;
pub const std__Num_int_base_is_specialized: bool = true;
pub const std__Num_int_base_radix: ::std::os::raw::c_int = 2;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Num_int_base"][::std::mem::size_of::<std__Num_int_base>() - 1usize];
    ["Alignment of std__Num_int_base"][::std::mem::align_of::<std__Num_int_base>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Num_float_base {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?has_denorm@_Num_float_base@std@@2W4float_denorm_style@2@B"]
    pub static std__Num_float_base_has_denorm: std_float_denorm_style;
}
pub const std__Num_float_base_has_infinity: bool = true;
pub const std__Num_float_base_has_quiet_NaN: bool = true;
pub const std__Num_float_base_has_signaling_NaN: bool = true;
pub const std__Num_float_base_is_bounded: bool = true;
pub const std__Num_float_base_is_iec559: bool = true;
pub const std__Num_float_base_is_signed: bool = true;
pub const std__Num_float_base_is_specialized: bool = true;
extern "C" {
    #[link_name = "\u{1}?round_style@_Num_float_base@std@@2W4float_round_style@2@B"]
    pub static std__Num_float_base_round_style: std_float_round_style;
}
pub const std__Num_float_base_radix: ::std::os::raw::c_int = 2;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Num_float_base"][::std::mem::size_of::<std__Num_float_base>() - 1usize];
    ["Alignment of std__Num_float_base"][::std::mem::align_of::<std__Num_float_base>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_bool__close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_bool__close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_char_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_char_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_signed_char_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_signed_char_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_unsigned_char_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_unsigned_char_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_char16_t_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_char16_t_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_char32_t_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_char32_t_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_short_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_short_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_int_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_int_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_long_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_long_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_long_long_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_long_long_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_unsigned_short_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_unsigned_short_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_unsigned_int_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_unsigned_int_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_unsigned_long_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_unsigned_long_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_unsigned_long_long_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_unsigned_long_long_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_float_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_float_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_double_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_double_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_numeric_limits_open0_long_double_close0"]
        [::std::mem::size_of::<std_numeric_limits>() - 1usize];
    ["Align of template specialization: std_numeric_limits_open0_long_double_close0"]
        [::std::mem::align_of::<std_numeric_limits>() - 1usize];
};
pub type std_max_align_t = f64;
pub type std_byte = ::std::os::raw::c_uchar;
pub type std__Conjunction_type<_First> = _First;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_conjunction {
    pub _base: std_true_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_negation {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_void {
    pub _address: u8,
}
pub type std_void_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Identity {
    pub _address: u8,
}
pub type std__Identity_type<_Ty> = _Ty;
pub type std__Identity_t = std__Identity;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_const {
    pub _address: u8,
}
pub type std_add_const_type<_Ty> = _Ty;
pub type std_add_const_t = std_add_const;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_volatile {
    pub _address: u8,
}
pub type std_add_volatile_type<_Ty> = _Ty;
pub type std_add_volatile_t = std_add_volatile;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_cv {
    pub _address: u8,
}
pub type std_add_cv_type<_Ty> = _Ty;
pub type std_add_cv_t = std_add_cv;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Add_reference {
    pub _address: u8,
}
pub type std__Add_reference__Lvalue<_Ty> = _Ty;
pub type std__Add_reference__Rvalue<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_lvalue_reference {
    pub _address: u8,
}
pub type std_add_lvalue_reference_type = std__Add_reference;
pub type std_add_lvalue_reference_t = std__Add_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_rvalue_reference {
    pub _address: u8,
}
pub type std_add_rvalue_reference_type = std__Add_reference;
pub type std_add_rvalue_reference_t = std__Add_reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_extent {
    pub _address: u8,
}
pub type std_remove_extent_type<_Ty> = _Ty;
pub type std_remove_extent_t = std_remove_extent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_all_extents {
    pub _address: u8,
}
pub type std_remove_all_extents_type<_Ty> = _Ty;
pub type std_remove_all_extents_t = std_remove_all_extents;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_remove_pointer {
    pub _address: u8,
}
pub type std_remove_pointer_type<_Ty> = _Ty;
pub type std_remove_pointer_t = std_remove_pointer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Add_pointer {
    pub _address: u8,
}
pub type std__Add_pointer_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_add_pointer {
    pub _address: u8,
}
pub type std_add_pointer_type = std__Add_pointer;
pub type std_add_pointer_t = std__Add_pointer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_array {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_lvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_rvalue_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_reference {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_null_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_union {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_class {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_fundamental {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_enum {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_compound {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Arg_types {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_memfunptr {
    pub _address: u8,
}
pub type std__Is_memfunptr__Bool_type = std_false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_function_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_const {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_volatile {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_function {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_object {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_member_object_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_object_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_member_pointer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_scalar {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_pod {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_empty {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_polymorphic {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_abstract {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_final {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_standard_layout {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_literal_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivial {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copyable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_has_virtual_destructor {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_has_unique_object_representations {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_aggregate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_implicitly_default_constructible {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_assignable {
    pub _address: u8,
}
pub type std__Is_assignable_no_precondition_check = std_is_assignable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_copy_assignable {
    pub _address: u8,
}
pub type std__Is_copy_assignable_no_precondition_check = std_is_copy_assignable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_move_assignable {
    pub _address: u8,
}
pub type std__Is_move_assignable_no_precondition_check = std_is_move_assignable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_trivially_destructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_default_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_constructible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_copy_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_move_assignable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_destructible {
    pub _address: u8,
}
pub type std__Sign_base__Uty = std_remove_cv_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_signed {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_unsigned {
    pub _address: u8,
}
pub type std__Select__Apply<_Ty1> = _Ty1;
pub type std__Make_signed1 = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_signed {
    pub _address: u8,
}
pub type std_make_signed_type = std_remove_cv;
pub type std_make_signed_t = std_make_signed;
pub type std__Make_unsigned1 = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_make_unsigned {
    pub _address: u8,
}
pub type std_make_unsigned_type = std_remove_cv;
pub type std_make_unsigned_t = std_make_unsigned;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_alignment_of {
    pub _address: u8,
}
pub type std__Aligned_storage__Next = ::std::os::raw::c_char;
extern "C" {
    #[link_name = "\u{1}_Fits"]
    pub static std__Aligned_storage__Fits: bool;
}
pub type std__Aligned_storage_type = u8;
pub type std__Aligned_storage_t = u8;
pub type std_aligned_storage_type = std__Aligned_storage_t;
pub type std_aligned_storage_t = std__Aligned_storage_t;
pub type std_aligned_union_type = std__Aligned_storage_t;
pub type std_aligned_union_t = u8;
pub type std__Underlying_type_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_underlying_type {
    pub _address: u8,
}
pub type std_underlying_type_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_rank {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_base_of {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_decay {
    pub _address: u8,
}
pub type std_decay__Ty1 = std_remove_reference_t;
pub type std_decay__Ty2 = u8;
pub type std_decay_type = u8;
pub type std_decay_t = std_decay;
pub type std__Conditional_type<_Ty1> = _Ty1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Decayed_cond_oper {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_common_type {
    pub _address: u8,
}
pub type std_common_type_t = std_common_type;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_common_type_open0_close0"]
        [::std::mem::size_of::<std_common_type>() - 1usize];
    ["Align of template specialization: std_common_type_open0_close0"]
        [::std::mem::align_of::<std_common_type>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Common_type2 {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Common_type3 {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_specialization {
    pub _address: u8,
}
pub const std__Invoker_strategy__Functor: std__Invoker_strategy = 0;
pub const std__Invoker_strategy__Pmf_object: std__Invoker_strategy = 1;
pub const std__Invoker_strategy__Pmf_refwrap: std__Invoker_strategy = 2;
pub const std__Invoker_strategy__Pmf_pointer: std__Invoker_strategy = 3;
pub const std__Invoker_strategy__Pmd_object: std__Invoker_strategy = 4;
pub const std__Invoker_strategy__Pmd_refwrap: std__Invoker_strategy = 5;
pub const std__Invoker_strategy__Pmd_pointer: std__Invoker_strategy = 6;
pub type std__Invoker_strategy = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_functor {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_functor@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_functor__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_functor"][::std::mem::size_of::<std__Invoker_functor>() - 1usize];
    ["Alignment of std__Invoker_functor"][::std::mem::align_of::<std__Invoker_functor>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_pmf_object {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_pmf_object@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_pmf_object__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_pmf_object"][::std::mem::size_of::<std__Invoker_pmf_object>() - 1usize];
    ["Alignment of std__Invoker_pmf_object"]
        [::std::mem::align_of::<std__Invoker_pmf_object>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_pmf_refwrap {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_pmf_refwrap@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_pmf_refwrap__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_pmf_refwrap"]
        [::std::mem::size_of::<std__Invoker_pmf_refwrap>() - 1usize];
    ["Alignment of std__Invoker_pmf_refwrap"]
        [::std::mem::align_of::<std__Invoker_pmf_refwrap>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_pmf_pointer {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_pmf_pointer@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_pmf_pointer__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_pmf_pointer"]
        [::std::mem::size_of::<std__Invoker_pmf_pointer>() - 1usize];
    ["Alignment of std__Invoker_pmf_pointer"]
        [::std::mem::align_of::<std__Invoker_pmf_pointer>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_pmd_object {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_pmd_object@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_pmd_object__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_pmd_object"][::std::mem::size_of::<std__Invoker_pmd_object>() - 1usize];
    ["Alignment of std__Invoker_pmd_object"]
        [::std::mem::align_of::<std__Invoker_pmd_object>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_pmd_refwrap {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_pmd_refwrap@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_pmd_refwrap__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_pmd_refwrap"]
        [::std::mem::size_of::<std__Invoker_pmd_refwrap>() - 1usize];
    ["Alignment of std__Invoker_pmd_refwrap"]
        [::std::mem::align_of::<std__Invoker_pmd_refwrap>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoker_pmd_pointer {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Strategy@_Invoker_pmd_pointer@std@@2W4_Invoker_strategy@2@B"]
    pub static std__Invoker_pmd_pointer__Strategy: std__Invoker_strategy;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Invoker_pmd_pointer"]
        [::std::mem::size_of::<std__Invoker_pmd_pointer>() - 1usize];
    ["Alignment of std__Invoker_pmd_pointer"]
        [::std::mem::align_of::<std__Invoker_pmd_pointer>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_nothrow_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoke_convertible {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoke_nothrow_convertible {
    pub _address: u8,
}
pub type std__Invoke_traits_common_type<_Result> = _Result;
pub type std__Invoke_traits_common__Is_invocable = std_true_type;
pub type std__Invoke_traits_common__Is_nothrow_invocable = std_bool_constant;
pub type std__Invoke_traits_common__Is_invocable_r = std_bool_constant;
pub type std__Invoke_traits_common__Is_nothrow_invocable_r = std_bool_constant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoke_traits_zero {
    pub _address: u8,
}
pub type std__Invoke_traits_zero__Is_invocable = std_false_type;
pub type std__Invoke_traits_zero__Is_nothrow_invocable = std_false_type;
pub type std__Invoke_traits_zero__Is_invocable_r = std_false_type;
pub type std__Invoke_traits_zero__Is_nothrow_invocable_r = std_false_type;
pub type std__Decltype_invoke_zero<_Callable> = _Callable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Invoke_traits_nonzero {
    pub _address: u8,
}
pub type std__Invoke_traits_nonzero__Is_invocable = std_false_type;
pub type std__Invoke_traits_nonzero__Is_nothrow_invocable = std_false_type;
pub type std__Invoke_traits_nonzero__Is_invocable_r = std_false_type;
pub type std__Invoke_traits_nonzero__Is_nothrow_invocable_r = std_false_type;
pub type std__Decltype_invoke_nonzero = u8;
pub type std__Select_invoke_traits = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_result_of {
    pub _address: u8,
}
pub type std_result_of_t = std_result_of;
pub type std__Invoke_result_t = std__Select_invoke_traits;
pub type std__Is_invocable_r_ = std__Select_invoke_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_invocable_r {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_invoke_result {
    pub _address: u8,
}
pub type std_invoke_result_t = std__Select_invoke_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_invocable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_invocable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_invocable_r {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_invocable_r {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Function_args {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Weak_result_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Weak_argument_type {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Weak_binary_args {
    pub _address: u8,
}
pub type std__Weak_types = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Refwrap_has_ctor_from {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reference_wrapper<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Ptr: *mut _Ty,
}
pub type std_reference_wrapper_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Swappable_with_helper {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_swappable_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Swap_cannot_throw {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_nothrow_swappable_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_nothrow_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_swappable_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_swappable_with {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_nothrow_swappable {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_ADL_swap_detail__Has_ADL_swap {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_trivially_swappable {
    pub _address: u8,
}
pub const std__FNV_offset_basis: ::std::os::raw::c_ulonglong = 14695981039346656037;
pub const std__FNV_prime: ::std::os::raw::c_ulonglong = 1099511628211;
pub type std__Conditionally_enabled_hash_argument_type<_Kty> = _Kty;
pub type std__Conditionally_enabled_hash_result_type = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_hash {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_float_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_float_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_double_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_double_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_long_double_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_long_double_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_nullptr_t_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_nullptr_t_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_nothrow_hashable {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less {
    pub _address: u8,
}
pub type std_less_first_argument_type<_Ty> = _Ty;
pub type std_less_second_argument_type<_Ty> = _Ty;
pub type std_less_result_type = bool;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_less_open0_void_close0"]
        [::std::mem::size_of::<std_less>() - 1usize];
    ["Align of template specialization: std_less_open0_void_close0"]
        [::std::mem::align_of::<std_less>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Floating_type_traits {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Floating_type_traits_open0_float_close0"]
        [::std::mem::size_of::<std__Floating_type_traits>() - 1usize];
    ["Align of template specialization: std__Floating_type_traits_open0_float_close0"]
        [::std::mem::align_of::<std__Floating_type_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Floating_type_traits_open0_double_close0"]
        [::std::mem::size_of::<std__Floating_type_traits>() - 1usize];
    ["Align of template specialization: std__Floating_type_traits_open0_double_close0"]
        [::std::mem::align_of::<std__Floating_type_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Floating_type_traits_open0_long_double_close0"]
        [::std::mem::size_of::<std__Floating_type_traits>() - 1usize];
    ["Align of template specialization: std__Floating_type_traits_open0_long_double_close0"]
        [::std::mem::align_of::<std__Floating_type_traits>() - 1usize];
};
pub type std__Maybe_const = std_conditional_t;
extern "C" {
    #[link_name = "\u{1}?uncaught_exception@std@@YA_NXZ"]
    pub fn std_uncaught_exception() -> bool;
}
extern "C" {
    #[link_name = "\u{1}?uncaught_exceptions@std@@YAHXZ"]
    pub fn std_uncaught_exceptions() -> ::std::os::raw::c_int;
}
#[repr(C)]
pub struct std_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_exception {
    pub vtable_: *const std_exception__bindgen_vtable,
    pub _Data: __std_exception_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_exception"][::std::mem::size_of::<std_exception>() - 24usize];
    ["Alignment of std_exception"][::std::mem::align_of::<std_exception>() - 8usize];
    ["Offset of field: std_exception::_Data"]
        [::std::mem::offset_of!(std_exception, _Data) - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_exception {
    pub _base: std_exception,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_exception"][::std::mem::size_of::<std_bad_exception>() - 24usize];
    ["Alignment of std_bad_exception"][::std::mem::align_of::<std_bad_exception>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_alloc {
    pub _base: std_exception,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_alloc"][::std::mem::size_of::<std_bad_alloc>() - 24usize];
    ["Alignment of std_bad_alloc"][::std::mem::align_of::<std_bad_alloc>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_array_new_length {
    pub _base: std_bad_alloc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_array_new_length"]
        [::std::mem::size_of::<std_bad_array_new_length>() - 24usize];
    ["Alignment of std_bad_array_new_length"]
        [::std::mem::align_of::<std_bad_array_new_length>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_exception_ptr {
    pub _Data1: *mut ::std::os::raw::c_void,
    pub _Data2: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_exception_ptr"][::std::mem::size_of::<std_exception_ptr>() - 16usize];
    ["Alignment of std_exception_ptr"][::std::mem::align_of::<std_exception_ptr>() - 8usize];
    ["Offset of field: std_exception_ptr::_Data1"]
        [::std::mem::offset_of!(std_exception_ptr, _Data1) - 0usize];
    ["Offset of field: std_exception_ptr::_Data2"]
        [::std::mem::offset_of!(std_exception_ptr, _Data2) - 8usize];
};
#[repr(C)]
pub struct std_nested_exception__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_nested_exception {
    pub vtable_: *const std_nested_exception__bindgen_vtable,
    pub _Exc: std_exception_ptr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_nested_exception"][::std::mem::size_of::<std_nested_exception>() - 24usize];
    ["Alignment of std_nested_exception"][::std::mem::align_of::<std_nested_exception>() - 8usize];
    ["Offset of field: std_nested_exception::_Exc"]
        [::std::mem::offset_of!(std_nested_exception, _Exc) - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__With_nested_v2<_Uty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Uty>>,
    pub _base: _Uty,
    pub _base_1: std_nested_exception,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_variant_access {
    pub _base: std_exception,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_variant_access"][::std::mem::size_of::<std_bad_variant_access>() - 24usize];
    ["Alignment of std_bad_variant_access"]
        [::std::mem::align_of::<std_bad_variant_access>() - 8usize];
};
pub const std_hardware_constructive_interference_size: ::std::os::raw::c_ulonglong = 64;
pub const std_hardware_destructive_interference_size: ::std::os::raw::c_ulonglong = 64;
pub type std_new_handler = ::std::option::Option<unsafe extern "C" fn()>;
extern "C" {
    #[link_name = "\u{1}?set_new_handler@std@@YAP6AXXZP6AXXZ@Z"]
    pub fn std_set_new_handler(arg1: std_new_handler) -> std_new_handler;
}
extern "C" {
    #[link_name = "\u{1}?get_new_handler@std@@YAP6AXXZXZ"]
    pub fn std_get_new_handler() -> std_new_handler;
}
pub const std_memory_order_memory_order_relaxed: std_memory_order = 0;
pub const std_memory_order_memory_order_consume: std_memory_order = 1;
pub const std_memory_order_memory_order_acquire: std_memory_order = 2;
pub const std_memory_order_memory_order_release: std_memory_order = 3;
pub const std_memory_order_memory_order_acq_rel: std_memory_order = 4;
pub const std_memory_order_memory_order_seq_cst: std_memory_order = 5;
pub type std_memory_order = ::std::os::raw::c_int;
pub type std__Atomic_counter_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_initializer_list<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _First: *const _Elem,
    pub _Last: *const _Elem,
}
pub type std_initializer_list_value_type<_Elem> = _Elem;
pub type std_initializer_list_reference<_Elem> = *const _Elem;
pub type std_initializer_list_const_reference<_Elem> = *const _Elem;
pub type std_initializer_list_size_type = ::std::os::raw::c_ulonglong;
pub type std_initializer_list_iterator<_Elem> = *const _Elem;
pub type std_initializer_list_const_iterator<_Elem> = *const _Elem;
pub type std_integer_sequence_value_type<_Ty> = _Ty;
pub type std_make_integer_sequence = u8;
pub type std_index_sequence = u8;
pub type std_make_index_sequence = std_make_integer_sequence;
pub type std_index_sequence_for = std_make_index_sequence;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_piecewise_construct_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_piecewise_construct_t"]
        [::std::mem::size_of::<std_piecewise_construct_t>() - 1usize];
    ["Alignment of std_piecewise_construct_t"]
        [::std::mem::align_of::<std_piecewise_construct_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}?piecewise_construct@std@@3Upiecewise_construct_t@1@B"]
    pub static std_piecewise_construct: std_piecewise_construct_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_tuple_size {
    pub _address: u8,
}
pub type std_tuple_element_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pair<_Ty1, _Ty2> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty1>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty2>>,
    pub first: _Ty1,
    pub second: _Ty2,
}
pub type std_pair_first_type<_Ty1> = _Ty1;
pub type std_pair_second_type<_Ty2> = _Ty2;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Unrefwrap_helper {
    pub _address: u8,
}
pub type std__Unrefwrap_helper_type<_Ty> = _Ty;
pub type std__Unrefwrap_t = std__Unrefwrap_helper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_size_sfinae {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_in_place_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_in_place_t"][::std::mem::size_of::<std_in_place_t>() - 1usize];
    ["Alignment of std_in_place_t"][::std::mem::align_of::<std_in_place_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}?in_place@std@@3Uin_place_t@1@B"]
    pub static std_in_place: std_in_place_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_in_place_type_t {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_allocator_type {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_arg_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_allocator_arg_t"][::std::mem::size_of::<std_allocator_arg_t>() - 1usize];
    ["Alignment of std_allocator_arg_t"][::std::mem::align_of::<std_allocator_arg_t>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}?allocator_arg@std@@3Uallocator_arg_t@1@B"]
    pub static std_allocator_arg: std_allocator_arg_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_uses_allocator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_input_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_input_iterator_tag"][::std::mem::size_of::<std_input_iterator_tag>() - 1usize];
    ["Alignment of std_input_iterator_tag"]
        [::std::mem::align_of::<std_input_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_output_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_output_iterator_tag"][::std::mem::size_of::<std_output_iterator_tag>() - 1usize];
    ["Alignment of std_output_iterator_tag"]
        [::std::mem::align_of::<std_output_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_forward_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_forward_iterator_tag"]
        [::std::mem::size_of::<std_forward_iterator_tag>() - 1usize];
    ["Alignment of std_forward_iterator_tag"]
        [::std::mem::align_of::<std_forward_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_bidirectional_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bidirectional_iterator_tag"]
        [::std::mem::size_of::<std_bidirectional_iterator_tag>() - 1usize];
    ["Alignment of std_bidirectional_iterator_tag"]
        [::std::mem::align_of::<std_bidirectional_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_random_access_iterator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_random_access_iterator_tag"]
        [::std::mem::size_of::<std_random_access_iterator_tag>() - 1usize];
    ["Alignment of std_random_access_iterator_tag"]
        [::std::mem::align_of::<std_random_access_iterator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Iterator_traits_base {
    pub _address: u8,
}
pub type std__Iterator_traits_pointer_base_iterator_category = std_random_access_iterator_tag;
pub type std__Iterator_traits_pointer_base_value_type = std_remove_cv_t;
pub type std__Iterator_traits_pointer_base_difference_type = ::std::os::raw::c_longlong;
pub type std__Iterator_traits_pointer_base_pointer<_Ty> = *mut _Ty;
pub type std__Iterator_traits_pointer_base_reference<_Ty> = *mut _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_first_parameter {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Replace_first_parameter {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_ptr_difference_type {
    pub _address: u8,
}
pub type std__Get_ptr_difference_type_type = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_rebind_alias {
    pub _address: u8,
}
pub type std__Get_rebind_alias_type = std__Replace_first_parameter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Ptr_traits_base {
    pub _address: u8,
}
pub type std__Ptr_traits_base_pointer<_Ty> = _Ty;
pub type std__Ptr_traits_base_element_type<_Elem> = _Elem;
pub type std__Ptr_traits_base_difference_type = std__Get_ptr_difference_type;
pub type std__Ptr_traits_base_rebind = std__Get_rebind_alias;
pub type std__Ptr_traits_base__Reftype = *mut std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Ptr_traits_sfinae_layer {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pointer_traits {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_plus {
    pub _address: u8,
}
pub type std_plus_first_argument_type<_Ty> = _Ty;
pub type std_plus_second_argument_type<_Ty> = _Ty;
pub type std_plus_result_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_minus {
    pub _address: u8,
}
pub type std_minus_first_argument_type<_Ty> = _Ty;
pub type std_minus_second_argument_type<_Ty> = _Ty;
pub type std_minus_result_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_multiplies {
    pub _address: u8,
}
pub type std_multiplies_first_argument_type<_Ty> = _Ty;
pub type std_multiplies_second_argument_type<_Ty> = _Ty;
pub type std_multiplies_result_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_equal_to {
    pub _address: u8,
}
pub type std_equal_to_first_argument_type<_Ty> = _Ty;
pub type std_equal_to_second_argument_type<_Ty> = _Ty;
pub type std_equal_to_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_not_equal_to {
    pub _address: u8,
}
pub type std_not_equal_to_first_argument_type<_Ty> = _Ty;
pub type std_not_equal_to_second_argument_type<_Ty> = _Ty;
pub type std_not_equal_to_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater {
    pub _address: u8,
}
pub type std_greater_first_argument_type<_Ty> = _Ty;
pub type std_greater_second_argument_type<_Ty> = _Ty;
pub type std_greater_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_greater_equal {
    pub _address: u8,
}
pub type std_greater_equal_first_argument_type<_Ty> = _Ty;
pub type std_greater_equal_second_argument_type<_Ty> = _Ty;
pub type std_greater_equal_result_type = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_less_equal {
    pub _address: u8,
}
pub type std_less_equal_first_argument_type<_Ty> = _Ty;
pub type std_less_equal_second_argument_type<_Ty> = _Ty;
pub type std_less_equal_result_type = bool;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_plus_open0_void_close0"]
        [::std::mem::size_of::<std_plus>() - 1usize];
    ["Align of template specialization: std_plus_open0_void_close0"]
        [::std::mem::align_of::<std_plus>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_minus_open0_void_close0"]
        [::std::mem::size_of::<std_minus>() - 1usize];
    ["Align of template specialization: std_minus_open0_void_close0"]
        [::std::mem::align_of::<std_minus>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_multiplies_open0_void_close0"]
        [::std::mem::size_of::<std_multiplies>() - 1usize];
    ["Align of template specialization: std_multiplies_open0_void_close0"]
        [::std::mem::align_of::<std_multiplies>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_equal_to_open0_void_close0"]
        [::std::mem::size_of::<std_equal_to>() - 1usize];
    ["Align of template specialization: std_equal_to_open0_void_close0"]
        [::std::mem::align_of::<std_equal_to>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_not_equal_to_open0_void_close0"]
        [::std::mem::size_of::<std_not_equal_to>() - 1usize];
    ["Align of template specialization: std_not_equal_to_open0_void_close0"]
        [::std::mem::align_of::<std_not_equal_to>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_greater_open0_void_close0"]
        [::std::mem::size_of::<std_greater>() - 1usize];
    ["Align of template specialization: std_greater_open0_void_close0"]
        [::std::mem::align_of::<std_greater>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_greater_equal_open0_void_close0"]
        [::std::mem::size_of::<std_greater_equal>() - 1usize];
    ["Align of template specialization: std_greater_equal_open0_void_close0"]
        [::std::mem::align_of::<std_greater_equal>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_less_equal_open0_void_close0"]
        [::std::mem::size_of::<std_less_equal>() - 1usize];
    ["Align of template specialization: std_less_equal_open0_void_close0"]
        [::std::mem::align_of::<std_less_equal>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Ref_fn<_Fx> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Fx>>,
    pub _Fn: *mut _Fx,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Unused_parameter {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Unused_parameter"][::std::mem::size_of::<std__Unused_parameter>() - 1usize];
    ["Alignment of std__Unused_parameter"]
        [::std::mem::align_of::<std__Unused_parameter>() - 1usize];
};
pub type std__Algorithm_int_t = std_conditional_t;
pub type std__Iter_ref_t = std_iterator_traits;
pub type std__Iter_value_t = std_iterator_traits;
pub type std__Iter_diff_t = std_iterator_traits;
pub type std__Make_unsigned_like_t = std_make_unsigned_t;
pub type std__Common_diff_t = std_common_type_t;
pub type std__Iter_cat_t = std_iterator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_iterator {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_checked_helper {
    pub _address: u8,
}
pub type std__Unwrapped_t = std__Remove_cvref_t;
pub type std__Unwrapped_unverified_t = std__Remove_cvref_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Distance_unknown {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Distance_unknown"][::std::mem::size_of::<std__Distance_unknown>() - 1usize];
    ["Alignment of std__Distance_unknown"]
        [::std::mem::align_of::<std__Distance_unknown>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_allocator {
    pub _base: std_false_type,
}
pub type std__Guide_key_t = std_remove_const_t;
pub type std__Guide_val_t = std_iterator_traits;
pub type std__Guide_pair_t = std_pair<std_add_const_t, std_iterator_traits>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_execution_policy {
    pub _base: std_false_type,
}
pub type std__Enable_if_execution_policy_t = std_remove_reference_t;
pub type std__Unwrap_enum_type = std_underlying_type_t;
pub type std__Unwrap_enum_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_reverse_iterator<_BidIt> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_BidIt>>,
    pub current: _BidIt,
}
pub type std_reverse_iterator_iterator_type<_BidIt> = _BidIt;
pub type std_reverse_iterator_iterator_category = std__Iter_cat_t;
pub type std_reverse_iterator_value_type = std__Iter_value_t;
pub type std_reverse_iterator_difference_type = std__Iter_diff_t;
pub type std_reverse_iterator_pointer = std_iterator_traits;
pub type std_reverse_iterator_reference = std__Iter_ref_t;
pub type std_reverse_iterator__Prevent_inheriting_unwrap<_BidIt> = std_reverse_iterator<_BidIt>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Default_sentinel {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Default_sentinel"][::std::mem::size_of::<std__Default_sentinel>() - 1usize];
    ["Alignment of std__Default_sentinel"]
        [::std::mem::align_of::<std__Default_sentinel>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Move_iterator_category {
    pub _address: u8,
}
pub type std__Move_iterator_category_iterator_category = std__Iter_cat_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_move_iterator<_Iter> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iter>>,
    pub _Current: std_move_iterator_iterator_type<_Iter>,
}
pub type std_move_iterator_iterator_type<_Iter> = _Iter;
pub type std_move_iterator_value_type = std__Iter_value_t;
pub type std_move_iterator_difference_type = std__Iter_diff_t;
pub type std_move_iterator_pointer<_Iter> = _Iter;
pub type std_move_iterator_reference = std_conditional_t;
pub type std_move_iterator__Prevent_inheriting_unwrap<_Iter> = std_move_iterator<_Iter>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Trivial_cat {
    pub _address: u8,
}
pub type std__Trivial_cat__USource = std__Unwrap_enum_t;
pub type std__Trivial_cat__UDest = std__Unwrap_enum_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__False_trivial_cat {
    pub _address: u8,
}
pub const std__False_trivial_cat__Bitcopy_constructible: bool = false;
pub const std__False_trivial_cat__Bitcopy_assignable: bool = false;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__False_trivial_cat"][::std::mem::size_of::<std__False_trivial_cat>() - 1usize];
    ["Alignment of std__False_trivial_cat"]
        [::std::mem::align_of::<std__False_trivial_cat>() - 1usize];
};
pub type std__Sent_copy_cat = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_character {
    pub _base: std_false_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Is_character_open0_char_close0"]
        [::std::mem::size_of::<std__Is_character>() - 1usize];
    ["Align of template specialization: std__Is_character_open0_char_close0"]
        [::std::mem::align_of::<std__Is_character>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Is_character_open0_signed_char_close0"]
        [::std::mem::size_of::<std__Is_character>() - 1usize];
    ["Align of template specialization: std__Is_character_open0_signed_char_close0"]
        [::std::mem::align_of::<std__Is_character>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Is_character_open0_unsigned_char_close0"]
        [::std::mem::size_of::<std__Is_character>() - 1usize];
    ["Align of template specialization: std__Is_character_open0_unsigned_char_close0"]
        [::std::mem::align_of::<std__Is_character>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_character_or_bool {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Is_character_or_bool_open0_bool__close0"]
        [::std::mem::size_of::<std__Is_character_or_bool>() - 1usize];
    ["Align of template specialization: std__Is_character_or_bool_open0_bool__close0"]
        [::std::mem::align_of::<std__Is_character_or_bool>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_character_or_byte_or_bool {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std__Is_character_or_byte_or_bool_open0_std_byte_close0"]
        [::std::mem::size_of::<std__Is_character_or_byte_or_bool>() - 1usize];
    ["Align of template specialization: std__Is_character_or_byte_or_bool_open0_std_byte_close0"]
        [::std::mem::align_of::<std__Is_character_or_byte_or_bool>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Lex_compare_memcmp_classify_pred {
    pub _address: u8,
}
pub type std__Lex_compare_memcmp_classify_pred__Pred = ::std::os::raw::c_void;
pub type std__Lex_compare_memcmp_classify = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vector_alg_in_find_is_safe_object_pointers {
    pub _base: std_false_type,
}
pub const std__TrimResult__KeepTrimming: std__TrimResult = 0;
pub const std__TrimResult__HaveWorkAfterTrimming: std__TrimResult = 1;
pub const std__TrimResult__ReturnFalse: std__TrimResult = 2;
pub const std__TrimResult__ReturnTrue: std__TrimResult = 3;
pub type std__TrimResult = ::std::os::raw::c_uchar;
extern "C" {
    #[link_name = "\u{1}?_Xbad_alloc@std@@YAXXZ"]
    pub fn std__Xbad_alloc();
}
extern "C" {
    #[link_name = "\u{1}?_Xinvalid_argument@std@@YAXPEBD@Z"]
    pub fn std__Xinvalid_argument(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}?_Xlength_error@std@@YAXPEBD@Z"]
    pub fn std__Xlength_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}?_Xout_of_range@std@@YAXPEBD@Z"]
    pub fn std__Xout_of_range(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}?_Xoverflow_error@std@@YAXPEBD@Z"]
    pub fn std__Xoverflow_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}?_Xruntime_error@std@@YAXPEBD@Z"]
    pub fn std__Xruntime_error(arg1: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}?_XGetLastError@std@@YAXXZ"]
    pub fn std__XGetLastError();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_iterator {
    pub _address: u8,
}
pub type std_iterator_iterator_category<_Category> = _Category;
pub type std_iterator_value_type<_Ty> = _Ty;
pub type std_iterator_difference_type<_Diff> = _Diff;
pub type std_iterator_pointer<_Pointer> = _Pointer;
pub type std_iterator_reference<_Reference> = _Reference;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_monostate {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_monostate"][::std::mem::size_of::<std_monostate>() - 1usize];
    ["Alignment of std_monostate"][::std::mem::align_of::<std_monostate>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__Tidy_guard<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Target: *mut _Ty,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Tidy_deallocate_guard<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Target: *mut _Ty,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Default_allocate_traits {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Default_allocate_traits"]
        [::std::mem::size_of::<std__Default_allocate_traits>() - 1usize];
    ["Alignment of std__Default_allocate_traits"]
        [::std::mem::align_of::<std__Default_allocate_traits>() - 1usize];
};
pub const std__Big_allocation_threshold: ::std::os::raw::c_ulonglong = 4096;
pub const std__Big_allocation_alignment: ::std::os::raw::c_ulonglong = 32;
pub const std__Non_user_size: ::std::os::raw::c_ulonglong = 39;
pub const std__Big_allocation_sentinel: ::std::os::raw::c_ulonglong = 18085043209519168250;
pub type std__Rebind_pointer_t = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_pointer_type {
    pub _address: u8,
}
pub type std__Get_pointer_type_type = *mut [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_const_pointer_type {
    pub _address: u8,
}
pub type std__Get_const_pointer_type__Ptrty = std__Get_pointer_type;
pub type std__Get_const_pointer_type__Valty = [u8; 0usize];
pub type std__Get_const_pointer_type_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_void_pointer_type {
    pub _address: u8,
}
pub type std__Get_void_pointer_type__Ptrty = std__Get_pointer_type;
pub type std__Get_void_pointer_type_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_const_void_pointer_type {
    pub _address: u8,
}
pub type std__Get_const_void_pointer_type__Ptrty = std__Get_pointer_type;
pub type std__Get_const_void_pointer_type_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_difference_type {
    pub _address: u8,
}
pub type std__Get_difference_type__Ptrty = std__Get_pointer_type;
pub type std__Get_difference_type_type = std_pointer_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_size_type {
    pub _address: u8,
}
pub type std__Get_size_type_type = std_make_unsigned_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_propagate_on_container_copy {
    pub _address: u8,
}
pub type std__Get_propagate_on_container_copy_type = std_false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_propagate_on_container_move {
    pub _address: u8,
}
pub type std__Get_propagate_on_container_move_type = std_false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_propagate_on_container_swap {
    pub _address: u8,
}
pub type std__Get_propagate_on_container_swap_type = std_false_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_is_always_equal {
    pub _address: u8,
}
pub type std__Get_is_always_equal_type = std_bool_constant;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_rebind_type {
    pub _address: u8,
}
pub type std__Get_rebind_type_type = std__Replace_first_parameter;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_default_allocator {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_no_allocator_construct {
    pub _base: std_true_type,
}
pub type std__Uses_default_construct = std_disjunction;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_no_alloc_destroy {
    pub _base: std_true_type,
}
pub type std__Uses_default_destroy = std_disjunction;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_allocate_hint {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_max_size {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Has_select_on_container_copy_construction {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Normal_allocator_traits {
    pub _address: u8,
}
pub type std__Normal_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std__Normal_allocator_traits_value_type = [u8; 0usize];
pub type std__Normal_allocator_traits_pointer = std__Get_pointer_type;
pub type std__Normal_allocator_traits_const_pointer = std__Get_const_pointer_type;
pub type std__Normal_allocator_traits_void_pointer = std__Get_void_pointer_type;
pub type std__Normal_allocator_traits_const_void_pointer = std__Get_const_void_pointer_type;
pub type std__Normal_allocator_traits_size_type = std__Get_size_type;
pub type std__Normal_allocator_traits_difference_type = std__Get_difference_type;
pub type std__Normal_allocator_traits_propagate_on_container_copy_assignment =
    std__Get_propagate_on_container_copy;
pub type std__Normal_allocator_traits_propagate_on_container_move_assignment =
    std__Get_propagate_on_container_move;
pub type std__Normal_allocator_traits_propagate_on_container_swap =
    std__Get_propagate_on_container_swap;
pub type std__Normal_allocator_traits_is_always_equal = std__Get_is_always_equal;
pub type std__Normal_allocator_traits_rebind_alloc = std__Get_rebind_type;
pub type std__Normal_allocator_traits_rebind_traits = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Default_allocator_traits {
    pub _address: u8,
}
pub type std__Default_allocator_traits_allocator_type<_Alloc> = _Alloc;
pub type std__Default_allocator_traits_value_type = [u8; 0usize];
pub type std__Default_allocator_traits_pointer = *mut std__Default_allocator_traits_value_type;
pub type std__Default_allocator_traits_const_pointer =
    *const std__Default_allocator_traits_value_type;
pub type std__Default_allocator_traits_void_pointer = *mut ::std::os::raw::c_void;
pub type std__Default_allocator_traits_const_void_pointer = *const ::std::os::raw::c_void;
pub type std__Default_allocator_traits_size_type = ::std::os::raw::c_ulonglong;
pub type std__Default_allocator_traits_difference_type = ::std::os::raw::c_longlong;
pub type std__Default_allocator_traits_propagate_on_container_copy_assignment = std_false_type;
pub type std__Default_allocator_traits_propagate_on_container_move_assignment = std_true_type;
pub type std__Default_allocator_traits_propagate_on_container_swap = std_false_type;
pub type std__Default_allocator_traits_is_always_equal = std_true_type;
pub type std__Default_allocator_traits_rebind_alloc = std_allocator;
pub type std__Default_allocator_traits_rebind_traits = std_allocator_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_traits {
    pub _address: u8,
}
pub const std__Pocma_values__Equal_allocators: std__Pocma_values = 0;
pub const std__Pocma_values__Propagate_allocators: std__Pocma_values = 1;
pub const std__Pocma_values__No_propagate_allocators: std__Pocma_values = 2;
pub type std__Pocma_values = ::std::os::raw::c_int;
pub type std__Rebind_alloc_t = std_allocator_traits;
pub type std__Maybe_rebind_alloc_t = u8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Simple_types {
    pub _address: u8,
}
pub type std__Simple_types_value_type<_Value_type> = _Value_type;
pub type std__Simple_types_size_type = ::std::os::raw::c_ulonglong;
pub type std__Simple_types_difference_type = ::std::os::raw::c_longlong;
pub type std__Simple_types_pointer<_Value_type> = *mut std__Simple_types_value_type<_Value_type>;
pub type std__Simple_types_const_pointer<_Value_type> =
    *const std__Simple_types_value_type<_Value_type>;
pub const std__Asan_granularity: ::std::os::raw::c_ulonglong = 8;
pub const std__Asan_granularity_mask: ::std::os::raw::c_ulonglong = 7;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Asan_aligned_pointers {
    pub _First: *const ::std::os::raw::c_void,
    pub _End: *const ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Asan_aligned_pointers"]
        [::std::mem::size_of::<std__Asan_aligned_pointers>() - 16usize];
    ["Alignment of std__Asan_aligned_pointers"]
        [::std::mem::align_of::<std__Asan_aligned_pointers>() - 8usize];
    ["Offset of field: std__Asan_aligned_pointers::_First"]
        [::std::mem::offset_of!(std__Asan_aligned_pointers, _First) - 0usize];
    ["Offset of field: std__Asan_aligned_pointers::_End"]
        [::std::mem::offset_of!(std__Asan_aligned_pointers, _End) - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_allocator {
    pub _address: u8,
}
pub type std_allocator__From_primary = std_allocator;
pub type std_allocator_value_type<_Ty> = _Ty;
pub type std_allocator_pointer<_Ty> = *mut _Ty;
pub type std_allocator_const_pointer<_Ty> = *const _Ty;
pub type std_allocator_reference<_Ty> = *mut _Ty;
pub type std_allocator_const_reference<_Ty> = *const _Ty;
pub type std_allocator_size_type = ::std::os::raw::c_ulonglong;
pub type std_allocator_difference_type = ::std::os::raw::c_longlong;
pub type std_allocator_propagate_on_container_move_assignment = std_true_type;
pub type std_allocator_is_always_equal = std_true_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_allocator_rebind {
    pub _address: u8,
}
pub type std_allocator_rebind_other = std_allocator;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_allocator_open0_void_close0"]
        [::std::mem::size_of::<std_allocator>() - 1usize];
    ["Align of template specialization: std_allocator_open0_void_close0"]
        [::std::mem::align_of::<std_allocator>() - 1usize];
};
pub type std__Guide_size_type_t = std_allocator_traits;
pub type std__Alloc_ptr_t = std_allocator_traits;
pub type std__Alloc_size_t = std_allocator_traits;
#[repr(C)]
#[derive(Debug)]
pub struct std__Alloc_construct_ptr<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub _Al: *mut _Alloc,
    pub _Ptr: std__Alloc_construct_ptr_pointer,
}
pub type std__Alloc_construct_ptr_pointer = std__Alloc_ptr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Fake_allocator {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Fake_allocator"][::std::mem::size_of::<std__Fake_allocator>() - 1usize];
    ["Alignment of std__Fake_allocator"][::std::mem::align_of::<std__Fake_allocator>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Container_base0 {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Container_base0"][::std::mem::size_of::<std__Container_base0>() - 1usize];
    ["Alignment of std__Container_base0"][::std::mem::align_of::<std__Container_base0>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Iterator_base0 {
    pub _address: u8,
}
pub const std__Iterator_base0__Unwrap_when_unverified: bool = true;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Iterator_base0"][::std::mem::size_of::<std__Iterator_base0>() - 1usize];
    ["Alignment of std__Iterator_base0"][::std::mem::align_of::<std__Iterator_base0>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Container_proxy {
    pub _Mycont: *const std__Container_base12,
    pub _Myfirstiter: *mut std__Iterator_base12,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Container_proxy"][::std::mem::size_of::<std__Container_proxy>() - 16usize];
    ["Alignment of std__Container_proxy"][::std::mem::align_of::<std__Container_proxy>() - 8usize];
    ["Offset of field: std__Container_proxy::_Mycont"]
        [::std::mem::offset_of!(std__Container_proxy, _Mycont) - 0usize];
    ["Offset of field: std__Container_proxy::_Myfirstiter"]
        [::std::mem::offset_of!(std__Container_proxy, _Myfirstiter) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Container_base12 {
    pub _Myproxy: *mut std__Container_proxy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Container_base12"][::std::mem::size_of::<std__Container_base12>() - 8usize];
    ["Alignment of std__Container_base12"]
        [::std::mem::align_of::<std__Container_base12>() - 8usize];
    ["Offset of field: std__Container_base12::_Myproxy"]
        [::std::mem::offset_of!(std__Container_base12, _Myproxy) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Iterator_base12 {
    pub _Myproxy: *mut std__Container_proxy,
    pub _Mynextiter: *mut std__Iterator_base12,
}
pub const std__Iterator_base12__Unwrap_when_unverified: bool = true;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Iterator_base12"][::std::mem::size_of::<std__Iterator_base12>() - 16usize];
    ["Alignment of std__Iterator_base12"][::std::mem::align_of::<std__Iterator_base12>() - 8usize];
    ["Offset of field: std__Iterator_base12::_Myproxy"]
        [::std::mem::offset_of!(std__Iterator_base12, _Myproxy) - 0usize];
    ["Offset of field: std__Iterator_base12::_Mynextiter"]
        [::std::mem::offset_of!(std__Iterator_base12, _Mynextiter) - 8usize];
};
pub type std__Container_base = std__Container_base0;
pub type std__Iterator_base = std__Iterator_base0;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Leave_proxy_unbound {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Leave_proxy_unbound"]
        [::std::mem::size_of::<std__Leave_proxy_unbound>() - 1usize];
    ["Alignment of std__Leave_proxy_unbound"]
        [::std::mem::align_of::<std__Leave_proxy_unbound>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Fake_proxy_ptr_impl {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Fake_proxy_ptr_impl"]
        [::std::mem::size_of::<std__Fake_proxy_ptr_impl>() - 1usize];
    ["Alignment of std__Fake_proxy_ptr_impl"]
        [::std::mem::align_of::<std__Fake_proxy_ptr_impl>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Basic_container_proxy_ptr12 {
    pub _Ptr: *mut std__Container_proxy,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Basic_container_proxy_ptr12"]
        [::std::mem::size_of::<std__Basic_container_proxy_ptr12>() - 8usize];
    ["Alignment of std__Basic_container_proxy_ptr12"]
        [::std::mem::align_of::<std__Basic_container_proxy_ptr12>() - 8usize];
    ["Offset of field: std__Basic_container_proxy_ptr12::_Ptr"]
        [::std::mem::offset_of!(std__Basic_container_proxy_ptr12, _Ptr) - 0usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__Container_proxy_ptr12<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub _base: std__Basic_container_proxy_ptr12,
    pub _Al: *mut _Alloc,
}
extern "C" {
    #[link_name = "\u{1}?_Fake_alloc@std@@3U_Fake_allocator@1@B"]
    pub static std__Fake_alloc: std__Fake_allocator;
}
pub type std__Container_proxy_ptr = std__Fake_proxy_ptr_impl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Zero_then_variadic_args_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Zero_then_variadic_args_t"]
        [::std::mem::size_of::<std__Zero_then_variadic_args_t>() - 1usize];
    ["Alignment of std__Zero_then_variadic_args_t"]
        [::std::mem::align_of::<std__Zero_then_variadic_args_t>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__One_then_variadic_args_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__One_then_variadic_args_t"]
        [::std::mem::size_of::<std__One_then_variadic_args_t>() - 1usize];
    ["Alignment of std__One_then_variadic_args_t"]
        [::std::mem::align_of::<std__One_then_variadic_args_t>() - 1usize];
};
pub type std__Compressed_pair__Mybase<_Ty1> = _Ty1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Move_allocator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Move_allocator_tag"][::std::mem::size_of::<std__Move_allocator_tag>() - 1usize];
    ["Alignment of std__Move_allocator_tag"]
        [::std::mem::align_of::<std__Move_allocator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__Uninitialized_backout<_NoThrowFwdIt> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_NoThrowFwdIt>>,
    pub _First: _NoThrowFwdIt,
    pub _Last: _NoThrowFwdIt,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Uninitialized_backout_al<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub _First: std__Uninitialized_backout_al_pointer,
    pub _Last: std__Uninitialized_backout_al_pointer,
    pub _Al: *mut _Alloc,
}
pub type std__Uninitialized_backout_al_pointer = std__Alloc_ptr_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__In_place_key_extract_set {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__In_place_key_extract_map {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Wrap<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Value: _Ty,
}
#[repr(C)]
pub struct std__Alloc_temporary2<_Alloc> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alloc>>,
    pub _Al: *mut _Alloc,
    pub __bindgen_anon_1: std__Alloc_temporary2__bindgen_ty_1,
}
pub type std__Alloc_temporary2_value_type = [u8; 0usize];
pub type std__Alloc_temporary2__Traits = std_allocator_traits;
#[repr(C)]
#[repr(align(1))]
pub struct std__Alloc_temporary2__bindgen_ty_1 {
    pub _Value: __BindgenUnionField<std__Alloc_temporary2_value_type>,
    pub bindgen_union_field: [u8; 0usize],
}
pub type std__Normally_bound_ref<_Ty> = _Ty;
pub type std__Ebco_base__Mybase<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Is_transparent {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_constructible_val {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_assignable_val {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_convert_val {
    pub _base: std_true_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_perfect_val {
    pub _base: std_true_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Ignore {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Ignore"][::std::mem::size_of::<std__Ignore>() - 1usize];
    ["Alignment of std__Ignore"][::std::mem::align_of::<std__Ignore>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}?ignore@std@@3U_Ignore@1@B"]
    pub static std_ignore: std__Ignore;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_val<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Val: _Ty,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Exact_args_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Exact_args_t"][::std::mem::size_of::<std__Exact_args_t>() - 1usize];
    ["Alignment of std__Exact_args_t"][::std::mem::align_of::<std__Exact_args_t>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Unpack_tuple_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Unpack_tuple_t"][::std::mem::size_of::<std__Unpack_tuple_t>() - 1usize];
    ["Alignment of std__Unpack_tuple_t"][::std::mem::align_of::<std__Unpack_tuple_t>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Alloc_exact_args_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Alloc_exact_args_t"][::std::mem::size_of::<std__Alloc_exact_args_t>() - 1usize];
    ["Alignment of std__Alloc_exact_args_t"]
        [::std::mem::align_of::<std__Alloc_exact_args_t>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Alloc_unpack_tuple_t {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Alloc_unpack_tuple_t"]
        [::std::mem::size_of::<std__Alloc_unpack_tuple_t>() - 1usize];
    ["Alignment of std__Alloc_unpack_tuple_t"]
        [::std::mem::align_of::<std__Alloc_unpack_tuple_t>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_tuple_open0_close0"]
        [::std::mem::size_of::<std_tuple>() - 1usize];
    ["Align of template specialization: std_tuple_open0_close0"]
        [::std::mem::align_of::<std_tuple>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tuple_element {
    pub _address: u8,
}
pub type std__Tuple_cat1 = u8;
#[repr(C)]
pub struct std_pmr_memory_resource__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_pmr_memory_resource {
    pub vtable_: *const std_pmr_memory_resource__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_pmr_memory_resource"][::std::mem::size_of::<std_pmr_memory_resource>() - 8usize];
    ["Alignment of std_pmr_memory_resource"]
        [::std::mem::align_of::<std_pmr_memory_resource>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}_Aligned_get_default_resource"]
    pub fn std_pmr__Aligned_get_default_resource() -> *mut std_pmr_memory_resource;
}
extern "C" {
    #[link_name = "\u{1}_Unaligned_get_default_resource"]
    pub fn std_pmr__Unaligned_get_default_resource() -> *mut std_pmr_memory_resource;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_pmr_polymorphic_allocator {
    pub _Resource: *mut std_pmr_memory_resource,
}
pub type std_pmr_polymorphic_allocator_value_type<_Ty> = _Ty;
pub type std_pmr_basic_string = std_basic_string;
pub type std_pmr_string = std_basic_string;
pub type std_pmr_u16string = std_basic_string;
pub type std_pmr_u32string = std_basic_string;
pub type std_pmr_wstring = std_basic_string;
pub type std_pmr_vector = std_vector;
pub type std_pmr_map = std_map;
pub type std_pmr_multimap = std_multimap;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Char_traits {
    pub _address: u8,
}
pub type std__Char_traits_char_type<_Elem> = _Elem;
pub type std__Char_traits_int_type<_Int_type> = _Int_type;
pub type std__Char_traits_pos_type = std_streampos;
pub type std__Char_traits_off_type = std_streamoff;
pub type std__Char_traits_state_type = _Mbstatet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__WChar_traits {
    pub _address: u8,
}
pub type std__WChar_traits__Primary_char_traits = std__Char_traits;
pub type std__WChar_traits_char_type<_Elem> = _Elem;
pub type std__WChar_traits_int_type = ::std::os::raw::c_ushort;
pub type std__WChar_traits_pos_type = std_streampos;
pub type std__WChar_traits_off_type = std_streamoff;
pub type std__WChar_traits_state_type = _Mbstatet;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_char_traits {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Narrow_char_traits {
    pub _address: u8,
}
pub type std__Narrow_char_traits__Primary_char_traits = std__Char_traits;
pub type std__Narrow_char_traits_char_type<_Elem> = _Elem;
pub type std__Narrow_char_traits_int_type<_Int_type> = _Int_type;
pub type std__Narrow_char_traits_pos_type = std_streampos;
pub type std__Narrow_char_traits_off_type = std_streamoff;
pub type std__Narrow_char_traits_state_type = _Mbstatet;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
pub type std__Traits_ch_t = [u8; 0usize];
pub type std__Traits_ptr_t = *const [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__String_view_iterator {
    pub _Myptr: std__String_view_iterator_pointer,
}
pub type std__String_view_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__String_view_iterator_value_type = [u8; 0usize];
pub type std__String_view_iterator_difference_type = ::std::os::raw::c_longlong;
pub type std__String_view_iterator_pointer = *const std__String_view_iterator_value_type;
pub type std__String_view_iterator_reference = *const std__String_view_iterator_value_type;
pub type std__String_view_iterator__Prevent_inheriting_unwrap = std__String_view_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_basic_string_view<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Mydata: std_basic_string_view_const_pointer<_Elem>,
    pub _Mysize: std_basic_string_view_size_type,
}
pub type std_basic_string_view_traits_type<_Traits> = _Traits;
pub type std_basic_string_view_value_type<_Elem> = _Elem;
pub type std_basic_string_view_pointer<_Elem> = *mut _Elem;
pub type std_basic_string_view_const_pointer<_Elem> = *const _Elem;
pub type std_basic_string_view_reference<_Elem> = *mut _Elem;
pub type std_basic_string_view_const_reference<_Elem> = *const _Elem;
pub type std_basic_string_view_const_iterator = std__String_view_iterator;
pub type std_basic_string_view_iterator = std_basic_string_view_const_iterator;
pub type std_basic_string_view_const_reverse_iterator =
    std_reverse_iterator<std_basic_string_view_const_iterator>;
pub type std_basic_string_view_reverse_iterator = std_basic_string_view_const_reverse_iterator;
pub type std_basic_string_view_size_type = ::std::os::raw::c_ulonglong;
pub type std_basic_string_view_difference_type = ::std::os::raw::c_longlong;
pub type std_string_view = std_basic_string_view<::std::os::raw::c_char>;
pub type std_u16string_view = std_basic_string_view<u16>;
pub type std_u32string_view = std_basic_string_view<u32>;
pub type std_wstring_view = std_basic_string_view<u16>;
#[repr(C)]
pub struct std__String_const_iterator {
    pub _Ptr: std__String_const_iterator_pointer,
}
pub type std__String_const_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__String_const_iterator_value_type = [u8; 0usize];
pub type std__String_const_iterator_difference_type = [u8; 0usize];
pub type std__String_const_iterator_pointer = [u8; 0usize];
pub type std__String_const_iterator_reference = *const std__String_const_iterator_value_type;
pub type std__String_const_iterator__Prevent_inheriting_unwrap = std__String_const_iterator;
#[repr(C)]
pub struct std__String_iterator {
    pub _base: std__String_const_iterator,
}
pub type std__String_iterator__Mybase = std__String_const_iterator;
pub type std__String_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__String_iterator_value_type = [u8; 0usize];
pub type std__String_iterator_difference_type = [u8; 0usize];
pub type std__String_iterator_pointer = [u8; 0usize];
pub type std__String_iterator_reference = *mut std__String_iterator_value_type;
pub type std__String_iterator__Prevent_inheriting_unwrap = std__String_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__String_iter_types {
    pub _address: u8,
}
pub type std__String_iter_types_value_type<_Value_type> = _Value_type;
pub type std__String_iter_types_size_type<_Size_type> = _Size_type;
pub type std__String_iter_types_difference_type<_Difference_type> = _Difference_type;
pub type std__String_iter_types_pointer<_Pointer> = _Pointer;
pub type std__String_iter_types_const_pointer<_Const_pointer> = _Const_pointer;
#[repr(C)]
pub struct std__String_val {
    pub _Bx: std__String_val__Bxty,
    pub _Mysize: std__String_val_size_type,
    pub _Myres: std__String_val_size_type,
}
pub type std__String_val_value_type = [u8; 0usize];
pub type std__String_val_size_type = [u8; 0usize];
pub type std__String_val_difference_type = [u8; 0usize];
pub type std__String_val_pointer = [u8; 0usize];
pub type std__String_val_const_pointer = [u8; 0usize];
pub type std__String_val_reference = *mut std__String_val_value_type;
pub type std__String_val_const_reference = *const std__String_val_value_type;
#[repr(C)]
pub struct std__String_val__Bxty {
    pub _Buf: __BindgenUnionField<*mut std__String_val_value_type>,
    pub _Ptr: __BindgenUnionField<std__String_val_pointer>,
    pub _Alias: __BindgenUnionField<*mut ::std::os::raw::c_char>,
    pub bindgen_union_field: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__String_constructor_concat_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__String_constructor_concat_tag"]
        [::std::mem::size_of::<std__String_constructor_concat_tag>() - 1usize];
    ["Alignment of std__String_constructor_concat_tag"]
        [::std::mem::align_of::<std__String_constructor_concat_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__String_constructor_rvalue_allocator_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__String_constructor_rvalue_allocator_tag"]
        [::std::mem::size_of::<std__String_constructor_rvalue_allocator_tag>() - 1usize];
    ["Alignment of std__String_constructor_rvalue_allocator_tag"]
        [::std::mem::align_of::<std__String_constructor_rvalue_allocator_tag>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_string {
    pub _Mypair: u8,
}
pub type std_basic_string__Alty = std__Rebind_alloc_t;
pub type std_basic_string__Alty_traits = std_allocator_traits;
pub type std_basic_string__Scary_val = std__String_val;
pub type std_basic_string_traits_type<_Traits> = _Traits;
pub type std_basic_string_allocator_type<_Alloc> = _Alloc;
pub type std_basic_string_value_type<_Elem> = _Elem;
pub type std_basic_string_size_type = std_basic_string__Alty_traits;
pub type std_basic_string_difference_type = std_basic_string__Alty_traits;
pub type std_basic_string_pointer = std_basic_string__Alty_traits;
pub type std_basic_string_const_pointer = std_basic_string__Alty_traits;
pub type std_basic_string_reference<_Elem> = *mut std_basic_string_value_type<_Elem>;
pub type std_basic_string_const_reference<_Elem> = *const std_basic_string_value_type<_Elem>;
pub type std_basic_string_iterator = std__String_iterator;
pub type std_basic_string_const_iterator = std__String_const_iterator;
pub type std_basic_string_reverse_iterator = std_reverse_iterator<std_basic_string_iterator>;
pub type std_basic_string_const_reverse_iterator =
    std_reverse_iterator<std_basic_string_const_iterator>;
pub type std_basic_string__Is_elem_cptr = std_bool_constant;
pub type std_basic_string__Is_string_view_ish = std_enable_if_t;
pub const std_basic_string__Allocation_policy__At_least: std_basic_string__Allocation_policy = 0;
pub const std_basic_string__Allocation_policy__Exactly: std_basic_string__Allocation_policy = 0;
pub type std_basic_string__Allocation_policy = ::std::os::raw::c_int;
pub const std_basic_string__Construct_strategy__From_char: std_basic_string__Construct_strategy = 0;
pub const std_basic_string__Construct_strategy__From_ptr: std_basic_string__Construct_strategy = 0;
pub const std_basic_string__Construct_strategy__From_string: std_basic_string__Construct_strategy =
    0;
pub type std_basic_string__Construct_strategy = ::std::os::raw::c_uchar;
pub type std_string = std_basic_string;
pub type std_wstring = std_basic_string;
pub type std_u16string = std_basic_string;
pub type std_u32string = std_basic_string;
extern "C" {
    #[link_name = "\u{1}__isa_available"]
    pub static mut std___isa_available: ::std::os::raw::c_int;
}
pub const std__Stl_isa_available_sse42: ::std::os::raw::c_int = 2;
pub const std__Stl_isa_available_avx2: ::std::os::raw::c_int = 5;
#[repr(C)]
pub struct std__Vector_const_iterator {
    pub _Ptr: std__Vector_const_iterator__Tptr,
}
pub type std__Vector_const_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Vector_const_iterator_value_type = [u8; 0usize];
pub type std__Vector_const_iterator_difference_type = [u8; 0usize];
pub type std__Vector_const_iterator_pointer = [u8; 0usize];
pub type std__Vector_const_iterator_reference = *const std__Vector_const_iterator_value_type;
pub type std__Vector_const_iterator__Tptr = [u8; 0usize];
pub type std__Vector_const_iterator__Prevent_inheriting_unwrap = std__Vector_const_iterator;
#[repr(C)]
pub struct std__Vector_iterator {
    pub _base: std__Vector_const_iterator,
}
pub type std__Vector_iterator__Mybase = std__Vector_const_iterator;
pub type std__Vector_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Vector_iterator_value_type = [u8; 0usize];
pub type std__Vector_iterator_difference_type = [u8; 0usize];
pub type std__Vector_iterator_pointer = [u8; 0usize];
pub type std__Vector_iterator_reference = *mut std__Vector_iterator_value_type;
pub type std__Vector_iterator__Prevent_inheriting_unwrap = std__Vector_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vec_iter_types {
    pub _address: u8,
}
pub type std__Vec_iter_types_value_type<_Value_type> = _Value_type;
pub type std__Vec_iter_types_size_type<_Size_type> = _Size_type;
pub type std__Vec_iter_types_difference_type<_Difference_type> = _Difference_type;
pub type std__Vec_iter_types_pointer<_Pointer> = _Pointer;
pub type std__Vec_iter_types_const_pointer<_Const_pointer> = _Const_pointer;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Value_init_tag {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Value_init_tag"][::std::mem::size_of::<std__Value_init_tag>() - 1usize];
    ["Alignment of std__Value_init_tag"][::std::mem::align_of::<std__Value_init_tag>() - 1usize];
};
#[repr(C)]
pub struct std__Vector_val {
    pub _Myfirst: std__Vector_val_pointer,
    pub _Mylast: std__Vector_val_pointer,
    pub _Myend: std__Vector_val_pointer,
}
pub type std__Vector_val_value_type = [u8; 0usize];
pub type std__Vector_val_size_type = [u8; 0usize];
pub type std__Vector_val_difference_type = [u8; 0usize];
pub type std__Vector_val_pointer = [u8; 0usize];
pub type std__Vector_val_const_pointer = [u8; 0usize];
pub type std__Vector_val_reference = *mut std__Vector_val_value_type;
pub type std__Vector_val_const_reference = *const std__Vector_val_value_type;
#[repr(C)]
#[derive(Debug)]
pub struct std_vector {
    pub _Mypair: u8,
}
pub type std_vector__Alty = std__Rebind_alloc_t;
pub type std_vector__Alty_traits = std_allocator_traits;
pub type std_vector_value_type<_Ty> = _Ty;
pub type std_vector_allocator_type<_Alloc> = _Alloc;
pub type std_vector_pointer = std_vector__Alty_traits;
pub type std_vector_const_pointer = std_vector__Alty_traits;
pub type std_vector_reference<_Ty> = *mut _Ty;
pub type std_vector_const_reference<_Ty> = *const _Ty;
pub type std_vector_size_type = std_vector__Alty_traits;
pub type std_vector_difference_type = std_vector__Alty_traits;
pub type std_vector__Scary_val = std__Vector_val;
pub type std_vector_iterator = std__Vector_iterator;
pub type std_vector_const_iterator = std__Vector_const_iterator;
pub type std_vector_reverse_iterator = std_reverse_iterator<std_vector_iterator>;
pub type std_vector_const_reverse_iterator = std_reverse_iterator<std_vector_const_iterator>;
pub const std_vector__Reallocation_policy__At_least: std_vector__Reallocation_policy = 0;
pub const std_vector__Reallocation_policy__Exactly: std_vector__Reallocation_policy = 0;
pub type std_vector__Reallocation_policy = ::std::os::raw::c_int;
pub type std__Vbase = ::std::os::raw::c_uint;
pub const std__VBITS: ::std::os::raw::c_int = 32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Vbase_compare_three_way {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Wrap_alloc {
    pub _address: u8,
}
pub type std__Wrap_alloc__Alloc<_Alloc0> = _Alloc0;
#[repr(C)]
pub struct std__Vb_iter_base {
    pub _Myptr: *const std__Vbase,
    pub _Myoff: std__Vb_iter_base__Size_type,
}
pub type std__Vb_iter_base__Alvbase = [u8; 0usize];
pub type std__Vb_iter_base__Size_type = [u8; 0usize];
pub type std__Vb_iter_base__Difference_type = [u8; 0usize];
pub type std__Vb_iter_base__Mycont = std_vector;
#[repr(C)]
pub struct std__Vb_reference {
    pub _base: std__Vb_iter_base,
}
pub type std__Vb_reference__Mybase = std__Vb_iter_base;
pub type std__Vb_reference__Mycont = std__Vb_reference__Mybase;
pub type std__Vb_reference__Difference_type = std__Vb_reference__Mybase;
#[repr(C)]
pub struct std__Vb_const_iterator {
    pub _base: std__Vb_iter_base,
}
pub type std__Vb_const_iterator__Mybase = std__Vb_iter_base;
pub type std__Vb_const_iterator__Mycont = std__Vb_const_iterator__Mybase;
pub type std__Vb_const_iterator__Difference_type = std__Vb_const_iterator__Mybase;
pub type std__Vb_const_iterator__Size_type = std__Vb_const_iterator__Mybase;
pub type std__Vb_const_iterator__Reft = std__Vb_reference;
pub type std__Vb_const_iterator_const_reference = bool;
pub type std__Vb_const_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Vb_const_iterator_value_type = bool;
pub type std__Vb_const_iterator_difference_type = std__Vb_const_iterator__Mybase;
pub type std__Vb_const_iterator_pointer = *mut std__Vb_const_iterator_const_reference;
pub type std__Vb_const_iterator_reference = std__Vb_const_iterator_const_reference;
#[repr(C)]
pub struct std__Vb_iterator {
    pub _base: std__Vb_const_iterator,
}
pub type std__Vb_iterator__Mybase = std__Vb_const_iterator;
pub type std__Vb_iterator__Mycont = std__Vb_iterator__Mybase;
pub type std__Vb_iterator__Difference_type = std__Vb_iterator__Mybase;
pub type std__Vb_iterator__Reft = std__Vb_reference;
pub type std__Vb_iterator_const_reference = bool;
pub type std__Vb_iterator_iterator_category = std_random_access_iterator_tag;
pub type std__Vb_iterator_value_type = bool;
pub type std__Vb_iterator_difference_type = std__Vb_iterator__Mybase;
pub type std__Vb_iterator_pointer = *mut std__Vb_iterator__Reft;
pub type std__Vb_iterator_reference = std__Vb_iterator__Reft;
pub type std__Vb_iterator__Prevent_inheriting_unwrap = std__Vb_iterator;
#[repr(C)]
#[derive(Debug)]
pub struct std__Vb_val {
    pub _Myvec: std__Vb_val__Vectype,
    pub _Mysize: std__Vb_val_size_type,
}
pub type std__Vb_val__Alvbase = std__Rebind_alloc_t;
pub type std__Vb_val__Alvbase_traits = std_allocator_traits;
pub type std__Vb_val__Vectype = std_vector;
pub type std__Vb_val__Alvbase_wrapped = std__Wrap_alloc;
pub type std__Vb_val_size_type = std__Vb_val__Alvbase_traits;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Non_trivial_copy<_Base> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Base>>,
    pub _base: _Base,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Deleted_copy<_Base> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Base>>,
    pub _base: _Base,
}
pub type std__SMF_control_copy = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Non_trivial_move {
    pub _address: u8,
}
pub type std__Non_trivial_move__Mybase = std__SMF_control_copy;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Deleted_move {
    pub _address: u8,
}
pub type std__Deleted_move__Mybase = std__SMF_control_copy;
pub type std__SMF_control_move = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Non_trivial_copy_assign {
    pub _address: u8,
}
pub type std__Non_trivial_copy_assign__Mybase = std__SMF_control_move;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Deleted_copy_assign {
    pub _address: u8,
}
pub type std__Deleted_copy_assign__Mybase = std__SMF_control_move;
pub type std__SMF_control_copy_assign = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Non_trivial_move_assign {
    pub _address: u8,
}
pub type std__Non_trivial_move_assign__Mybase = std__SMF_control_copy_assign;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Deleted_move_assign {
    pub _address: u8,
}
pub type std__Deleted_move_assign__Mybase = std__SMF_control_copy_assign;
pub type std__SMF_control_move_assign = std_conditional_t;
pub type std__SMF_control = std__SMF_control_move_assign;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_list {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_front_ {
    pub _address: u8,
}
pub type std__Meta_front = std__Meta_front_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_pop_front_ {
    pub _address: u8,
}
pub type std__Meta_pop_front = std__Meta_pop_front_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_push_front_ {
    pub _address: u8,
}
pub type std__Meta_push_front = std__Meta_push_front_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_quote_helper_ {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_quote {
    pub _address: u8,
}
pub type std__Meta_quote__Invoke = std__Meta_quote_helper_;
pub type std__Meta_invoke = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_bind_back {
    pub _address: u8,
}
pub type std__Meta_bind_back__Invoke = std__Meta_invoke;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_apply_ {
    pub _address: u8,
}
pub type std__Meta_apply = std__Meta_apply_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_transform_ {
    pub _address: u8,
}
pub type std__Meta_transform = std__Meta_transform_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_repeat_n_c_ {
    pub _address: u8,
}
pub type std__Meta_repeat_n_c = std__Meta_repeat_n_c_;
pub type std__Meta_repeat_first_helper<_Ty> = _Ty;
pub type std__Meta_at_c = u8;
extern "C" {
    #[link_name = "\u{1}?_Meta_npos@std@@3_KB"]
    pub static std__Meta_npos: ::std::os::raw::c_ulonglong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_find_unique_index_ {
    pub _address: u8,
}
pub type std__Meta_find_unique_index__type = u8;
pub type std__Meta_find_unique_index = std__Meta_find_unique_index_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_as_list_ {
    pub _address: u8,
}
pub type std__Meta_as_list = std__Meta_as_list_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_as_integer_sequence_ {
    pub _address: u8,
}
pub type std__Meta_as_integer_sequence = std__Meta_as_integer_sequence_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_concat_ {
    pub _address: u8,
}
pub type std__Meta_concat = std__Meta_concat_;
pub type std__Meta_join = std__Meta_apply;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Meta_cartesian_product_ {
    pub _address: u8,
}
pub type std__Meta_cartesian_product = std__Meta_cartesian_product_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_variant_size {
    pub _address: u8,
}
pub type std_variant_alternative_t = u8;
extern "C" {
    #[link_name = "\u{1}?variant_npos@std@@3_KB"]
    pub static std_variant_npos: ::std::os::raw::c_ulonglong;
}
pub type std__Variant_storage = u8;
pub type std__Variant_tagged_ref_t = u8;
pub type std__Variant_raw_visit_t<_Fn> = _Fn;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_raw_dispatch_table1 {
    pub _address: u8,
}
pub const std__Schar_max_as_size: ::std::os::raw::c_ulonglong = 127;
pub const std__Short_max_as_size: ::std::os::raw::c_ulonglong = 32767;
pub type std__Variant_index_t = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_construct_visitor {
    pub _Self: *mut std__Variant_base,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_assign_visitor {
    pub _Self: *mut std__Variant_base,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_base {
    pub _Which: std__Variant_base__Index_t,
}
pub type std__Variant_base__Index_t = std__Variant_index_t;
pub type std__Variant_base__Storage_t = std__Variant_storage;
#[repr(C)]
#[derive(Debug)]
pub struct std__Variant_destroy_layer_ {
    pub _base: std__Variant_base,
}
pub type std__Variant_destroy_layer = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_init_overload_set_ {
    pub _address: u8,
}
pub type std__Variant_init_overload_set = std__Variant_init_overload_set_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_init_helper {
    pub _address: u8,
}
pub type std__Variant_init_type = std__Meta_front;
pub type std__Variant_init_index = std__Meta_front;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_variant {
    pub _address: u8,
}
pub type std_variant__Mybase = std__SMF_control;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_relop_visitor2 {
    pub _Left: *const std__Variant_storage,
}
pub type std__Variant_visit_result_t<_Callable> = _Callable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_dispatcher {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_dispatch_table {
    pub _address: u8,
}
pub type std__As_variant<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Variant_hash_visitor {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Variant_hash_visitor"]
        [::std::mem::size_of::<std__Variant_hash_visitor>() - 1usize];
    ["Alignment of std__Variant_hash_visitor"]
        [::std::mem::align_of::<std__Variant_hash_visitor>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_std_monostate_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_std_monostate_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Insert_return_type<_Iterator, _NodeType> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_NodeType>>,
    pub position: _Iterator,
    pub inserted: bool,
    pub node: _NodeType,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Node_handle_map_base {
    pub _address: u8,
}
pub type std__Node_handle_map_base_key_type<_KeyTy> = _KeyTy;
pub type std__Node_handle_map_base_mapped_type<_ValueTy> = _ValueTy;
pub type std__Node_handle_map_base__Pair_type<_KeyTy, _ValueTy> = std_pair<
    std__Node_handle_map_base_key_type<_KeyTy>,
    std__Node_handle_map_base_mapped_type<_ValueTy>,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Node_handle_set_base {
    pub _address: u8,
}
pub type std__Node_handle_set_base_value_type<_ValueTy> = _ValueTy;
#[repr(C)]
#[derive(Debug)]
pub struct std__Node_handle {
    pub _Ptr: std__Node_handle__Nodeptr,
    pub _Alloc_storage: std__Aligned_storage_t,
}
pub type std__Node_handle_allocator_type<_Alloc> = _Alloc;
pub type std__Node_handle__Alty_traits = std_allocator_traits;
pub type std__Node_handle__Alnode = std__Rebind_alloc_t;
pub type std__Node_handle__Alnode_traits = std_allocator_traits;
pub type std__Node_handle__Nodeptr = std__Node_handle__Alnode_traits;
#[repr(C)]
pub struct std__Tree_unchecked_const_iterator<_Base> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Base>>,
    pub _base: _Base,
    pub _Ptr: std__Tree_unchecked_const_iterator__Nodeptr,
}
pub type std__Tree_unchecked_const_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std__Tree_unchecked_const_iterator__Nodeptr = [u8; 0usize];
pub type std__Tree_unchecked_const_iterator_value_type = [u8; 0usize];
pub type std__Tree_unchecked_const_iterator_difference_type = [u8; 0usize];
pub type std__Tree_unchecked_const_iterator_pointer = [u8; 0usize];
pub type std__Tree_unchecked_const_iterator_reference =
    *const std__Tree_unchecked_const_iterator_value_type;
#[repr(C)]
pub struct std__Tree_unchecked_iterator {
    pub _base: std__Tree_unchecked_const_iterator<_Base>,
}
pub type std__Tree_unchecked_iterator__Mybase = std__Tree_unchecked_const_iterator<_Base>;
pub type std__Tree_unchecked_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std__Tree_unchecked_iterator__Nodeptr = [u8; 0usize];
pub type std__Tree_unchecked_iterator_value_type = [u8; 0usize];
pub type std__Tree_unchecked_iterator_difference_type = [u8; 0usize];
pub type std__Tree_unchecked_iterator_pointer = [u8; 0usize];
pub type std__Tree_unchecked_iterator_reference = *mut std__Tree_unchecked_iterator_value_type;
#[repr(C)]
pub struct std__Tree_const_iterator {
    pub _base: std__Tree_unchecked_const_iterator<std__Iterator_base>,
}
pub type std__Tree_const_iterator__Mybase = std__Tree_unchecked_const_iterator<std__Iterator_base>;
pub type std__Tree_const_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std__Tree_const_iterator__Nodeptr = [u8; 0usize];
pub type std__Tree_const_iterator_value_type = [u8; 0usize];
pub type std__Tree_const_iterator_difference_type = [u8; 0usize];
pub type std__Tree_const_iterator_pointer = [u8; 0usize];
pub type std__Tree_const_iterator_reference = *const std__Tree_const_iterator_value_type;
pub type std__Tree_const_iterator__Prevent_inheriting_unwrap = std__Tree_const_iterator;
#[repr(C)]
pub struct std__Tree_iterator {
    pub _base: std__Tree_const_iterator,
}
pub type std__Tree_iterator__Mybase = std__Tree_const_iterator;
pub type std__Tree_iterator_iterator_category = std_bidirectional_iterator_tag;
pub type std__Tree_iterator__Nodeptr = [u8; 0usize];
pub type std__Tree_iterator_value_type = [u8; 0usize];
pub type std__Tree_iterator_difference_type = [u8; 0usize];
pub type std__Tree_iterator_pointer = [u8; 0usize];
pub type std__Tree_iterator_reference = *mut std__Tree_iterator_value_type;
pub type std__Tree_iterator__Prevent_inheriting_unwrap = std__Tree_iterator;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tree_iter_types {
    pub _address: u8,
}
pub type std__Tree_iter_types_value_type<_Value_type> = _Value_type;
pub type std__Tree_iter_types_size_type<_Size_type> = _Size_type;
pub type std__Tree_iter_types_difference_type<_Difference_type> = _Difference_type;
pub type std__Tree_iter_types_pointer<_Pointer> = _Pointer;
pub type std__Tree_iter_types_const_pointer<_Const_pointer> = _Const_pointer;
pub type std__Tree_iter_types__Nodeptr<_Nodeptr_type> = _Nodeptr_type;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tree_node<_Value_type> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Value_type>>,
    pub _Left: std__Tree_node__Nodeptr,
    pub _Parent: std__Tree_node__Nodeptr,
    pub _Right: std__Tree_node__Nodeptr,
    pub _Color: ::std::os::raw::c_char,
    pub _Isnil: ::std::os::raw::c_char,
    pub _Myval: std__Tree_node_value_type<_Value_type>,
}
pub type std__Tree_node__Nodeptr = std__Rebind_pointer_t;
pub type std__Tree_node_value_type<_Value_type> = _Value_type;
pub const std__Tree_node__Redbl__Red: std__Tree_node__Redbl = 0;
pub const std__Tree_node__Redbl__Black: std__Tree_node__Redbl = 0;
pub type std__Tree_node__Redbl = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tree_simple_types {
    pub _address: u8,
}
pub type std__Tree_simple_types__Node = std__Tree_node<_Value_type>;
pub type std__Tree_simple_types__Nodeptr = *mut std__Tree_simple_types__Node;
pub const std__Tree_child__Right: std__Tree_child = 0;
pub const std__Tree_child__Left: std__Tree_child = 1;
pub const std__Tree_child__Unused: std__Tree_child = 2;
pub type std__Tree_child = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tree_id<_Nodeptr> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Nodeptr>>,
    pub _Parent: _Nodeptr,
    pub _Child: std__Tree_child,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tree_find_result<_Nodeptr> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Nodeptr>>,
    pub _Location: std__Tree_id<_Nodeptr>,
    pub _Bound: _Nodeptr,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tree_find_hint_result<_Nodeptr> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Nodeptr>>,
    pub _Location: std__Tree_id<_Nodeptr>,
    pub _Duplicate: bool,
}
#[repr(C)]
pub struct std__Tree_val {
    pub _Myhead: std__Tree_val__Nodeptr,
    pub _Mysize: std__Tree_val_size_type,
}
pub type std__Tree_val__Nodeptr = [u8; 0usize];
pub type std__Tree_val_value_type = [u8; 0usize];
pub type std__Tree_val_size_type = [u8; 0usize];
pub type std__Tree_val_difference_type = [u8; 0usize];
pub type std__Tree_val_pointer = [u8; 0usize];
pub type std__Tree_val_const_pointer = [u8; 0usize];
pub type std__Tree_val_reference = *mut std__Tree_val_value_type;
pub type std__Tree_val_const_reference = *const std__Tree_val_value_type;
pub type std__Tree_val__Unchecked_const_iterator = std__Tree_unchecked_const_iterator<_Base>;
pub type std__Tree_val_const_iterator = std__Tree_const_iterator;
pub const std__Tree_val__Redbl__Red: std__Tree_val__Redbl = 0;
pub const std__Tree_val__Redbl__Black: std__Tree_val__Redbl = 0;
pub type std__Tree_val__Redbl = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug)]
pub struct std__Tree_head_scoped_ptr<_Alnode, _Scary_val> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alnode>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Scary_val>>,
    pub _Al: *mut _Alnode,
    pub _Mycont: *mut _Scary_val,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Tree_temp_node_alloc<_Alnode> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alnode>>,
    pub _base: std__Alloc_construct_ptr<_Alnode>,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Tree_temp_node<_Alnode> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Alnode>>,
    pub _base: std__Tree_temp_node_alloc<_Alnode>,
}
pub type std__Tree_temp_node__Alnode_traits = std_allocator_traits;
pub type std__Tree_temp_node__Nodeptr = std__Tree_temp_node__Alnode_traits;
pub const std__Tree_temp_node__Redbl__Red: std__Tree_temp_node__Redbl = 0;
pub const std__Tree_temp_node__Redbl__Black: std__Tree_temp_node__Redbl = 0;
pub type std__Tree_temp_node__Redbl = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug)]
pub struct std__Tree {
    pub _Mypair: u8,
}
pub type std__Tree_key_type = [u8; 0usize];
pub type std__Tree_value_type = [u8; 0usize];
pub type std__Tree_allocator_type = [u8; 0usize];
pub type std__Tree__Alty = std__Rebind_alloc_t;
pub type std__Tree__Alty_traits = std_allocator_traits;
pub type std__Tree__Node = std__Tree_node<std__Tree_value_type>;
pub type std__Tree__Alnode = std__Rebind_alloc_t;
pub type std__Tree__Alnode_traits = std_allocator_traits;
pub type std__Tree__Nodeptr = [u8; 0usize];
pub type std__Tree__Scary_val = std__Tree_val;
pub const std__Tree__Redbl__Red: std__Tree__Redbl = 0;
pub const std__Tree__Redbl__Black: std__Tree__Redbl = 0;
pub type std__Tree__Redbl = ::std::os::raw::c_int;
pub type std__Tree_value_compare = [u8; 0usize];
pub type std__Tree_key_compare = [u8; 0usize];
pub type std__Tree_size_type = [u8; 0usize];
pub type std__Tree_difference_type = [u8; 0usize];
pub type std__Tree_pointer = [u8; 0usize];
pub type std__Tree_const_pointer = [u8; 0usize];
pub type std__Tree_reference = *mut std__Tree_value_type;
pub type std__Tree_const_reference = *const std__Tree_value_type;
pub type std__Tree_iterator = std_conditional_t;
pub type std__Tree__Unchecked_iterator = std_conditional_t;
pub type std__Tree__Unchecked_const_iterator = std__Tree_unchecked_const_iterator<_Base>;
pub type std__Tree_reverse_iterator = std_reverse_iterator<std__Tree_iterator>;
pub type std__Tree_const_reverse_iterator = std_reverse_iterator<std__Tree_const_iterator>;
pub const std__Tree__Strategy__Copy: std__Tree__Strategy = false;
pub const std__Tree__Strategy__Move: std__Tree__Strategy = false;
pub type std__Tree__Strategy = bool;
pub type std__Tree_node_type = [u8; 0usize];
pub type std__Tmap_traits_key_type<_Kty> = _Kty;
pub type std__Tmap_traits_value_type<_Kty, _Ty> = std_pair<_Kty, _Ty>;
pub type std__Tmap_traits_key_compare<_Pr> = _Pr;
pub type std__Tmap_traits_allocator_type<_Alloc> = _Alloc;
pub type std__Tmap_traits_node_type = std__Node_handle;
pub type std__Tmap_traits__In_place_key_extractor = std__In_place_key_extract_map;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Tmap_traits_value_compare<_Pr> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Pr>>,
    pub comp: std__Tmap_traits_key_compare<_Pr>,
}
pub type std__Tmap_traits_value_compare_first_argument_type<_Kty, _Ty> =
    std__Tmap_traits_value_type<_Kty, _Ty>;
pub type std__Tmap_traits_value_compare_second_argument_type<_Kty, _Ty> =
    std__Tmap_traits_value_type<_Kty, _Ty>;
pub type std__Tmap_traits_value_compare_result_type = bool;
#[repr(C)]
#[derive(Debug)]
pub struct std_map {
    pub _base: std__Tree,
}
pub type std_map__Mybase = std__Tree;
pub type std_map__Nodeptr = std_map__Mybase;
pub type std_map_key_type<_Kty> = _Kty;
pub type std_map_mapped_type<_Ty> = _Ty;
pub type std_map_key_compare<_Pr> = _Pr;
pub type std_map_value_compare = std_map__Mybase;
pub type std_map_value_type<_Kty, _Ty> = std_pair<_Kty, _Ty>;
pub type std_map_allocator_type = std_map__Mybase;
pub type std_map_size_type = std_map__Mybase;
pub type std_map_difference_type = std_map__Mybase;
pub type std_map_pointer = std_map__Mybase;
pub type std_map_const_pointer = std_map__Mybase;
pub type std_map_reference<_Kty, _Ty> = *mut std_map_value_type<_Kty, _Ty>;
pub type std_map_const_reference<_Kty, _Ty> = *const std_map_value_type<_Kty, _Ty>;
pub type std_map_iterator = std_map__Mybase;
pub type std_map_const_iterator = std_map__Mybase;
pub type std_map_reverse_iterator = std_map__Mybase;
pub type std_map_const_reverse_iterator = std_map__Mybase;
pub type std_map__Alnode = std_map__Mybase;
pub type std_map__Alnode_traits = std_map__Mybase;
pub type std_map_insert_return_type = std__Insert_return_type<std_map_iterator, std_map__Mybase>;
#[repr(C)]
#[derive(Debug)]
pub struct std_multimap {
    pub _base: std__Tree,
}
pub type std_multimap__Mybase = std__Tree;
pub type std_multimap_key_type<_Kty> = _Kty;
pub type std_multimap_mapped_type<_Ty> = _Ty;
pub type std_multimap_key_compare<_Pr> = _Pr;
pub type std_multimap_value_compare = std_multimap__Mybase;
pub type std_multimap_value_type<_Kty, _Ty> = std_pair<_Kty, _Ty>;
pub type std_multimap_allocator_type = std_multimap__Mybase;
pub type std_multimap_size_type = std_multimap__Mybase;
pub type std_multimap_difference_type = std_multimap__Mybase;
pub type std_multimap_pointer = std_multimap__Mybase;
pub type std_multimap_const_pointer = std_multimap__Mybase;
pub type std_multimap_reference<_Kty, _Ty> = *mut std_multimap_value_type<_Kty, _Ty>;
pub type std_multimap_const_reference<_Kty, _Ty> = *const std_multimap_value_type<_Kty, _Ty>;
pub type std_multimap_iterator = std_multimap__Mybase;
pub type std_multimap_const_iterator = std_multimap__Mybase;
pub type std_multimap_reverse_iterator = std_multimap__Mybase;
pub type std_multimap_const_reverse_iterator = std_multimap__Mybase;
pub type std_multimap__Alnode = std_multimap__Mybase;
pub type std_multimap__Alnode_traits = std_multimap__Mybase;
pub const std__ISORT_MAX: ::std::os::raw::c_int = 32;
#[repr(C)]
#[derive(Debug)]
pub struct std__Optimistic_temporary_buffer<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Data: *mut _Ty,
    pub _Capacity: ::std::os::raw::c_longlong,
    pub _Stack_space: *mut std__Aligned_storage_t,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Rng_from_urng<_Urng> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Urng>>,
    pub _Ref: *mut _Urng,
    pub _Bits: ::std::os::raw::c_ulonglong,
    pub _Bmask: std__Rng_from_urng__Udiff,
}
pub type std__Rng_from_urng__Ty0 = std_make_unsigned_t;
pub type std__Rng_from_urng__Ty1 = std__Invoke_result_t;
pub type std__Rng_from_urng__Udiff = std_conditional_t;
pub type std__Common_float_type_t = std_conditional_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_back_insert_iterator<_Container> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    pub container: *mut _Container,
}
pub type std_back_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_back_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_back_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_back_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_back_insert_iterator_container_type<_Container> = _Container;
pub type std_back_insert_iterator_difference_type = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_front_insert_iterator<_Container> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    pub container: *mut _Container,
}
pub type std_front_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_front_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_front_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_front_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_front_insert_iterator_container_type<_Container> = _Container;
pub type std_front_insert_iterator_difference_type = ::std::os::raw::c_void;
#[repr(C)]
pub struct std_insert_iterator<_Container> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    pub container: *mut _Container,
    pub iter: std_insert_iterator__Wrapped_iter,
}
pub type std_insert_iterator_iterator_category = std_output_iterator_tag;
pub type std_insert_iterator_value_type = ::std::os::raw::c_void;
pub type std_insert_iterator_pointer = ::std::os::raw::c_void;
pub type std_insert_iterator_reference = ::std::os::raw::c_void;
pub type std_insert_iterator_container_type<_Container> = _Container;
pub type std_insert_iterator_difference_type = ::std::os::raw::c_void;
pub type std_insert_iterator__Wrapped_iter = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istream_iterator<_Ty, _Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Myistr: *mut std_istream_iterator_istream_type<_Elem>,
    pub _Myval: _Ty,
}
pub type std_istream_iterator_iterator_category = std_input_iterator_tag;
pub type std_istream_iterator_value_type<_Ty> = _Ty;
pub type std_istream_iterator_difference_type<_Diff> = _Diff;
pub type std_istream_iterator_pointer<_Ty> = *const _Ty;
pub type std_istream_iterator_reference<_Ty> = *const _Ty;
pub type std_istream_iterator_char_type<_Elem> = _Elem;
pub type std_istream_iterator_traits_type<_Traits> = _Traits;
pub type std_istream_iterator_istream_type<_Elem> = std_basic_istream<_Elem>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostream_iterator<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Mydelim: *const _Elem,
    pub _Myostr: *mut std_ostream_iterator_ostream_type<_Elem>,
}
pub type std_ostream_iterator_iterator_category = std_output_iterator_tag;
pub type std_ostream_iterator_value_type = ::std::os::raw::c_void;
pub type std_ostream_iterator_difference_type = ::std::os::raw::c_void;
pub type std_ostream_iterator_pointer = ::std::os::raw::c_void;
pub type std_ostream_iterator_reference = ::std::os::raw::c_void;
pub type std_ostream_iterator_char_type<_Elem> = _Elem;
pub type std_ostream_iterator_traits_type<_Traits> = _Traits;
pub type std_ostream_iterator_ostream_type<_Elem> = std_basic_ostream<_Elem>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Strbuf: *mut std_istreambuf_iterator_streambuf_type<_Elem>,
    pub _Got: bool,
    pub _Val: _Elem,
}
pub type std_istreambuf_iterator_iterator_category = std_input_iterator_tag;
pub type std_istreambuf_iterator_value_type<_Elem> = _Elem;
pub type std_istreambuf_iterator_difference_type = [u8; 0usize];
pub type std_istreambuf_iterator_pointer<_Elem> = *const _Elem;
pub type std_istreambuf_iterator_reference<_Elem> = _Elem;
pub type std_istreambuf_iterator_char_type<_Elem> = _Elem;
pub type std_istreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_istreambuf_iterator_int_type = [u8; 0usize];
pub type std_istreambuf_iterator_streambuf_type<_Elem> = std_basic_streambuf<_Elem>;
pub type std_istreambuf_iterator_istream_type<_Elem> = std_basic_istream<_Elem>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_istreambuf_iterator__Istreambuf_proxy<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Strbuf: *mut std_istreambuf_iterator_streambuf_type<_Elem>,
    pub _Keep: _Elem,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ostreambuf_iterator<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Failed: bool,
    pub _Strbuf: *mut std_ostreambuf_iterator_streambuf_type<_Elem>,
}
pub type std_ostreambuf_iterator_iterator_category = std_output_iterator_tag;
pub type std_ostreambuf_iterator_value_type = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_difference_type = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_pointer = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_reference = ::std::os::raw::c_void;
pub type std_ostreambuf_iterator_char_type<_Elem> = _Elem;
pub type std_ostreambuf_iterator_traits_type<_Traits> = _Traits;
pub type std_ostreambuf_iterator_streambuf_type<_Elem> = std_basic_streambuf<_Elem>;
pub type std_ostreambuf_iterator_ostream_type<_Elem> = std_basic_ostream<_Elem>;
#[repr(C)]
#[derive(Debug)]
pub struct std_logic_error {
    pub _base: std_exception,
}
pub type std_logic_error__Mybase = std_exception;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_logic_error"][::std::mem::size_of::<std_logic_error>() - 24usize];
    ["Alignment of std_logic_error"][::std::mem::align_of::<std_logic_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_domain_error {
    pub _base: std_logic_error,
}
pub type std_domain_error__Mybase = std_logic_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_domain_error"][::std::mem::size_of::<std_domain_error>() - 24usize];
    ["Alignment of std_domain_error"][::std::mem::align_of::<std_domain_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_invalid_argument {
    pub _base: std_logic_error,
}
pub type std_invalid_argument__Mybase = std_logic_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_invalid_argument"][::std::mem::size_of::<std_invalid_argument>() - 24usize];
    ["Alignment of std_invalid_argument"][::std::mem::align_of::<std_invalid_argument>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_length_error {
    pub _base: std_logic_error,
}
pub type std_length_error__Mybase = std_logic_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_length_error"][::std::mem::size_of::<std_length_error>() - 24usize];
    ["Alignment of std_length_error"][::std::mem::align_of::<std_length_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_out_of_range {
    pub _base: std_logic_error,
}
pub type std_out_of_range__Mybase = std_logic_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_out_of_range"][::std::mem::size_of::<std_out_of_range>() - 24usize];
    ["Alignment of std_out_of_range"][::std::mem::align_of::<std_out_of_range>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_runtime_error {
    pub _base: std_exception,
}
pub type std_runtime_error__Mybase = std_exception;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_runtime_error"][::std::mem::size_of::<std_runtime_error>() - 24usize];
    ["Alignment of std_runtime_error"][::std::mem::align_of::<std_runtime_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_overflow_error {
    pub _base: std_runtime_error,
}
pub type std_overflow_error__Mybase = std_runtime_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_overflow_error"][::std::mem::size_of::<std_overflow_error>() - 24usize];
    ["Alignment of std_overflow_error"][::std::mem::align_of::<std_overflow_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_underflow_error {
    pub _base: std_runtime_error,
}
pub type std_underflow_error__Mybase = std_runtime_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_underflow_error"][::std::mem::size_of::<std_underflow_error>() - 24usize];
    ["Alignment of std_underflow_error"][::std::mem::align_of::<std_underflow_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_range_error {
    pub _base: std_runtime_error,
}
pub type std_range_error__Mybase = std_runtime_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_range_error"][::std::mem::size_of::<std_range_error>() - 24usize];
    ["Alignment of std_range_error"][::std::mem::align_of::<std_range_error>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_once_flag {
    pub _Opaque: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_once_flag"][::std::mem::size_of::<std_once_flag>() - 8usize];
    ["Alignment of std_once_flag"][::std::mem::align_of::<std_once_flag>() - 8usize];
    ["Offset of field: std_once_flag::_Opaque"]
        [::std::mem::offset_of!(std_once_flag, _Opaque) - 0usize];
};
#[repr(C)]
#[repr(align(1))]
pub struct std__Immortalizer_impl<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Storage: __BindgenUnionField<_Ty>,
    pub bindgen_union_field: [u8; 0usize],
}
extern "C" {
    #[link_name = "\u{1}__std_init_once_begin_initialize_clr"]
    pub fn std___std_init_once_begin_initialize_clr(
        _LpInitOnce: *mut *mut ::std::os::raw::c_void,
        _DwFlags: ::std::os::raw::c_ulong,
        _FPending: *mut ::std::os::raw::c_int,
        _LpContext: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__std_init_once_complete_clr"]
    pub fn std___std_init_once_complete_clr(
        _LpInitOnce: *mut *mut ::std::os::raw::c_void,
        _DwFlags: ::std::os::raw::c_ulong,
        _LpContext: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__std_init_once_link_alternate_names_and_abort"]
    pub fn std___std_init_once_link_alternate_names_and_abort();
}
pub const std__Init_once_init_failed: ::std::os::raw::c_ulong = 4;
#[repr(C)]
#[derive(Debug)]
pub struct std__Init_once_completer {
    pub _Once: *mut std_once_flag,
    pub _DwFlags: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Init_once_completer"]
        [::std::mem::size_of::<std__Init_once_completer>() - 16usize];
    ["Alignment of std__Init_once_completer"]
        [::std::mem::align_of::<std__Init_once_completer>() - 8usize];
    ["Offset of field: std__Init_once_completer::_Once"]
        [::std::mem::offset_of!(std__Init_once_completer, _Once) - 0usize];
    ["Offset of field: std__Init_once_completer::_DwFlags"]
        [::std::mem::offset_of!(std__Init_once_completer, _DwFlags) - 8usize];
};
pub const std_errc_address_family_not_supported: std_errc = 102;
pub const std_errc_address_in_use: std_errc = 100;
pub const std_errc_address_not_available: std_errc = 101;
pub const std_errc_already_connected: std_errc = 113;
pub const std_errc_argument_list_too_long: std_errc = 7;
pub const std_errc_argument_out_of_domain: std_errc = 33;
pub const std_errc_bad_address: std_errc = 14;
pub const std_errc_bad_file_descriptor: std_errc = 9;
pub const std_errc_bad_message: std_errc = 104;
pub const std_errc_broken_pipe: std_errc = 32;
pub const std_errc_connection_aborted: std_errc = 106;
pub const std_errc_connection_already_in_progress: std_errc = 103;
pub const std_errc_connection_refused: std_errc = 107;
pub const std_errc_connection_reset: std_errc = 108;
pub const std_errc_cross_device_link: std_errc = 18;
pub const std_errc_destination_address_required: std_errc = 109;
pub const std_errc_device_or_resource_busy: std_errc = 16;
pub const std_errc_directory_not_empty: std_errc = 41;
pub const std_errc_executable_format_error: std_errc = 8;
pub const std_errc_file_exists: std_errc = 17;
pub const std_errc_file_too_large: std_errc = 27;
pub const std_errc_filename_too_long: std_errc = 38;
pub const std_errc_function_not_supported: std_errc = 40;
pub const std_errc_host_unreachable: std_errc = 110;
pub const std_errc_identifier_removed: std_errc = 111;
pub const std_errc_illegal_byte_sequence: std_errc = 42;
pub const std_errc_inappropriate_io_control_operation: std_errc = 25;
pub const std_errc_interrupted: std_errc = 4;
pub const std_errc_invalid_argument: std_errc = 22;
pub const std_errc_invalid_seek: std_errc = 29;
pub const std_errc_io_error: std_errc = 5;
pub const std_errc_is_a_directory: std_errc = 21;
pub const std_errc_message_size: std_errc = 115;
pub const std_errc_network_down: std_errc = 116;
pub const std_errc_network_reset: std_errc = 117;
pub const std_errc_network_unreachable: std_errc = 118;
pub const std_errc_no_buffer_space: std_errc = 119;
pub const std_errc_no_child_process: std_errc = 10;
pub const std_errc_no_link: std_errc = 121;
pub const std_errc_no_lock_available: std_errc = 39;
pub const std_errc_no_message_available: std_errc = 120;
pub const std_errc_no_message: std_errc = 122;
pub const std_errc_no_protocol_option: std_errc = 123;
pub const std_errc_no_space_on_device: std_errc = 28;
pub const std_errc_no_stream_resources: std_errc = 124;
pub const std_errc_no_such_device_or_address: std_errc = 6;
pub const std_errc_no_such_device: std_errc = 19;
pub const std_errc_no_such_file_or_directory: std_errc = 2;
pub const std_errc_no_such_process: std_errc = 3;
pub const std_errc_not_a_directory: std_errc = 20;
pub const std_errc_not_a_socket: std_errc = 128;
pub const std_errc_not_a_stream: std_errc = 125;
pub const std_errc_not_connected: std_errc = 126;
pub const std_errc_not_enough_memory: std_errc = 12;
pub const std_errc_not_supported: std_errc = 129;
pub const std_errc_operation_canceled: std_errc = 105;
pub const std_errc_operation_in_progress: std_errc = 112;
pub const std_errc_operation_not_permitted: std_errc = 1;
pub const std_errc_operation_not_supported: std_errc = 130;
pub const std_errc_operation_would_block: std_errc = 140;
pub const std_errc_owner_dead: std_errc = 133;
pub const std_errc_permission_denied: std_errc = 13;
pub const std_errc_protocol_error: std_errc = 134;
pub const std_errc_protocol_not_supported: std_errc = 135;
pub const std_errc_read_only_file_system: std_errc = 30;
pub const std_errc_resource_deadlock_would_occur: std_errc = 36;
pub const std_errc_resource_unavailable_try_again: std_errc = 11;
pub const std_errc_result_out_of_range: std_errc = 34;
pub const std_errc_state_not_recoverable: std_errc = 127;
pub const std_errc_stream_timeout: std_errc = 137;
pub const std_errc_text_file_busy: std_errc = 139;
pub const std_errc_timed_out: std_errc = 138;
pub const std_errc_too_many_files_open_in_system: std_errc = 23;
pub const std_errc_too_many_files_open: std_errc = 24;
pub const std_errc_too_many_links: std_errc = 31;
pub const std_errc_too_many_symbolic_link_levels: std_errc = 114;
pub const std_errc_value_too_large: std_errc = 132;
pub const std_errc_wrong_protocol_type: std_errc = 136;
pub type std_errc = ::std::os::raw::c_int;
pub const _DEVICE_OR_RESOURCE_BUSY: std__bindgen_ty_1 = 0;
pub const _INVALID_ARGUMENT: std__bindgen_ty_1 = 1;
pub const _NO_SUCH_PROCESS: std__bindgen_ty_1 = 2;
pub const _NOT_ENOUGH_MEMORY: std__bindgen_ty_1 = 3;
pub const _OPERATION_NOT_PERMITTED: std__bindgen_ty_1 = 4;
pub const _RESOURCE_DEADLOCK_WOULD_OCCUR: std__bindgen_ty_1 = 5;
pub const _RESOURCE_UNAVAILABLE_TRY_AGAIN: std__bindgen_ty_1 = 6;
pub type std__bindgen_ty_1 = ::std::os::raw::c_int;
extern "C" {
    #[link_name = "\u{1}?_Throw_Cpp_error@std@@YAXH@Z"]
    pub fn std__Throw_Cpp_error(_Code: ::std::os::raw::c_int);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Storage_for {
    pub _Storage: *mut ::std::os::raw::c_uchar,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Atomic_padded<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Value: _Ty,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Atomic_storage_types {
    pub _address: u8,
}
pub type std__Atomic_storage_types__TStorage<_Ty> = std__Atomic_padded<_Ty>;
pub type std__Atomic_storage_types__Spinlock = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug)]
pub struct std__Atomic_lock_guard<_Spinlock_t> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Spinlock_t>>,
    pub _Spinlock: *mut _Spinlock_t,
}
pub type std__Atomic_storage__TVal = std_remove_reference_t;
pub type std__Atomic_storage__Guard = std__Atomic_lock_guard<std__Atomic_storage_types>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Atomic_integral_facade {
    pub _address: u8,
}
pub type std__Atomic_integral_facade__Base = u8;
pub type std__Atomic_integral_facade_difference_type<_Ty> = _Ty;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Atomic_pointer {
    pub _address: u8,
}
pub type std__Atomic_pointer__Base = u8;
pub type std__Atomic_pointer_difference_type = ::std::os::raw::c_longlong;
pub type std__Choose_atomic_base2_t = u8;
pub type std__Choose_atomic_base_t = std__Choose_atomic_base2_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic {
    pub _address: u8,
}
pub type std_atomic__Base = std__Choose_atomic_base_t;
pub type std_atomic_value_type<_Ty> = _Ty;
pub type std_atomic_bool = std_atomic;
pub type std_atomic_char = std_atomic;
pub type std_atomic_schar = std_atomic;
pub type std_atomic_uchar = std_atomic;
pub type std_atomic_short = std_atomic;
pub type std_atomic_ushort = std_atomic;
pub type std_atomic_int = std_atomic;
pub type std_atomic_uint = std_atomic;
pub type std_atomic_long = std_atomic;
pub type std_atomic_ulong = std_atomic;
pub type std_atomic_llong = std_atomic;
pub type std_atomic_ullong = std_atomic;
pub type std_atomic_char16_t = std_atomic;
pub type std_atomic_char32_t = std_atomic;
pub type std_atomic_wchar_t = std_atomic;
pub type std_atomic_int8_t = std_atomic;
pub type std_atomic_uint8_t = std_atomic;
pub type std_atomic_int16_t = std_atomic;
pub type std_atomic_uint16_t = std_atomic;
pub type std_atomic_int32_t = std_atomic;
pub type std_atomic_uint32_t = std_atomic;
pub type std_atomic_int64_t = std_atomic;
pub type std_atomic_uint64_t = std_atomic;
pub type std_atomic_int_least8_t = std_atomic;
pub type std_atomic_uint_least8_t = std_atomic;
pub type std_atomic_int_least16_t = std_atomic;
pub type std_atomic_uint_least16_t = std_atomic;
pub type std_atomic_int_least32_t = std_atomic;
pub type std_atomic_uint_least32_t = std_atomic;
pub type std_atomic_int_least64_t = std_atomic;
pub type std_atomic_uint_least64_t = std_atomic;
pub type std_atomic_int_fast8_t = std_atomic;
pub type std_atomic_uint_fast8_t = std_atomic;
pub type std_atomic_int_fast16_t = std_atomic;
pub type std_atomic_uint_fast16_t = std_atomic;
pub type std_atomic_int_fast32_t = std_atomic;
pub type std_atomic_uint_fast32_t = std_atomic;
pub type std_atomic_int_fast64_t = std_atomic;
pub type std_atomic_uint_fast64_t = std_atomic;
pub type std_atomic_intptr_t = std_atomic;
pub type std_atomic_uintptr_t = std_atomic;
pub type std_atomic_size_t = std_atomic;
pub type std_atomic_ptrdiff_t = std_atomic;
pub type std_atomic_intmax_t = std_atomic;
pub type std_atomic_uintmax_t = std_atomic;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_atomic_flag {
    pub _Storage: std_atomic,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_atomic_flag"][::std::mem::size_of::<std_atomic_flag>() - 4usize];
    ["Alignment of std_atomic_flag"][::std::mem::align_of::<std_atomic_flag>() - 4usize];
    ["Offset of field: std_atomic_flag::_Storage"]
        [::std::mem::offset_of!(std_atomic_flag, _Storage) - 0usize];
};
pub const std_io_errc_stream: std_io_errc = 1;
pub type std_io_errc = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_code_enum {
    pub _base: std_false_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_is_error_code_enum_open0_std_io_errc_close0"]
        [::std::mem::size_of::<std_is_error_code_enum>() - 1usize];
    ["Align of template specialization: std_is_error_code_enum_open0_std_io_errc_close0"]
        [::std::mem::align_of::<std_is_error_code_enum>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_is_error_condition_enum {
    pub _base: std_false_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_is_error_condition_enum_open0_std_errc_close0"]
        [::std::mem::size_of::<std_is_error_condition_enum>() - 1usize];
    ["Align of template specialization: std_is_error_condition_enum_open0_std_errc_close0"]
        [::std::mem::align_of::<std_is_error_condition_enum>() - 1usize];
};
#[repr(C)]
pub struct std_error_category__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
pub struct std_error_category {
    pub vtable_: *const std_error_category__bindgen_vtable,
    pub _Addr: std_error_category__Addr_storage,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union std_error_category__Addr_storage {
    pub _Num: ::std::os::raw::c_ulonglong,
    pub _Ptr: *mut std_error_category,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_error_category__Addr_storage"]
        [::std::mem::size_of::<std_error_category__Addr_storage>() - 8usize];
    ["Alignment of std_error_category__Addr_storage"]
        [::std::mem::align_of::<std_error_category__Addr_storage>() - 8usize];
    ["Offset of field: std_error_category__Addr_storage::_Num"]
        [::std::mem::offset_of!(std_error_category__Addr_storage, _Num) - 0usize];
    ["Offset of field: std_error_category__Addr_storage::_Ptr"]
        [::std::mem::offset_of!(std_error_category__Addr_storage, _Ptr) - 0usize];
};
pub const std_error_category__Future_addr: std_error_category__bindgen_ty_1 = 1;
pub const std_error_category__Generic_addr: std_error_category__bindgen_ty_1 = 3;
pub const std_error_category__Iostream_addr: std_error_category__bindgen_ty_1 = 5;
pub const std_error_category__System_addr: std_error_category__bindgen_ty_1 = 7;
pub type std_error_category__bindgen_ty_1 = ::std::os::raw::c_ulonglong;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_error_category"][::std::mem::size_of::<std_error_category>() - 16usize];
    ["Alignment of std_error_category"][::std::mem::align_of::<std_error_category>() - 8usize];
    ["Offset of field: std_error_category::_Addr"]
        [::std::mem::offset_of!(std_error_category, _Addr) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_code {
    pub _Myval: ::std::os::raw::c_int,
    pub _Mycat: *const std_error_category,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_error_code"][::std::mem::size_of::<std_error_code>() - 16usize];
    ["Alignment of std_error_code"][::std::mem::align_of::<std_error_code>() - 8usize];
    ["Offset of field: std_error_code::_Myval"]
        [::std::mem::offset_of!(std_error_code, _Myval) - 0usize];
    ["Offset of field: std_error_code::_Mycat"]
        [::std::mem::offset_of!(std_error_code, _Mycat) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_error_condition {
    pub _Myval: ::std::os::raw::c_int,
    pub _Mycat: *const std_error_category,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_error_condition"][::std::mem::size_of::<std_error_condition>() - 16usize];
    ["Alignment of std_error_condition"][::std::mem::align_of::<std_error_condition>() - 8usize];
    ["Offset of field: std_error_condition::_Myval"]
        [::std::mem::offset_of!(std_error_condition, _Myval) - 0usize];
    ["Offset of field: std_error_condition::_Mycat"]
        [::std::mem::offset_of!(std_error_condition, _Mycat) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_std_error_code_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_std_error_code_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_hash_open0_std_error_condition_close0"]
        [::std::mem::size_of::<std_hash>() - 1usize];
    ["Align of template specialization: std_hash_open0_std_error_condition_close0"]
        [::std::mem::align_of::<std_hash>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__System_error {
    pub _base: std_runtime_error,
    pub _Mycode: std_error_code,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__System_error"][::std::mem::size_of::<std__System_error>() - 40usize];
    ["Alignment of std__System_error"][::std::mem::align_of::<std__System_error>() - 8usize];
    ["Offset of field: std__System_error::_Mycode"]
        [::std::mem::offset_of!(std__System_error, _Mycode) - 24usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_system_error {
    pub _base: std__System_error,
}
pub type std_system_error__Mybase = std__System_error;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_system_error"][::std::mem::size_of::<std_system_error>() - 40usize];
    ["Alignment of std_system_error"][::std::mem::align_of::<std_system_error>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}?_Syserror_map@std@@YAPEBDH@Z"]
    pub fn std__Syserror_map(arg1: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}?_Winerror_map@std@@YAHH@Z"]
    pub fn std__Winerror_map(arg1: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug)]
pub struct std__System_error_message {
    pub _Str: *mut ::std::os::raw::c_char,
    pub _Length: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__System_error_message"]
        [::std::mem::size_of::<std__System_error_message>() - 16usize];
    ["Alignment of std__System_error_message"]
        [::std::mem::align_of::<std__System_error_message>() - 8usize];
    ["Offset of field: std__System_error_message::_Str"]
        [::std::mem::offset_of!(std__System_error_message, _Str) - 0usize];
    ["Offset of field: std__System_error_message::_Length"]
        [::std::mem::offset_of!(std__System_error_message, _Length) - 8usize];
};
#[repr(C)]
pub struct std__Generic_error_category {
    pub _base: std_error_category,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Generic_error_category"]
        [::std::mem::size_of::<std__Generic_error_category>() - 16usize];
    ["Alignment of std__Generic_error_category"]
        [::std::mem::align_of::<std__Generic_error_category>() - 8usize];
};
#[repr(C)]
pub struct std__Iostream_error_category2 {
    pub _base: std_error_category,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Iostream_error_category2"]
        [::std::mem::size_of::<std__Iostream_error_category2>() - 16usize];
    ["Alignment of std__Iostream_error_category2"]
        [::std::mem::align_of::<std__Iostream_error_category2>() - 8usize];
};
#[repr(C)]
pub struct std__System_error_category {
    pub _base: std_error_category,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__System_error_category"]
        [::std::mem::size_of::<std__System_error_category>() - 16usize];
    ["Alignment of std__System_error_category"]
        [::std::mem::align_of::<std__System_error_category>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_cast {
    pub _base: std_exception,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_cast"][::std::mem::size_of::<std_bad_cast>() - 24usize];
    ["Alignment of std_bad_cast"][::std::mem::align_of::<std_bad_cast>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_typeid {
    pub _base: std_exception,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_typeid"][::std::mem::size_of::<std_bad_typeid>() - 24usize];
    ["Alignment of std_bad_typeid"][::std::mem::align_of::<std_bad_typeid>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std___non_rtti_object {
    pub _base: std_bad_typeid,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std___non_rtti_object"][::std::mem::size_of::<std___non_rtti_object>() - 24usize];
    ["Alignment of std___non_rtti_object"]
        [::std::mem::align_of::<std___non_rtti_object>() - 8usize];
};
pub const std__Small_object_num_ptrs: ::std::os::raw::c_int = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_raw_storage_iterator<_OutIt> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_OutIt>>,
    pub _Next: _OutIt,
}
pub type std_raw_storage_iterator_iterator_category = std_output_iterator_tag;
pub type std_raw_storage_iterator_value_type = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_difference_type = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_pointer = ::std::os::raw::c_void;
pub type std_raw_storage_iterator_reference = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug)]
pub struct std_bad_weak_ptr {
    pub _base: std_exception,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_bad_weak_ptr"][::std::mem::size_of::<std_bad_weak_ptr>() - 24usize];
    ["Alignment of std_bad_weak_ptr"][::std::mem::align_of::<std_bad_weak_ptr>() - 8usize];
};
#[repr(C)]
pub struct std__Ref_count_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std__Ref_count_base {
    pub vtable_: *const std__Ref_count_base__bindgen_vtable,
    pub _Uses: std__Atomic_counter_t,
    pub _Weaks: std__Atomic_counter_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Ref_count_base"][::std::mem::size_of::<std__Ref_count_base>() - 16usize];
    ["Alignment of std__Ref_count_base"][::std::mem::align_of::<std__Ref_count_base>() - 8usize];
    ["Offset of field: std__Ref_count_base::_Uses"]
        [::std::mem::offset_of!(std__Ref_count_base, _Uses) - 8usize];
    ["Offset of field: std__Ref_count_base::_Weaks"]
        [::std::mem::offset_of!(std__Ref_count_base, _Weaks) - 12usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__Ref_count<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _base: std__Ref_count_base,
    pub _Ptr: *mut _Ty,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Ref_count_resource {
    pub _base: std__Ref_count_base,
    pub _Mypair: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Ref_count_resource_alloc {
    pub _base: std__Ref_count_base,
    pub _Mypair: u8,
}
pub type std__Ref_count_resource_alloc__Myalty = std__Rebind_alloc_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_enable_shared {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Exception_ptr_access {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Ptr_base {
    pub _Ptr: *mut std__Ptr_base_element_type,
    pub _Rep: *mut std__Ref_count_base,
}
pub type std__Ptr_base_element_type = std_remove_extent_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_scalar_delete {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_array_delete {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_call_function_object {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__SP_convertible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__SP_pointer_compatible {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Temporary_owner<_Ux> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ux>>,
    pub _Ptr: *mut _Ux,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Temporary_owner_del<_UxptrOrNullptr, _Dx> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_UxptrOrNullptr>>,
    pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Dx>>,
    pub _Ptr: _UxptrOrNullptr,
    pub _Dt: *mut _Dx,
    pub _Call_deleter: bool,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_shared_ptr {
    pub _base: std__Ptr_base,
}
pub type std_shared_ptr__Mybase = std__Ptr_base;
pub type std_shared_ptr_weak_type = std_weak_ptr;
#[repr(C)]
pub struct std__Ref_count_obj2 {
    pub _base: std__Ref_count_base,
    pub __bindgen_anon_1: std__Ref_count_obj2__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(1))]
pub struct std__Ref_count_obj2__bindgen_ty_1 {
    pub _Storage: __BindgenUnionField<std__Wrap<std_remove_cv_t>>,
    pub bindgen_union_field: [u8; 0usize],
}
#[repr(C)]
pub struct std__Ref_count_obj_alloc3<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _base_1: std__Ref_count_base,
    pub __bindgen_anon_1: std__Ref_count_obj_alloc3__bindgen_ty_1<_Ty>,
}
pub type std__Ref_count_obj_alloc3__Rebound = std__Rebind_alloc_t;
#[repr(C)]
#[repr(align(1))]
pub struct std__Ref_count_obj_alloc3__bindgen_ty_1<_Ty> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ty>>,
    pub _Storage: __BindgenUnionField<std__Wrap<_Ty>>,
    pub bindgen_union_field: [u8; 0usize],
}
#[repr(C)]
#[derive(Debug)]
pub struct std_weak_ptr {
    pub _base: std__Ptr_base,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_enable_shared_from_this {
    pub _Wptr: std_weak_ptr,
}
pub type std_enable_shared_from_this__Esft_type = std_enable_shared_from_this;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_default_delete {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Get_deleter_pointer_type {
    pub _address: u8,
}
pub type std__Get_deleter_pointer_type_type<_Ty> = *mut _Ty;
pub type std__Unique_ptr_enable_default_t = std_enable_if_t;
#[repr(C)]
#[derive(Debug)]
pub struct std_unique_ptr {
    pub _Mypair: u8,
}
pub type std_unique_ptr_pointer = std__Get_deleter_pointer_type;
pub type std_unique_ptr_element_type<_Ty> = _Ty;
pub type std_unique_ptr_deleter_type<_Dx> = _Dx;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_stream_unique_ptr {
    pub _base: std_false_type,
}
pub const std_pointer_safety_relaxed: std_pointer_safety = 0;
pub const std_pointer_safety_preferred: std_pointer_safety = 1;
pub const std_pointer_safety_strict: std_pointer_safety = 2;
pub type std_pointer_safety = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_owner_less {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_owner_less_open0_void_close0"]
        [::std::mem::size_of::<std_owner_less>() - 1usize];
    ["Align of template specialization: std_owner_less_open0_void_close0"]
        [::std::mem::align_of::<std_owner_less>() - 1usize];
};
extern "C" {
    #[link_name = "\u{1}_Lock_shared_ptr_spin_lock"]
    pub fn std__Lock_shared_ptr_spin_lock();
}
extern "C" {
    #[link_name = "\u{1}_Unlock_shared_ptr_spin_lock"]
    pub fn std__Unlock_shared_ptr_spin_lock();
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Shared_ptr_spin_lock {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Shared_ptr_spin_lock"]
        [::std::mem::size_of::<std__Shared_ptr_spin_lock>() - 1usize];
    ["Alignment of std__Shared_ptr_spin_lock"]
        [::std::mem::align_of::<std__Shared_ptr_spin_lock>() - 1usize];
};
#[repr(C)]
pub struct std__Facet_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std__Facet_base {
    pub vtable_: *const std__Facet_base__bindgen_vtable,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Facet_base"][::std::mem::size_of::<std__Facet_base>() - 8usize];
    ["Alignment of std__Facet_base"][::std::mem::align_of::<std__Facet_base>() - 8usize];
};
extern "C" {
    #[link_name = "\u{1}?_Facet_Register@std@@YAXPEAV_Facet_base@1@@Z"]
    pub fn std__Facet_Register(arg1: *mut std__Facet_base);
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Timevec {
    pub _Timeptr: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Timevec"][::std::mem::size_of::<std__Timevec>() - 8usize];
    ["Alignment of std__Timevec"][::std::mem::align_of::<std__Timevec>() - 8usize];
    ["Offset of field: std__Timevec::_Timeptr"]
        [::std::mem::offset_of!(std__Timevec, _Timeptr) - 0usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std__Yarn<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Myptr: *mut _Elem,
    pub _Nul: _Elem,
}
#[repr(C)]
#[derive(Debug)]
pub struct std__Locinfo {
    pub _Lock: std__Lockit,
    pub _Days: std__Yarn<::std::os::raw::c_char>,
    pub _Months: std__Yarn<::std::os::raw::c_char>,
    pub _W_Days: std__Yarn<u16>,
    pub _W_Months: std__Yarn<u16>,
    pub _Oldlocname: std__Yarn<::std::os::raw::c_char>,
    pub _Newlocname: std__Yarn<::std::os::raw::c_char>,
}
pub type std__Locinfo__Collvec = _Collvec;
pub type std__Locinfo__Ctypevec = _Ctypevec;
pub type std__Locinfo__Cvtvec = _Cvtvec;
pub type std__Locinfo__Timevec = std__Timevec;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Locinfo"][::std::mem::size_of::<std__Locinfo>() - 104usize];
    ["Alignment of std__Locinfo"][::std::mem::align_of::<std__Locinfo>() - 8usize];
    ["Offset of field: std__Locinfo::_Lock"][::std::mem::offset_of!(std__Locinfo, _Lock) - 0usize];
    ["Offset of field: std__Locinfo::_Days"][::std::mem::offset_of!(std__Locinfo, _Days) - 8usize];
    ["Offset of field: std__Locinfo::_Months"]
        [::std::mem::offset_of!(std__Locinfo, _Months) - 24usize];
    ["Offset of field: std__Locinfo::_W_Days"]
        [::std::mem::offset_of!(std__Locinfo, _W_Days) - 40usize];
    ["Offset of field: std__Locinfo::_W_Months"]
        [::std::mem::offset_of!(std__Locinfo, _W_Months) - 56usize];
    ["Offset of field: std__Locinfo::_Oldlocname"]
        [::std::mem::offset_of!(std__Locinfo, _Oldlocname) - 72usize];
    ["Offset of field: std__Locinfo::_Newlocname"]
        [::std::mem::offset_of!(std__Locinfo, _Newlocname) - 88usize];
};
extern "C" {
    #[link_name = "\u{1}?_Locinfo_ctor@_Locinfo@std@@SAXPEAV12@PEBD@Z"]
    pub fn std__Locinfo__Locinfo_ctor(arg1: *mut std__Locinfo, arg2: *const ::std::os::raw::c_char);
}
extern "C" {
    #[link_name = "\u{1}?_Locinfo_ctor@_Locinfo@std@@SAXPEAV12@HPEBD@Z"]
    pub fn std__Locinfo__Locinfo_ctor1(
        arg1: *mut std__Locinfo,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    );
}
extern "C" {
    #[link_name = "\u{1}?_Locinfo_dtor@_Locinfo@std@@SAXPEAV12@@Z"]
    pub fn std__Locinfo__Locinfo_dtor(arg1: *mut std__Locinfo);
}
extern "C" {
    #[link_name = "\u{1}?_Locinfo_Addcats@_Locinfo@std@@SAAEAV12@PEAV12@HPEBD@Z"]
    pub fn std__Locinfo__Locinfo_Addcats(
        arg1: *mut std__Locinfo,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut std__Locinfo;
}
impl std__Locinfo {
    #[inline]
    pub unsafe fn _Locinfo_ctor(arg1: *mut std__Locinfo, arg2: *const ::std::os::raw::c_char) {
        std__Locinfo__Locinfo_ctor(arg1, arg2)
    }
    #[inline]
    pub unsafe fn _Locinfo_ctor1(
        arg1: *mut std__Locinfo,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) {
        std__Locinfo__Locinfo_ctor1(arg1, arg2, arg3)
    }
    #[inline]
    pub unsafe fn _Locinfo_dtor(arg1: *mut std__Locinfo) {
        std__Locinfo__Locinfo_dtor(arg1)
    }
    #[inline]
    pub unsafe fn _Locinfo_Addcats(
        arg1: *mut std__Locinfo,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut std__Locinfo {
        std__Locinfo__Locinfo_Addcats(arg1, arg2, arg3)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Locbase {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_collate {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Crt_new_delete {
    pub _address: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Crt_new_delete"][::std::mem::size_of::<std__Crt_new_delete>() - 1usize];
    ["Alignment of std__Crt_new_delete"][::std::mem::align_of::<std__Crt_new_delete>() - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_locale {
    pub __bindgen_padding_0: u64,
    pub _Ptr: *mut std_locale__Locimp,
}
pub type std_locale_category = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_locale_id {
    pub _Id: ::std::os::raw::c_ulonglong,
}
extern "C" {
    #[link_name = "\u{1}?_Id_cnt@id@locale@std@@0HA"]
    pub static mut std_locale_id__Id_cnt: ::std::os::raw::c_int;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_locale_id"][::std::mem::size_of::<std_locale_id>() - 8usize];
    ["Alignment of std_locale_id"][::std::mem::align_of::<std_locale_id>() - 8usize];
    ["Offset of field: std_locale_id::_Id"][::std::mem::offset_of!(std_locale_id, _Id) - 0usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_locale_facet {
    pub _base: std__Facet_base,
    pub _Myrefs: std__Atomic_counter_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_locale_facet"][::std::mem::size_of::<std_locale_facet>() - 16usize];
    ["Alignment of std_locale_facet"][::std::mem::align_of::<std_locale_facet>() - 8usize];
    ["Offset of field: std_locale_facet::_Myrefs"]
        [::std::mem::offset_of!(std_locale_facet, _Myrefs) - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_locale__Facet_guard {
    pub _Target: *mut std_locale_facet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_locale__Facet_guard"][::std::mem::size_of::<std_locale__Facet_guard>() - 8usize];
    ["Alignment of std_locale__Facet_guard"]
        [::std::mem::align_of::<std_locale__Facet_guard>() - 8usize];
    ["Offset of field: std_locale__Facet_guard::_Target"]
        [::std::mem::offset_of!(std_locale__Facet_guard, _Target) - 0usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_locale__Locimp {
    pub _base: std_locale_facet,
    pub _Facetvec: *mut *mut std_locale_facet,
    pub _Facetcount: ::std::os::raw::c_ulonglong,
    pub _Catmask: std_locale_category,
    pub _Xparent: bool,
    pub _Name: std__Yarn<::std::os::raw::c_char>,
}
extern "C" {
    #[link_name = "\u{1}?_Clocptr@_Locimp@locale@std@@0PEAV123@EA"]
    pub static mut std_locale__Locimp__Clocptr: *mut std_locale__Locimp;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_locale__Locimp"][::std::mem::size_of::<std_locale__Locimp>() - 56usize];
    ["Alignment of std_locale__Locimp"][::std::mem::align_of::<std_locale__Locimp>() - 8usize];
    ["Offset of field: std_locale__Locimp::_Facetvec"]
        [::std::mem::offset_of!(std_locale__Locimp, _Facetvec) - 16usize];
    ["Offset of field: std_locale__Locimp::_Facetcount"]
        [::std::mem::offset_of!(std_locale__Locimp, _Facetcount) - 24usize];
    ["Offset of field: std_locale__Locimp::_Catmask"]
        [::std::mem::offset_of!(std_locale__Locimp, _Catmask) - 32usize];
    ["Offset of field: std_locale__Locimp::_Xparent"]
        [::std::mem::offset_of!(std_locale__Locimp, _Xparent) - 36usize];
    ["Offset of field: std_locale__Locimp::_Name"]
        [::std::mem::offset_of!(std_locale__Locimp, _Name) - 40usize];
};
pub const std_locale_collate: std_locale_category = 1;
pub const std_locale_ctype: std_locale_category = 2;
pub const std_locale_monetary: std_locale_category = 4;
pub const std_locale_numeric: std_locale_category = 8;
pub const std_locale_time: std_locale_category = 16;
pub const std_locale_messages: std_locale_category = 32;
pub const std_locale_all: std_locale_category = 63;
pub const std_locale_none: std_locale_category = 0;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_locale"][::std::mem::size_of::<std_locale>() - 16usize];
    ["Alignment of std_locale"][::std::mem::align_of::<std_locale>() - 8usize];
    ["Offset of field: std_locale::_Ptr"][::std::mem::offset_of!(std_locale, _Ptr) - 8usize];
};
extern "C" {
    #[link_name = "\u{1}?classic@locale@std@@SAAEBV12@XZ"]
    pub fn std_locale_classic() -> *const std_locale;
}
extern "C" {
    #[link_name = "\u{1}?global@locale@std@@SA?AV12@AEBV12@@Z"]
    pub fn std_locale_global(arg1: *const std_locale) -> std_locale;
}
extern "C" {
    #[link_name = "\u{1}?empty@locale@std@@SA?AV12@XZ"]
    pub fn std_locale_empty() -> std_locale;
}
impl std_locale {
    #[inline]
    pub unsafe fn classic() -> *const std_locale {
        std_locale_classic()
    }
    #[inline]
    pub unsafe fn global(arg1: *const std_locale) -> std_locale {
        std_locale_global(arg1)
    }
    #[inline]
    pub unsafe fn empty() -> std_locale {
        std_locale_empty()
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Facetptr {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}_Psave"]
    pub static mut std__Psave: *const std_locale_facet;
}
#[repr(C)]
#[derive(Debug)]
pub struct std_codecvt_base {
    pub _base: std_locale_facet,
}
pub const std_codecvt_base_ok: std_codecvt_base__bindgen_ty_1 = 0;
pub const std_codecvt_base_partial: std_codecvt_base__bindgen_ty_1 = 1;
pub const std_codecvt_base_error: std_codecvt_base__bindgen_ty_1 = 2;
pub const std_codecvt_base_noconv: std_codecvt_base__bindgen_ty_1 = 3;
pub type std_codecvt_base__bindgen_ty_1 = ::std::os::raw::c_int;
pub type std_codecvt_base_result = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_codecvt_base"][::std::mem::size_of::<std_codecvt_base>() - 16usize];
    ["Alignment of std_codecvt_base"][::std::mem::align_of::<std_codecvt_base>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_codecvt {
    pub _base: std_codecvt_base,
}
pub type std_codecvt_intern_type<_Elem> = _Elem;
pub type std_codecvt_extern_type<_Byte> = _Byte;
pub type std_codecvt_state_type<_Statype> = _Statype;
extern "C" {
    #[link_name = "\u{1}id"]
    pub static mut std_id: std_locale_id;
}
pub const std__Codecvt_mode__Consume_header: std__Codecvt_mode = 4;
pub const std__Codecvt_mode__Generate_header: std__Codecvt_mode = 2;
pub type std__Codecvt_mode = ::std::os::raw::c_int;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_codecvt_open0_char16_t_char__Mbstatet_close0"]
        [::std::mem::size_of::<std_codecvt>() - 24usize];
    ["Align of template specialization: std_codecvt_open0_char16_t_char__Mbstatet_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_codecvt_open0_char32_t_char__Mbstatet_close0"]
        [::std::mem::size_of::<std_codecvt>() - 24usize];
    ["Align of template specialization: std_codecvt_open0_char32_t_char__Mbstatet_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_codecvt_open0_wchar_t_char__Mbstatet_close0"]
        [::std::mem::size_of::<std_codecvt>() - 64usize];
    ["Align of template specialization: std_codecvt_open0_wchar_t_char__Mbstatet_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_codecvt_open0_unsigned_short_char__Mbstatet_close0"]
        [::std::mem::size_of::<std_codecvt>() - 64usize];
    ["Align of template specialization: std_codecvt_open0_unsigned_short_char__Mbstatet_close0"]
        [::std::mem::align_of::<std_codecvt>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_codecvt_byname {
    pub _base: std_codecvt,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_ctype_base {
    pub _base: std_locale_facet,
}
pub const std_ctype_base_alnum: std_ctype_base__bindgen_ty_1 = 263;
pub const std_ctype_base_alpha: std_ctype_base__bindgen_ty_1 = 259;
pub const std_ctype_base_cntrl: std_ctype_base__bindgen_ty_1 = 32;
pub const std_ctype_base_digit: std_ctype_base__bindgen_ty_1 = 4;
pub const std_ctype_base_graph: std_ctype_base__bindgen_ty_1 = 279;
pub const std_ctype_base_lower: std_ctype_base__bindgen_ty_1 = 2;
pub const std_ctype_base_print: std_ctype_base__bindgen_ty_1 = 471;
pub const std_ctype_base_punct: std_ctype_base__bindgen_ty_1 = 16;
pub const std_ctype_base_space: std_ctype_base__bindgen_ty_1 = 72;
pub const std_ctype_base_upper: std_ctype_base__bindgen_ty_1 = 1;
pub const std_ctype_base_xdigit: std_ctype_base__bindgen_ty_1 = 128;
pub const std_ctype_base_blank: std_ctype_base__bindgen_ty_1 = 72;
pub type std_ctype_base__bindgen_ty_1 = ::std::os::raw::c_int;
pub type std_ctype_base_mask = ::std::os::raw::c_short;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_ctype_base"][::std::mem::size_of::<std_ctype_base>() - 16usize];
    ["Alignment of std_ctype_base"][::std::mem::align_of::<std_ctype_base>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_ctype {
    pub _base: std_ctype_base,
    pub _Ctype: std__Locinfo__Ctypevec,
    pub _Cvt: std__Locinfo__Cvtvec,
}
pub type std_ctype_char_type<_Elem> = _Elem;
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_ctype_open0_char_close0"]
        [::std::mem::size_of::<std_ctype>() - 48usize];
    ["Align of template specialization: std_ctype_open0_char_close0"]
        [::std::mem::align_of::<std_ctype>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_ctype_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_ctype>() - 96usize];
    ["Align of template specialization: std_ctype_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_ctype>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_ctype_open0_unsigned_short_close0"]
        [::std::mem::size_of::<std_ctype>() - 96usize];
    ["Align of template specialization: std_ctype_open0_unsigned_short_close0"]
        [::std::mem::align_of::<std_ctype>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_ctype_byname {
    pub _base: std_ctype,
}
pub const std__Case_sensitive__Nope: std__Case_sensitive = false;
pub const std__Case_sensitive__Yes: std__Case_sensitive = true;
pub type std__Case_sensitive = bool;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Iosb {
    pub _address: u8,
}
pub const std__Iosb__Fmtflags__Fmtmask: std__Iosb__Fmtflags = 0;
pub const std__Iosb__Fmtflags__Fmtzero: std__Iosb__Fmtflags = 0;
pub type std__Iosb__Fmtflags = ::std::os::raw::c_int;
pub const std__Iosb__Iostate__Statmask: std__Iosb__Iostate = 0;
pub type std__Iosb__Iostate = ::std::os::raw::c_int;
pub const std__Iosb__Dummy_enum__Dummy_enum_val: std__Iosb__Dummy_enum = 0;
pub type std__Iosb__Dummy_enum = ::std::os::raw::c_int;
pub const std__Iosb__Openmode__Openmask: std__Iosb__Openmode = 0;
pub type std__Iosb__Openmode = ::std::os::raw::c_int;
pub const std__Iosb__Seekdir__Seekbeg: std__Iosb__Seekdir = 0;
pub const std__Iosb__Seekdir__Seekcur: std__Iosb__Seekdir = 0;
pub const std__Iosb__Seekdir__Seekend: std__Iosb__Seekdir = 0;
pub type std__Iosb__Seekdir = ::std::os::raw::c_int;
pub const std__Iosb__Openprot: std__Iosb__bindgen_ty_1 = 0;
pub type std__Iosb__bindgen_ty_1 = ::std::os::raw::c_int;
#[repr(C)]
pub struct std_ios_base__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base {
    pub vtable_: *const std_ios_base__bindgen_vtable,
    pub _Stdstr: ::std::os::raw::c_ulonglong,
    pub _Mystate: std_ios_base_iostate,
    pub _Except: std_ios_base_iostate,
    pub _Fmtfl: std_ios_base_fmtflags,
    pub _Prec: std_streamsize,
    pub _Wide: std_streamsize,
    pub _Arr: *mut std_ios_base__Iosarray,
    pub _Calls: *mut std_ios_base__Fnarray,
    pub _Ploc: *mut std_locale,
}
pub type std_ios_base_fmtflags = ::std::os::raw::c_int;
pub type std_ios_base_iostate = ::std::os::raw::c_int;
pub type std_ios_base_openmode = ::std::os::raw::c_int;
pub type std_ios_base_seekdir = ::std::os::raw::c_int;
pub const std_ios_base_event_erase_event: std_ios_base_event = 0;
pub const std_ios_base_event_imbue_event: std_ios_base_event = 1;
pub const std_ios_base_event_copyfmt_event: std_ios_base_event = 2;
pub type std_ios_base_event = ::std::os::raw::c_int;
pub type std_ios_base_event_callback = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: std_ios_base_event,
        arg2: *mut std_ios_base,
        arg3: ::std::os::raw::c_int,
    ),
>;
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_failure {
    pub _base: std_system_error,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_ios_base_failure"][::std::mem::size_of::<std_ios_base_failure>() - 40usize];
    ["Alignment of std_ios_base_failure"][::std::mem::align_of::<std_ios_base_failure>() - 8usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_ios_base_Init {
    pub _address: u8,
}
extern "C" {
    #[link_name = "\u{1}?_Init_cnt@Init@ios_base@std@@0HA"]
    pub static mut std_ios_base_Init__Init_cnt: ::std::os::raw::c_int;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_ios_base_Init"][::std::mem::size_of::<std_ios_base_Init>() - 1usize];
    ["Alignment of std_ios_base_Init"][::std::mem::align_of::<std_ios_base_Init>() - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base__Iosarray {
    pub _Next: *mut std_ios_base__Iosarray,
    pub _Index: ::std::os::raw::c_int,
    pub _Lo: ::std::os::raw::c_long,
    pub _Vp: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_ios_base__Iosarray"][::std::mem::size_of::<std_ios_base__Iosarray>() - 24usize];
    ["Alignment of std_ios_base__Iosarray"]
        [::std::mem::align_of::<std_ios_base__Iosarray>() - 8usize];
    ["Offset of field: std_ios_base__Iosarray::_Next"]
        [::std::mem::offset_of!(std_ios_base__Iosarray, _Next) - 0usize];
    ["Offset of field: std_ios_base__Iosarray::_Index"]
        [::std::mem::offset_of!(std_ios_base__Iosarray, _Index) - 8usize];
    ["Offset of field: std_ios_base__Iosarray::_Lo"]
        [::std::mem::offset_of!(std_ios_base__Iosarray, _Lo) - 12usize];
    ["Offset of field: std_ios_base__Iosarray::_Vp"]
        [::std::mem::offset_of!(std_ios_base__Iosarray, _Vp) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std_ios_base__Fnarray {
    pub _Next: *mut std_ios_base__Fnarray,
    pub _Index: ::std::os::raw::c_int,
    pub _Pfn: std_ios_base_event_callback,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_ios_base__Fnarray"][::std::mem::size_of::<std_ios_base__Fnarray>() - 24usize];
    ["Alignment of std_ios_base__Fnarray"]
        [::std::mem::align_of::<std_ios_base__Fnarray>() - 8usize];
    ["Offset of field: std_ios_base__Fnarray::_Next"]
        [::std::mem::offset_of!(std_ios_base__Fnarray, _Next) - 0usize];
    ["Offset of field: std_ios_base__Fnarray::_Index"]
        [::std::mem::offset_of!(std_ios_base__Fnarray, _Index) - 8usize];
    ["Offset of field: std_ios_base__Fnarray::_Pfn"]
        [::std::mem::offset_of!(std_ios_base__Fnarray, _Pfn) - 16usize];
};
extern "C" {
    #[link_name = "\u{1}?_Index@ios_base@std@@0HA"]
    pub static mut std_ios_base__Index: ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}?_Sync@ios_base@std@@0_NA"]
    pub static mut std_ios_base__Sync: bool;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std_ios_base"][::std::mem::size_of::<std_ios_base>() - 72usize];
    ["Alignment of std_ios_base"][::std::mem::align_of::<std_ios_base>() - 8usize];
    ["Offset of field: std_ios_base::_Stdstr"]
        [::std::mem::offset_of!(std_ios_base, _Stdstr) - 8usize];
    ["Offset of field: std_ios_base::_Mystate"]
        [::std::mem::offset_of!(std_ios_base, _Mystate) - 16usize];
    ["Offset of field: std_ios_base::_Except"]
        [::std::mem::offset_of!(std_ios_base, _Except) - 20usize];
    ["Offset of field: std_ios_base::_Fmtfl"]
        [::std::mem::offset_of!(std_ios_base, _Fmtfl) - 24usize];
    ["Offset of field: std_ios_base::_Prec"][::std::mem::offset_of!(std_ios_base, _Prec) - 32usize];
    ["Offset of field: std_ios_base::_Wide"][::std::mem::offset_of!(std_ios_base, _Wide) - 40usize];
    ["Offset of field: std_ios_base::_Arr"][::std::mem::offset_of!(std_ios_base, _Arr) - 48usize];
    ["Offset of field: std_ios_base::_Calls"]
        [::std::mem::offset_of!(std_ios_base, _Calls) - 56usize];
    ["Offset of field: std_ios_base::_Ploc"][::std::mem::offset_of!(std_ios_base, _Ploc) - 64usize];
};
extern "C" {
    #[link_name = "\u{1}?_Addstd@ios_base@std@@SAXPEAV12@@Z"]
    pub fn std_ios_base__Addstd(arg1: *mut std_ios_base);
}
impl std_ios_base {
    #[inline]
    pub unsafe fn _Addstd(arg1: *mut std_ios_base) {
        std_ios_base__Addstd(arg1)
    }
}
#[repr(C)]
pub struct std_basic_streambuf__bindgen_vtable(::std::os::raw::c_void);
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_streambuf<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub vtable_: *const std_basic_streambuf__bindgen_vtable,
    pub _Gfirst: *mut _Elem,
    pub _Pfirst: *mut _Elem,
    pub _IGfirst: *mut *mut _Elem,
    pub _IPfirst: *mut *mut _Elem,
    pub _Gnext: *mut _Elem,
    pub _Pnext: *mut _Elem,
    pub _IGnext: *mut *mut _Elem,
    pub _IPnext: *mut *mut _Elem,
    pub _Gcount: ::std::os::raw::c_int,
    pub _Pcount: ::std::os::raw::c_int,
    pub _IGcount: *mut ::std::os::raw::c_int,
    pub _IPcount: *mut ::std::os::raw::c_int,
    pub _Plocale: *mut std_locale,
}
pub type std_basic_streambuf_char_type<_Elem> = _Elem;
pub type std_basic_streambuf_traits_type<_Traits> = _Traits;
pub type std_basic_streambuf_int_type = [u8; 0usize];
pub type std_basic_streambuf_pos_type = [u8; 0usize];
pub type std_basic_streambuf_off_type = [u8; 0usize];
pub const std__Max_int_dig: ::std::os::raw::c_ulonglong = 32;
#[repr(C)]
#[derive(Debug)]
pub struct std_numpunct<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_locale_facet,
    pub _Grouping: *const ::std::os::raw::c_char,
    pub _Dp: _Elem,
    pub _Kseparator: _Elem,
    pub _Falsename: *const _Elem,
    pub _Truename: *const _Elem,
}
pub type std_numpunct_string_type = std_basic_string;
pub type std_numpunct_char_type<_Elem> = _Elem;
#[repr(C)]
#[derive(Debug)]
pub struct std_numpunct_byname<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_numpunct<_Elem>,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Num_get_parse_result {
    pub _Base: ::std::os::raw::c_schar,
    pub _Bad_grouping: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of std__Num_get_parse_result"]
        [::std::mem::size_of::<std__Num_get_parse_result>() - 2usize];
    ["Alignment of std__Num_get_parse_result"]
        [::std::mem::align_of::<std__Num_get_parse_result>() - 1usize];
    ["Offset of field: std__Num_get_parse_result::_Base"]
        [::std::mem::offset_of!(std__Num_get_parse_result, _Base) - 0usize];
    ["Offset of field: std__Num_get_parse_result::_Bad_grouping"]
        [::std::mem::offset_of!(std__Num_get_parse_result, _Bad_grouping) - 1usize];
};
#[repr(C)]
#[derive(Debug)]
pub struct std_num_get {
    pub _base: std_locale_facet,
}
pub type std_num_get_char_type<_Elem> = _Elem;
pub type std_num_get_iter_type<_InIt> = _InIt;
#[repr(C)]
#[derive(Debug)]
pub struct std_num_put {
    pub _base: std_locale_facet,
}
pub type std_num_put_char_type<_Elem> = _Elem;
pub type std_num_put_iter_type<_OutIt> = _OutIt;
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ios<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_ios_base,
    pub _Mystrbuf: *mut std_basic_ios__Mysb<_Elem>,
    pub _Tiestr: *mut std_basic_ios__Myos<_Elem>,
    pub _Fillch: _Elem,
}
pub type std_basic_ios__Myos<_Elem> = std_basic_ostream<_Elem>;
pub type std_basic_ios__Mysb<_Elem> = std_basic_streambuf<_Elem>;
pub type std_basic_ios__Ctype = std_ctype;
pub type std_basic_ios_char_type<_Elem> = _Elem;
pub type std_basic_ios_traits_type<_Traits> = _Traits;
pub type std_basic_ios_int_type = [u8; 0usize];
pub type std_basic_ios_pos_type = [u8; 0usize];
pub type std_basic_ios_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
}
pub type std_basic_ostream__Myios<_Elem> = std_basic_ios<_Elem>;
pub type std_basic_ostream__Mysb<_Elem> = std_basic_streambuf<_Elem>;
pub type std_basic_ostream__Iter<_Elem> = std_ostreambuf_iterator<_Elem>;
pub type std_basic_ostream__Nput = std_num_put;
pub type std_basic_ostream_int_type = [u8; 0usize];
pub type std_basic_ostream_pos_type = [u8; 0usize];
pub type std_basic_ostream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream__Sentry_base<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Myostr: *mut std_basic_ostream<_Elem>,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_ostream_sentry<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_basic_ostream__Sentry_base<_Elem>,
    pub _Ok: bool,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_stream_out {
    pub _base: std_false_type,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_istream<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Chcount: std_streamsize,
}
pub type std_basic_istream__Myios<_Elem> = std_basic_ios<_Elem>;
pub type std_basic_istream__Mysb<_Elem> = std_basic_streambuf<_Elem>;
pub type std_basic_istream__Iter<_Elem> = std_istreambuf_iterator<_Elem>;
pub type std_basic_istream__Ctype = std_ctype;
pub type std_basic_istream__Nget = std_num_get;
pub type std_basic_istream_int_type = [u8; 0usize];
pub type std_basic_istream_pos_type = [u8; 0usize];
pub type std_basic_istream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_istream__Sentry_base<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _Myistr: *mut std_basic_istream<_Elem>,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_istream_sentry<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_basic_istream__Sentry_base<_Elem>,
    pub _Ok: bool,
}
#[repr(C)]
#[derive(Debug)]
pub struct std_basic_iostream<_Elem> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Elem>>,
    pub _base: std_basic_istream<_Elem>,
    pub _base_1: std_basic_ostream<_Elem>,
}
pub type std_basic_iostream__Myis<_Elem> = std_basic_istream<_Elem>;
pub type std_basic_iostream__Myos<_Elem> = std_basic_ostream<_Elem>;
pub type std_basic_iostream__Myios<_Elem> = std_basic_ios<_Elem>;
pub type std_basic_iostream_char_type<_Elem> = _Elem;
pub type std_basic_iostream_traits_type<_Traits> = _Traits;
pub type std_basic_iostream_int_type = [u8; 0usize];
pub type std_basic_iostream_pos_type = [u8; 0usize];
pub type std_basic_iostream_off_type = [u8; 0usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct std__Can_stream_in {
    pub _base: std_false_type,
}
extern "C" {
    #[link_name = "\u{1}?cin@std@@3V?$basic_istream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_cin: std_istream;
}
extern "C" {
    #[link_name = "\u{1}?cout@std@@3V?$basic_ostream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_cout: std_ostream;
}
extern "C" {
    #[link_name = "\u{1}?cerr@std@@3V?$basic_ostream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_cerr: std_ostream;
}
extern "C" {
    #[link_name = "\u{1}?clog@std@@3V?$basic_ostream@DU?$char_traits@D@std@@@1@A"]
    pub static mut std_clog: std_ostream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_cin@std@@3PEAV?$basic_istream@DU?$char_traits@D@std@@@1@EA"]
    pub static mut std__Ptr_cin: *mut std_istream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_cout@std@@3PEAV?$basic_ostream@DU?$char_traits@D@std@@@1@EA"]
    pub static mut std__Ptr_cout: *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_cerr@std@@3PEAV?$basic_ostream@DU?$char_traits@D@std@@@1@EA"]
    pub static mut std__Ptr_cerr: *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_clog@std@@3PEAV?$basic_ostream@DU?$char_traits@D@std@@@1@EA"]
    pub static mut std__Ptr_clog: *mut std_ostream;
}
extern "C" {
    #[link_name = "\u{1}?wcin@std@@3V?$basic_istream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wcin: std_wistream;
}
extern "C" {
    #[link_name = "\u{1}?wcout@std@@3V?$basic_ostream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wcout: std_wostream;
}
extern "C" {
    #[link_name = "\u{1}?wcerr@std@@3V?$basic_ostream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wcerr: std_wostream;
}
extern "C" {
    #[link_name = "\u{1}?wclog@std@@3V?$basic_ostream@_WU?$char_traits@_W@std@@@1@A"]
    pub static mut std_wclog: std_wostream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_wcin@std@@3PEAV?$basic_istream@_WU?$char_traits@_W@std@@@1@EA"]
    pub static mut std__Ptr_wcin: *mut std_wistream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_wcout@std@@3PEAV?$basic_ostream@_WU?$char_traits@_W@std@@@1@EA"]
    pub static mut std__Ptr_wcout: *mut std_wostream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_wcerr@std@@3PEAV?$basic_ostream@_WU?$char_traits@_W@std@@@1@EA"]
    pub static mut std__Ptr_wcerr: *mut std_wostream;
}
extern "C" {
    #[link_name = "\u{1}?_Ptr_wclog@std@@3PEAV?$basic_ostream@_WU?$char_traits@_W@std@@@1@EA"]
    pub static mut std__Ptr_wclog: *mut std_wostream;
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char16_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_char32_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::size_of::<std_char_traits>() - 1usize];
    ["Align of template specialization: std_char_traits_open0_wchar_t_close0"]
        [::std::mem::align_of::<std_char_traits>() - 1usize];
};
pub type _HFILE = *mut ::std::os::raw::c_void;
pub type _CRT_REPORT_HOOK = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type _CRT_REPORT_HOOKW = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut u16,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type _CRT_ALLOC_HOOK = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *mut ::std::os::raw::c_void,
        arg3: usize,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_long,
        arg6: *const ::std::os::raw::c_uchar,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type _CRT_DUMP_CLIENT =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void, arg2: usize)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CrtMemBlockHeader {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CrtMemState {
    pub pBlockHeader: *mut _CrtMemBlockHeader,
    pub lCounts: [usize; 5usize],
    pub lSizes: [usize; 5usize],
    pub lHighWaterCount: usize,
    pub lTotalCount: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CrtMemState"][::std::mem::size_of::<_CrtMemState>() - 104usize];
    ["Alignment of _CrtMemState"][::std::mem::align_of::<_CrtMemState>() - 8usize];
    ["Offset of field: _CrtMemState::pBlockHeader"]
        [::std::mem::offset_of!(_CrtMemState, pBlockHeader) - 0usize];
    ["Offset of field: _CrtMemState::lCounts"]
        [::std::mem::offset_of!(_CrtMemState, lCounts) - 8usize];
    ["Offset of field: _CrtMemState::lSizes"]
        [::std::mem::offset_of!(_CrtMemState, lSizes) - 48usize];
    ["Offset of field: _CrtMemState::lHighWaterCount"]
        [::std::mem::offset_of!(_CrtMemState, lHighWaterCount) - 88usize];
    ["Offset of field: _CrtMemState::lTotalCount"]
        [::std::mem::offset_of!(_CrtMemState, lTotalCount) - 96usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
    pub _Placeholder: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _iobuf"][::std::mem::size_of::<_iobuf>() - 8usize];
    ["Alignment of _iobuf"][::std::mem::align_of::<_iobuf>() - 8usize];
    ["Offset of field: _iobuf::_Placeholder"]
        [::std::mem::offset_of!(_iobuf, _Placeholder) - 0usize];
};
pub type FILE = _iobuf;
extern "C" {
    pub fn __acrt_iob_func(_Ix: ::std::os::raw::c_uint) -> *mut FILE;
}
extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(_Character: u16, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwchar(_Character: u16) -> wint_t;
}
extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fgetws(
        _Buffer: *mut u16,
        _BufferCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut u16;
}
extern "C" {
    pub fn fputws(_Buffer: *const u16, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getws_s(_Buffer: *mut u16, _BufferCount: usize) -> *mut u16;
}
extern "C" {
    pub fn putwc(_Character: u16, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(_Character: u16) -> wint_t;
}
extern "C" {
    pub fn _putws(_Buffer: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _wfdopen(_FileHandle: ::std::os::raw::c_int, _Mode: *const u16) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen(_FileName: *const u16, _Mode: *const u16) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen_s(_Stream: *mut *mut FILE, _FileName: *const u16, _Mode: *const u16) -> errno_t;
}
extern "C" {
    pub fn _wfreopen(_FileName: *const u16, _Mode: *const u16, _OldStream: *mut FILE) -> *mut FILE;
}
extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const u16,
        _Mode: *const u16,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfsopen(
        _FileName: *const u16,
        _Mode: *const u16,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wperror(_ErrorMessage: *const u16);
}
extern "C" {
    pub fn _wpopen(_Command: *const u16, _Mode: *const u16) -> *mut FILE;
}
extern "C" {
    pub fn _wremove(_FileName: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtempnam(_Directory: *const u16, _FilePrefix: *const u16) -> *mut u16;
}
extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut u16, _BufferCount: usize) -> errno_t;
}
extern "C" {
    pub fn _wtmpnam(_Buffer: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwc_nolock(_Character: u16, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _putwc_nolock(_Character: u16, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const u16,
        _BufferCount: usize,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = ::std::os::raw::c_longlong;
extern "C" {
    pub fn _get_stream_buffer_pointers(
        _Stream: *mut FILE,
        _Base: *mut *mut *mut ::std::os::raw::c_char,
        _Pointer: *mut *mut *mut ::std::os::raw::c_char,
        _Count: *mut *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn fread_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn gets_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _Size: rsize_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
extern "C" {
    pub fn tmpnam_s(_Buffer: *mut ::std::os::raw::c_char, _Size: rsize_t) -> errno_t;
}
extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn feof(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fgetchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        _Buffer: *mut ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _flushall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fputc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fputchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputs(
        _Buffer: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn freopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fsopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fseek(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fseeki64(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _ftelli64(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn fwrite(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn getc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getmaxstdio() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(_ErrorMessage: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn _pclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _popen(
        _Command: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn putc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(_Buffer: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putw(_Word: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn remove(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        _OldFileName: *const ::std::os::raw::c_char,
        _NewFileName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
extern "C" {
    pub fn _rmtmp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn _setmaxstdio(_Maximum: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut ::std::os::raw::c_char,
        _Mode: ::std::os::raw::c_int,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _tempnam(
        _DirectoryName: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(_Buffer: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ungetc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _lock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _unlock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _fclose_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fflush_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fgetc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fputc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fread_nolock(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fread_nolock_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fseek_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fseeki64_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ftell_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _ftelli64_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _fwrite_nolock(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _getc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _putc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ungetc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __p__commode() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_printf_count_output(_Value: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _get_printf_count_output() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vfscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _Arglist: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __stdio_common_vsscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tempnam(
        _Directory: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcloseall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Format: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fgetchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn flushall() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputchar(_Ch: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(_Ch: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rmtmp() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
extern "C" {
    pub fn memchr(
        _Buf: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memcpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        _Dst: *mut ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strchr(
        _Str: *const ::std::os::raw::c_char,
        _Val: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        _Str: *const ::std::os::raw::c_char,
        _Ch: ::std::os::raw::c_int,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        _Str: *const ::std::os::raw::c_char,
        _SubStr: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn wcschr(_Str: *const u16, _Ch: u16) -> *const u16;
}
extern "C" {
    pub fn wcsrchr(_Str: *const u16, _Ch: u16) -> *const u16;
}
extern "C" {
    pub fn wcsstr(_Str: *const u16, _SubStr: *const u16) -> *const u16;
}
extern "C" {
    pub fn _memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _memicmp_l(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscat_s(_Destination: *mut u16, _SizeInWords: rsize_t, _Source: *const u16) -> errno_t;
}
extern "C" {
    pub fn wcscpy_s(_Destination: *mut u16, _SizeInWords: rsize_t, _Source: *const u16) -> errno_t;
}
extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut u16,
        _SizeInWords: rsize_t,
        _Source: *const u16,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut u16,
        _SizeInWords: rsize_t,
        _Source: *const u16,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstok_s(_String: *mut u16, _Delimiter: *const u16, _Context: *mut *mut u16)
        -> *mut u16;
}
extern "C" {
    pub fn _wcsdup(_String: *const u16) -> *mut u16;
}
extern "C" {
    pub fn wcscat(_Destination: *mut u16, _Source: *const u16) -> *mut u16;
}
extern "C" {
    pub fn wcscmp(_String1: *const u16, _String2: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcscpy(_Destination: *mut u16, _Source: *const u16) -> *mut u16;
}
extern "C" {
    pub fn wcscspn(_String: *const u16, _Control: *const u16) -> usize;
}
extern "C" {
    pub fn wcslen(_String: *const u16) -> usize;
}
extern "C" {
    pub fn wcsnlen(_Source: *const u16, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcsncat(_Destination: *mut u16, _Source: *const u16, _Count: usize) -> *mut u16;
}
extern "C" {
    pub fn wcsncmp(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsncpy(_Destination: *mut u16, _Source: *const u16, _Count: usize) -> *mut u16;
}
extern "C" {
    pub fn wcspbrk(_String: *const u16, _Control: *const u16) -> *const u16;
}
extern "C" {
    pub fn wcsspn(_String: *const u16, _Control: *const u16) -> usize;
}
extern "C" {
    pub fn wcstok(_String: *mut u16, _Delimiter: *const u16, _Context: *mut *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _wcserror(_ErrorNumber: ::std::os::raw::c_int) -> *mut u16;
}
extern "C" {
    pub fn _wcserror_s(
        _Buffer: *mut u16,
        _SizeInWords: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn __wcserror(_String: *const u16) -> *mut u16;
}
extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut u16,
        _SizeInWords: usize,
        _ErrorMessage: *const u16,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsicmp(_String1: *const u16, _String2: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicmp_l(
        _String1: *const u16,
        _String2: *const u16,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicmp_l(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnset_s(
        _Destination: *mut u16,
        _SizeInWords: usize,
        _Value: u16,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsnset(_String: *mut u16, _Value: u16, _MaxCount: usize) -> *mut u16;
}
extern "C" {
    pub fn _wcsrev(_String: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _wcsset_s(_Destination: *mut u16, _SizeInWords: usize, _Value: u16) -> errno_t;
}
extern "C" {
    pub fn _wcsset(_String: *mut u16, _Value: u16) -> *mut u16;
}
extern "C" {
    pub fn _wcslwr_s(_String: *mut u16, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wcslwr(_String: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _wcslwr_s_l(_String: *mut u16, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcslwr_l(_String: *mut u16, _Locale: _locale_t) -> *mut u16;
}
extern "C" {
    pub fn _wcsupr_s(_String: *mut u16, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _wcsupr(_String: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _wcsupr_s_l(_String: *mut u16, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcsupr_l(_String: *mut u16, _Locale: _locale_t) -> *mut u16;
}
extern "C" {
    pub fn wcsxfrm(_Destination: *mut u16, _Source: *const u16, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _wcsxfrm_l(
        _Destination: *mut u16,
        _Source: *const u16,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wcscoll(_String1: *const u16, _String2: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcscoll_l(
        _String1: *const u16,
        _String2: *const u16,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll(_String1: *const u16, _String2: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsicoll_l(
        _String1: *const u16,
        _String2: *const u16,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsncoll_l(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcsnicoll_l(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsdup(_String: *const u16) -> *mut u16;
}
extern "C" {
    pub fn wcsicmp(_String1: *const u16, _String2: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnicmp(
        _String1: *const u16,
        _String2: *const u16,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wcsnset(_String: *mut u16, _Value: u16, _MaxCount: usize) -> *mut u16;
}
extern "C" {
    pub fn wcsrev(_String: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn wcsset(_String: *mut u16, _Value: u16) -> *mut u16;
}
extern "C" {
    pub fn wcslwr(_String: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn wcsupr(_String: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn wcsicoll(_String1: *const u16, _String2: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strcat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn strncat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strncpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strtok_s(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
        _Context: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strcoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> usize;
}
extern "C" {
    pub fn _strdup(_Source: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strerror(_ErrorMessage: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorMessage: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror(_ErrorMessage: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stricmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlen(_Str: *const ::std::os::raw::c_char) -> usize;
}
extern "C" {
    pub fn _strlwr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strlwr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _strlwr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strnicoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strncoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _strncoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __strncnt(_String: *const ::std::os::raw::c_char, _Count: usize) -> usize;
}
extern "C" {
    pub fn strncpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _strnset_s(
        _String: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _strnset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _Count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strpbrk(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strrev(_Str: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strset_s(
        _Destination: *mut ::std::os::raw::c_char,
        _DestinationSize: usize,
        _Value: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _strset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> usize;
}
extern "C" {
    pub fn strtok(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strupr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _strupr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _strupr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strxfrm(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> usize;
}
extern "C" {
    pub fn _strxfrm_l(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(_String: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strnset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrev(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn _cgetws_s(_Buffer: *mut u16, _BufferCount: usize, _SizeRead: *mut usize) -> errno_t;
}
extern "C" {
    pub fn _cputws(_Buffer: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _getwch() -> wint_t;
}
extern "C" {
    pub fn _getwche() -> wint_t;
}
extern "C" {
    pub fn _putwch(_Character: u16) -> wint_t;
}
extern "C" {
    pub fn _ungetwch(_Character: wint_t) -> wint_t;
}
extern "C" {
    pub fn _getwch_nolock() -> wint_t;
}
extern "C" {
    pub fn _getwche_nolock() -> wint_t;
}
extern "C" {
    pub fn _putwch_nolock(_Character: u16) -> wint_t;
}
extern "C" {
    pub fn _ungetwch_nolock(_Character: wint_t) -> wint_t;
}
extern "C" {
    pub fn __conio_common_vcwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __conio_common_vcwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __conio_common_vcwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __conio_common_vcwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Format: *const u16,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __pctype_func() -> *const ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn __pwctype_func() -> *const wctype_t;
}
extern "C" {
    pub fn iswalnum(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswalpha(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswascii(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswblank(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswcntrl(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswgraph(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswlower(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswprint(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswpunct(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswspace(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswupper(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn iswxdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iswcsymf(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __iswcsym(_C: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswalnum_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswalpha_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswblank_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswcntrl_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswgraph_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswlower_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswprint_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswpunct_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswspace_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswupper_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswxdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswcsymf_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _iswcsym_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn towupper(_C: wint_t) -> wint_t;
}
extern "C" {
    pub fn towlower(_C: wint_t) -> wint_t;
}
extern "C" {
    pub fn iswctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _towupper_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
extern "C" {
    pub fn _towlower_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
extern "C" {
    pub fn _iswctype_l(_C: wint_t, _Type: wctype_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isleadbyte(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _isleadbyte_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn is_wctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wgetcwd(_DstBuf: *mut u16, _SizeInWords: ::std::os::raw::c_int) -> *mut u16;
}
extern "C" {
    pub fn _wgetdcwd(
        _Drive: ::std::os::raw::c_int,
        _DstBuf: *mut u16,
        _SizeInWords: ::std::os::raw::c_int,
    ) -> *mut u16;
}
extern "C" {
    pub fn _wchdir(_Path: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wmkdir(_Path: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wrmdir(_Path: *const u16) -> ::std::os::raw::c_int;
}
pub type _fsize_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _wfinddata32_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time32_t,
    pub time_access: __time32_t,
    pub time_write: __time32_t,
    pub size: _fsize_t,
    pub name: [u16; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata32_t"][::std::mem::size_of::<_wfinddata32_t>() - 540usize];
    ["Alignment of _wfinddata32_t"][::std::mem::align_of::<_wfinddata32_t>() - 4usize];
    ["Offset of field: _wfinddata32_t::attrib"]
        [::std::mem::offset_of!(_wfinddata32_t, attrib) - 0usize];
    ["Offset of field: _wfinddata32_t::time_create"]
        [::std::mem::offset_of!(_wfinddata32_t, time_create) - 4usize];
    ["Offset of field: _wfinddata32_t::time_access"]
        [::std::mem::offset_of!(_wfinddata32_t, time_access) - 8usize];
    ["Offset of field: _wfinddata32_t::time_write"]
        [::std::mem::offset_of!(_wfinddata32_t, time_write) - 12usize];
    ["Offset of field: _wfinddata32_t::size"]
        [::std::mem::offset_of!(_wfinddata32_t, size) - 16usize];
    ["Offset of field: _wfinddata32_t::name"]
        [::std::mem::offset_of!(_wfinddata32_t, name) - 20usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _wfinddata32i64_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time32_t,
    pub time_access: __time32_t,
    pub time_write: __time32_t,
    pub size: ::std::os::raw::c_longlong,
    pub name: [u16; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata32i64_t"][::std::mem::size_of::<_wfinddata32i64_t>() - 544usize];
    ["Alignment of _wfinddata32i64_t"][::std::mem::align_of::<_wfinddata32i64_t>() - 8usize];
    ["Offset of field: _wfinddata32i64_t::attrib"]
        [::std::mem::offset_of!(_wfinddata32i64_t, attrib) - 0usize];
    ["Offset of field: _wfinddata32i64_t::time_create"]
        [::std::mem::offset_of!(_wfinddata32i64_t, time_create) - 4usize];
    ["Offset of field: _wfinddata32i64_t::time_access"]
        [::std::mem::offset_of!(_wfinddata32i64_t, time_access) - 8usize];
    ["Offset of field: _wfinddata32i64_t::time_write"]
        [::std::mem::offset_of!(_wfinddata32i64_t, time_write) - 12usize];
    ["Offset of field: _wfinddata32i64_t::size"]
        [::std::mem::offset_of!(_wfinddata32i64_t, size) - 16usize];
    ["Offset of field: _wfinddata32i64_t::name"]
        [::std::mem::offset_of!(_wfinddata32i64_t, name) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _wfinddata64i32_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time64_t,
    pub time_access: __time64_t,
    pub time_write: __time64_t,
    pub size: _fsize_t,
    pub name: [u16; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata64i32_t"][::std::mem::size_of::<_wfinddata64i32_t>() - 560usize];
    ["Alignment of _wfinddata64i32_t"][::std::mem::align_of::<_wfinddata64i32_t>() - 8usize];
    ["Offset of field: _wfinddata64i32_t::attrib"]
        [::std::mem::offset_of!(_wfinddata64i32_t, attrib) - 0usize];
    ["Offset of field: _wfinddata64i32_t::time_create"]
        [::std::mem::offset_of!(_wfinddata64i32_t, time_create) - 8usize];
    ["Offset of field: _wfinddata64i32_t::time_access"]
        [::std::mem::offset_of!(_wfinddata64i32_t, time_access) - 16usize];
    ["Offset of field: _wfinddata64i32_t::time_write"]
        [::std::mem::offset_of!(_wfinddata64i32_t, time_write) - 24usize];
    ["Offset of field: _wfinddata64i32_t::size"]
        [::std::mem::offset_of!(_wfinddata64i32_t, size) - 32usize];
    ["Offset of field: _wfinddata64i32_t::name"]
        [::std::mem::offset_of!(_wfinddata64i32_t, name) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _wfinddata64_t {
    pub attrib: ::std::os::raw::c_uint,
    pub time_create: __time64_t,
    pub time_access: __time64_t,
    pub time_write: __time64_t,
    pub size: ::std::os::raw::c_longlong,
    pub name: [u16; 260usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _wfinddata64_t"][::std::mem::size_of::<_wfinddata64_t>() - 560usize];
    ["Alignment of _wfinddata64_t"][::std::mem::align_of::<_wfinddata64_t>() - 8usize];
    ["Offset of field: _wfinddata64_t::attrib"]
        [::std::mem::offset_of!(_wfinddata64_t, attrib) - 0usize];
    ["Offset of field: _wfinddata64_t::time_create"]
        [::std::mem::offset_of!(_wfinddata64_t, time_create) - 8usize];
    ["Offset of field: _wfinddata64_t::time_access"]
        [::std::mem::offset_of!(_wfinddata64_t, time_access) - 16usize];
    ["Offset of field: _wfinddata64_t::time_write"]
        [::std::mem::offset_of!(_wfinddata64_t, time_write) - 24usize];
    ["Offset of field: _wfinddata64_t::size"]
        [::std::mem::offset_of!(_wfinddata64_t, size) - 32usize];
    ["Offset of field: _wfinddata64_t::name"]
        [::std::mem::offset_of!(_wfinddata64_t, name) - 40usize];
};
extern "C" {
    pub fn _waccess(
        _FileName: *const u16,
        _AccessMode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _waccess_s(_FileName: *const u16, _AccessMode: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _wchmod(_FileName: *const u16, _Mode: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wcreat(
        _FileName: *const u16,
        _PermissionMode: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wfindfirst32(_FileName: *const u16, _FindData: *mut _wfinddata32_t) -> isize;
}
extern "C" {
    pub fn _wfindnext32(
        _FindHandle: isize,
        _FindData: *mut _wfinddata32_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wunlink(_FileName: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wrename(_OldFileName: *const u16, _NewFileName: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wmktemp_s(_TemplateName: *mut u16, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wmktemp(_TemplateName: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _wfindfirst32i64(_FileName: *const u16, _FindData: *mut _wfinddata32i64_t) -> isize;
}
extern "C" {
    pub fn _wfindfirst64i32(_FileName: *const u16, _FindData: *mut _wfinddata64i32_t) -> isize;
}
extern "C" {
    pub fn _wfindfirst64(_FileName: *const u16, _FindData: *mut _wfinddata64_t) -> isize;
}
extern "C" {
    pub fn _wfindnext32i64(
        _FindHandle: isize,
        _FindData: *mut _wfinddata32i64_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wfindnext64i32(
        _FindHandle: isize,
        _FindData: *mut _wfinddata64i32_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wfindnext64(
        _FindHandle: isize,
        _FindData: *mut _wfinddata64_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wsopen_s(
        _FileHandle: *mut ::std::os::raw::c_int,
        _FileName: *const u16,
        _OpenFlag: ::std::os::raw::c_int,
        _ShareFlag: ::std::os::raw::c_int,
        _PermissionFlag: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _wsopen_dispatch(
        _FileName: *const u16,
        _OFlag: ::std::os::raw::c_int,
        _ShFlag: ::std::os::raw::c_int,
        _PMode: ::std::os::raw::c_int,
        _PFileHandle: *mut ::std::os::raw::c_int,
        _BSecure: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _wexecl(_FileName: *const u16, _ArgList: *const u16, ...) -> isize;
}
extern "C" {
    pub fn _wexecle(_FileName: *const u16, _ArgList: *const u16, ...) -> isize;
}
extern "C" {
    pub fn _wexeclp(_FileName: *const u16, _ArgList: *const u16, ...) -> isize;
}
extern "C" {
    pub fn _wexeclpe(_FileName: *const u16, _ArgList: *const u16, ...) -> isize;
}
extern "C" {
    pub fn _wexecv(_FileName: *const u16, _ArgList: *const *const u16) -> isize;
}
extern "C" {
    pub fn _wexecve(
        _FileName: *const u16,
        _ArgList: *const *const u16,
        _Env: *const *const u16,
    ) -> isize;
}
extern "C" {
    pub fn _wexecvp(_FileName: *const u16, _ArgList: *const *const u16) -> isize;
}
extern "C" {
    pub fn _wexecvpe(
        _FileName: *const u16,
        _ArgList: *const *const u16,
        _Env: *const *const u16,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnl(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const u16,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnle(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const u16,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnlp(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const u16,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnlpe(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const u16,
        ...
    ) -> isize;
}
extern "C" {
    pub fn _wspawnv(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const *const u16,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnve(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const *const u16,
        _Env: *const *const u16,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnvp(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const *const u16,
    ) -> isize;
}
extern "C" {
    pub fn _wspawnvpe(
        _Mode: ::std::os::raw::c_int,
        _FileName: *const u16,
        _ArgList: *const *const u16,
        _Env: *const *const u16,
    ) -> isize;
}
extern "C" {
    pub fn _wsystem(_Command: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _itow_s(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itow(
        _Value: ::std::os::raw::c_int,
        _Buffer: *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut u16;
}
extern "C" {
    pub fn _ltow_s(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltow(
        _Value: ::std::os::raw::c_long,
        _Buffer: *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut u16;
}
extern "C" {
    pub fn _ultow_s(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultow(
        _Value: ::std::os::raw::c_ulong,
        _Buffer: *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut u16;
}
extern "C" {
    pub fn wcstod(_String: *const u16, _EndPtr: *mut *mut u16) -> f64;
}
extern "C" {
    pub fn _wcstod_l(_String: *const u16, _EndPtr: *mut *mut u16, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn wcstol(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wcstol_l(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn wcstoll(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoll_l(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn _wcstoul_l(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wcstoull_l(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn wcstold(_String: *const u16, _EndPtr: *mut *mut u16) -> f64;
}
extern "C" {
    pub fn _wcstold_l(_String: *const u16, _EndPtr: *mut *mut u16, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn wcstof(_String: *const u16, _EndPtr: *mut *mut u16) -> f32;
}
extern "C" {
    pub fn _wcstof_l(_String: *const u16, _EndPtr: *mut *mut u16, _Locale: _locale_t) -> f32;
}
extern "C" {
    pub fn _wtof(_String: *const u16) -> f64;
}
extern "C" {
    pub fn _wtof_l(_String: *const u16, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _wtoi(_String: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtoi_l(_String: *const u16, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wtol(_String: *const u16) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wtol_l(_String: *const u16, _Locale: _locale_t) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn _wtoll(_String: *const u16) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wtoll_l(_String: *const u16, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _i64tow_s(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64tow(
        _Value: ::std::os::raw::c_longlong,
        _Buffer: *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut u16;
}
extern "C" {
    pub fn _ui64tow_s(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Radix: ::std::os::raw::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64tow(
        _Value: ::std::os::raw::c_ulonglong,
        _Buffer: *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> *mut u16;
}
extern "C" {
    pub fn _wtoi64(_String: *const u16) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wtoi64_l(_String: *const u16, _Locale: _locale_t) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoi64(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoi64_l(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn _wcstoui64(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wcstoui64_l(
        _String: *const u16,
        _EndPtr: *mut *mut u16,
        _Radix: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn _wfullpath(_Buffer: *mut u16, _Path: *const u16, _BufferCount: usize) -> *mut u16;
}
extern "C" {
    pub fn _wmakepath_s(
        _Buffer: *mut u16,
        _BufferCount: usize,
        _Drive: *const u16,
        _Dir: *const u16,
        _Filename: *const u16,
        _Ext: *const u16,
    ) -> errno_t;
}
extern "C" {
    pub fn _wmakepath(
        _Buffer: *mut u16,
        _Drive: *const u16,
        _Dir: *const u16,
        _Filename: *const u16,
        _Ext: *const u16,
    );
}
extern "C" {
    pub fn _wsplitpath(
        _FullPath: *const u16,
        _Drive: *mut u16,
        _Dir: *mut u16,
        _Filename: *mut u16,
        _Ext: *mut u16,
    );
}
extern "C" {
    pub fn _wsplitpath_s(
        _FullPath: *const u16,
        _Drive: *mut u16,
        _DriveCount: usize,
        _Dir: *mut u16,
        _DirCount: usize,
        _Filename: *mut u16,
        _FilenameCount: usize,
        _Ext: *mut u16,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wdupenv_s(
        _Buffer: *mut *mut u16,
        _BufferCount: *mut usize,
        _VarName: *const u16,
    ) -> errno_t;
}
extern "C" {
    pub fn _wgetenv(_VarName: *const u16) -> *mut u16;
}
extern "C" {
    pub fn _wgetenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut u16,
        _BufferCount: usize,
        _VarName: *const u16,
    ) -> errno_t;
}
extern "C" {
    pub fn _wputenv(_EnvString: *const u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wputenv_s(_Name: *const u16, _Value: *const u16) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv_s(
        _Filename: *const u16,
        _VarName: *const u16,
        _Buffer: *mut u16,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv(_Filename: *const u16, _VarName: *const u16, _ResultPath: *mut u16);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of tm"][::std::mem::size_of::<tm>() - 36usize];
    ["Alignment of tm"][::std::mem::align_of::<tm>() - 4usize];
    ["Offset of field: tm::tm_sec"][::std::mem::offset_of!(tm, tm_sec) - 0usize];
    ["Offset of field: tm::tm_min"][::std::mem::offset_of!(tm, tm_min) - 4usize];
    ["Offset of field: tm::tm_hour"][::std::mem::offset_of!(tm, tm_hour) - 8usize];
    ["Offset of field: tm::tm_mday"][::std::mem::offset_of!(tm, tm_mday) - 12usize];
    ["Offset of field: tm::tm_mon"][::std::mem::offset_of!(tm, tm_mon) - 16usize];
    ["Offset of field: tm::tm_year"][::std::mem::offset_of!(tm, tm_year) - 20usize];
    ["Offset of field: tm::tm_wday"][::std::mem::offset_of!(tm, tm_wday) - 24usize];
    ["Offset of field: tm::tm_yday"][::std::mem::offset_of!(tm, tm_yday) - 28usize];
    ["Offset of field: tm::tm_isdst"][::std::mem::offset_of!(tm, tm_isdst) - 32usize];
};
extern "C" {
    pub fn _wasctime(_Tm: *const tm) -> *mut u16;
}
extern "C" {
    pub fn _wasctime_s(_Buffer: *mut u16, _SizeInWords: usize, _Tm: *const tm) -> errno_t;
}
extern "C" {
    pub fn wcsftime(
        _Buffer: *mut u16,
        _SizeInWords: usize,
        _Format: *const u16,
        _Tm: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn _wcsftime_l(
        _Buffer: *mut u16,
        _SizeInWords: usize,
        _Format: *const u16,
        _Tm: *const tm,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn _wctime32(_Time: *const __time32_t) -> *mut u16;
}
extern "C" {
    pub fn _wctime32_s(_Buffer: *mut u16, _SizeInWords: usize, _Time: *const __time32_t)
        -> errno_t;
}
extern "C" {
    pub fn _wctime64(_Time: *const __time64_t) -> *mut u16;
}
extern "C" {
    pub fn _wctime64_s(_Buffer: *mut u16, _SizeInWords: usize, _Time: *const __time64_t)
        -> errno_t;
}
extern "C" {
    pub fn _wstrdate_s(_Buffer: *mut u16, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wstrdate(_Buffer: *mut u16) -> *mut u16;
}
extern "C" {
    pub fn _wstrtime_s(_Buffer: *mut u16, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wstrtime(_Buffer: *mut u16) -> *mut u16;
}
pub type _ino_t = ::std::os::raw::c_ushort;
pub type ino_t = _ino_t;
pub type _dev_t = ::std::os::raw::c_uint;
pub type dev_t = _dev_t;
pub type _off_t = ::std::os::raw::c_long;
pub type off_t = _off_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _stat32 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: __time32_t,
    pub st_mtime: __time32_t,
    pub st_ctime: __time32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat32"][::std::mem::size_of::<_stat32>() - 36usize];
    ["Alignment of _stat32"][::std::mem::align_of::<_stat32>() - 4usize];
    ["Offset of field: _stat32::st_dev"][::std::mem::offset_of!(_stat32, st_dev) - 0usize];
    ["Offset of field: _stat32::st_ino"][::std::mem::offset_of!(_stat32, st_ino) - 4usize];
    ["Offset of field: _stat32::st_mode"][::std::mem::offset_of!(_stat32, st_mode) - 6usize];
    ["Offset of field: _stat32::st_nlink"][::std::mem::offset_of!(_stat32, st_nlink) - 8usize];
    ["Offset of field: _stat32::st_uid"][::std::mem::offset_of!(_stat32, st_uid) - 10usize];
    ["Offset of field: _stat32::st_gid"][::std::mem::offset_of!(_stat32, st_gid) - 12usize];
    ["Offset of field: _stat32::st_rdev"][::std::mem::offset_of!(_stat32, st_rdev) - 16usize];
    ["Offset of field: _stat32::st_size"][::std::mem::offset_of!(_stat32, st_size) - 20usize];
    ["Offset of field: _stat32::st_atime"][::std::mem::offset_of!(_stat32, st_atime) - 24usize];
    ["Offset of field: _stat32::st_mtime"][::std::mem::offset_of!(_stat32, st_mtime) - 28usize];
    ["Offset of field: _stat32::st_ctime"][::std::mem::offset_of!(_stat32, st_ctime) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _stat32i64 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: ::std::os::raw::c_longlong,
    pub st_atime: __time32_t,
    pub st_mtime: __time32_t,
    pub st_ctime: __time32_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat32i64"][::std::mem::size_of::<_stat32i64>() - 48usize];
    ["Alignment of _stat32i64"][::std::mem::align_of::<_stat32i64>() - 8usize];
    ["Offset of field: _stat32i64::st_dev"][::std::mem::offset_of!(_stat32i64, st_dev) - 0usize];
    ["Offset of field: _stat32i64::st_ino"][::std::mem::offset_of!(_stat32i64, st_ino) - 4usize];
    ["Offset of field: _stat32i64::st_mode"][::std::mem::offset_of!(_stat32i64, st_mode) - 6usize];
    ["Offset of field: _stat32i64::st_nlink"]
        [::std::mem::offset_of!(_stat32i64, st_nlink) - 8usize];
    ["Offset of field: _stat32i64::st_uid"][::std::mem::offset_of!(_stat32i64, st_uid) - 10usize];
    ["Offset of field: _stat32i64::st_gid"][::std::mem::offset_of!(_stat32i64, st_gid) - 12usize];
    ["Offset of field: _stat32i64::st_rdev"][::std::mem::offset_of!(_stat32i64, st_rdev) - 16usize];
    ["Offset of field: _stat32i64::st_size"][::std::mem::offset_of!(_stat32i64, st_size) - 24usize];
    ["Offset of field: _stat32i64::st_atime"]
        [::std::mem::offset_of!(_stat32i64, st_atime) - 32usize];
    ["Offset of field: _stat32i64::st_mtime"]
        [::std::mem::offset_of!(_stat32i64, st_mtime) - 36usize];
    ["Offset of field: _stat32i64::st_ctime"]
        [::std::mem::offset_of!(_stat32i64, st_ctime) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _stat64i32 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: __time64_t,
    pub st_mtime: __time64_t,
    pub st_ctime: __time64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat64i32"][::std::mem::size_of::<_stat64i32>() - 48usize];
    ["Alignment of _stat64i32"][::std::mem::align_of::<_stat64i32>() - 8usize];
    ["Offset of field: _stat64i32::st_dev"][::std::mem::offset_of!(_stat64i32, st_dev) - 0usize];
    ["Offset of field: _stat64i32::st_ino"][::std::mem::offset_of!(_stat64i32, st_ino) - 4usize];
    ["Offset of field: _stat64i32::st_mode"][::std::mem::offset_of!(_stat64i32, st_mode) - 6usize];
    ["Offset of field: _stat64i32::st_nlink"]
        [::std::mem::offset_of!(_stat64i32, st_nlink) - 8usize];
    ["Offset of field: _stat64i32::st_uid"][::std::mem::offset_of!(_stat64i32, st_uid) - 10usize];
    ["Offset of field: _stat64i32::st_gid"][::std::mem::offset_of!(_stat64i32, st_gid) - 12usize];
    ["Offset of field: _stat64i32::st_rdev"][::std::mem::offset_of!(_stat64i32, st_rdev) - 16usize];
    ["Offset of field: _stat64i32::st_size"][::std::mem::offset_of!(_stat64i32, st_size) - 20usize];
    ["Offset of field: _stat64i32::st_atime"]
        [::std::mem::offset_of!(_stat64i32, st_atime) - 24usize];
    ["Offset of field: _stat64i32::st_mtime"]
        [::std::mem::offset_of!(_stat64i32, st_mtime) - 32usize];
    ["Offset of field: _stat64i32::st_ctime"]
        [::std::mem::offset_of!(_stat64i32, st_ctime) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _stat64 {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: ::std::os::raw::c_longlong,
    pub st_atime: __time64_t,
    pub st_mtime: __time64_t,
    pub st_ctime: __time64_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _stat64"][::std::mem::size_of::<_stat64>() - 56usize];
    ["Alignment of _stat64"][::std::mem::align_of::<_stat64>() - 8usize];
    ["Offset of field: _stat64::st_dev"][::std::mem::offset_of!(_stat64, st_dev) - 0usize];
    ["Offset of field: _stat64::st_ino"][::std::mem::offset_of!(_stat64, st_ino) - 4usize];
    ["Offset of field: _stat64::st_mode"][::std::mem::offset_of!(_stat64, st_mode) - 6usize];
    ["Offset of field: _stat64::st_nlink"][::std::mem::offset_of!(_stat64, st_nlink) - 8usize];
    ["Offset of field: _stat64::st_uid"][::std::mem::offset_of!(_stat64, st_uid) - 10usize];
    ["Offset of field: _stat64::st_gid"][::std::mem::offset_of!(_stat64, st_gid) - 12usize];
    ["Offset of field: _stat64::st_rdev"][::std::mem::offset_of!(_stat64, st_rdev) - 16usize];
    ["Offset of field: _stat64::st_size"][::std::mem::offset_of!(_stat64, st_size) - 24usize];
    ["Offset of field: _stat64::st_atime"][::std::mem::offset_of!(_stat64, st_atime) - 32usize];
    ["Offset of field: _stat64::st_mtime"][::std::mem::offset_of!(_stat64, st_mtime) - 40usize];
    ["Offset of field: _stat64::st_ctime"][::std::mem::offset_of!(_stat64, st_ctime) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct stat {
    pub st_dev: _dev_t,
    pub st_ino: _ino_t,
    pub st_mode: ::std::os::raw::c_ushort,
    pub st_nlink: ::std::os::raw::c_short,
    pub st_uid: ::std::os::raw::c_short,
    pub st_gid: ::std::os::raw::c_short,
    pub st_rdev: _dev_t,
    pub st_size: _off_t,
    pub st_atime: time_t,
    pub st_mtime: time_t,
    pub st_ctime: time_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of stat"][::std::mem::size_of::<stat>() - 48usize];
    ["Alignment of stat"][::std::mem::align_of::<stat>() - 8usize];
    ["Offset of field: stat::st_dev"][::std::mem::offset_of!(stat, st_dev) - 0usize];
    ["Offset of field: stat::st_ino"][::std::mem::offset_of!(stat, st_ino) - 4usize];
    ["Offset of field: stat::st_mode"][::std::mem::offset_of!(stat, st_mode) - 6usize];
    ["Offset of field: stat::st_nlink"][::std::mem::offset_of!(stat, st_nlink) - 8usize];
    ["Offset of field: stat::st_uid"][::std::mem::offset_of!(stat, st_uid) - 10usize];
    ["Offset of field: stat::st_gid"][::std::mem::offset_of!(stat, st_gid) - 12usize];
    ["Offset of field: stat::st_rdev"][::std::mem::offset_of!(stat, st_rdev) - 16usize];
    ["Offset of field: stat::st_size"][::std::mem::offset_of!(stat, st_size) - 20usize];
    ["Offset of field: stat::st_atime"][::std::mem::offset_of!(stat, st_atime) - 24usize];
    ["Offset of field: stat::st_mtime"][::std::mem::offset_of!(stat, st_mtime) - 32usize];
    ["Offset of field: stat::st_ctime"][::std::mem::offset_of!(stat, st_ctime) - 40usize];
};
extern "C" {
    pub fn _fstat32(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fstat32i64(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat32i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fstat64i32(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat64i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fstat64(
        _FileHandle: ::std::os::raw::c_int,
        _Stat: *mut _stat64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat32(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat32i64(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat32i64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat64i32(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat64i32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _stat64(
        _FileName: *const ::std::os::raw::c_char,
        _Stat: *mut _stat64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat32(_FileName: *const u16, _Stat: *mut _stat32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat32i64(_FileName: *const u16, _Stat: *mut _stat32i64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat64i32(_FileName: *const u16, _Stat: *mut _stat64i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _wstat64(_FileName: *const u16, _Stat: *mut _stat64) -> ::std::os::raw::c_int;
}
pub type _Wint_t = u16;
extern "C" {
    pub fn _wsetlocale(_Category: ::std::os::raw::c_int, _Locale: *const u16) -> *mut u16;
}
extern "C" {
    pub fn _wcreate_locale(_Category: ::std::os::raw::c_int, _Locale: *const u16) -> _locale_t;
}
extern "C" {
    pub fn btowc(_Ch: ::std::os::raw::c_int) -> wint_t;
}
extern "C" {
    pub fn mbrlen(
        _Ch: *const ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mbrtowc(
        _DstCh: *mut u16,
        _SrcCh: *const ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn mbsrtowcs_s(
        _Retval: *mut usize,
        _Dst: *mut u16,
        _Size: usize,
        _PSrc: *mut *const ::std::os::raw::c_char,
        _N: usize,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
extern "C" {
    pub fn mbsrtowcs(
        _Dest: *mut u16,
        _PSrc: *mut *const ::std::os::raw::c_char,
        _Count: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcrtomb_s(
        _Retval: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Ch: u16,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcrtomb(
        _Dest: *mut ::std::os::raw::c_char,
        _Source: u16,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wcsrtombs_s(
        _Retval: *mut usize,
        _Dst: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Src: *mut *const u16,
        _Size: usize,
        _State: *mut mbstate_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsrtombs(
        _Dest: *mut ::std::os::raw::c_char,
        _PSource: *mut *const u16,
        _Count: usize,
        _State: *mut mbstate_t,
    ) -> usize;
}
extern "C" {
    pub fn wctob(_WCh: wint_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wmemcpy_s(_S1: *mut u16, _N1: rsize_t, _S2: *const u16, _N: rsize_t) -> errno_t;
}
extern "C" {
    pub fn wmemmove_s(_S1: *mut u16, _N1: rsize_t, _S2: *const u16, _N: rsize_t) -> errno_t;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _exception {
    pub type_: ::std::os::raw::c_int,
    pub name: *mut ::std::os::raw::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _exception"][::std::mem::size_of::<_exception>() - 40usize];
    ["Alignment of _exception"][::std::mem::align_of::<_exception>() - 8usize];
    ["Offset of field: _exception::type_"][::std::mem::offset_of!(_exception, type_) - 0usize];
    ["Offset of field: _exception::name"][::std::mem::offset_of!(_exception, name) - 8usize];
    ["Offset of field: _exception::arg1"][::std::mem::offset_of!(_exception, arg1) - 16usize];
    ["Offset of field: _exception::arg2"][::std::mem::offset_of!(_exception, arg2) - 24usize];
    ["Offset of field: _exception::retval"][::std::mem::offset_of!(_exception, retval) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _complex {
    pub x: f64,
    pub y: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _complex"][::std::mem::size_of::<_complex>() - 16usize];
    ["Alignment of _complex"][::std::mem::align_of::<_complex>() - 8usize];
    ["Offset of field: _complex::x"][::std::mem::offset_of!(_complex, x) - 0usize];
    ["Offset of field: _complex::y"][::std::mem::offset_of!(_complex, y) - 8usize];
};
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub static _HUGE: f64;
}
extern "C" {
    pub fn _fperrraise(_Except: ::std::os::raw::c_int);
}
extern "C" {
    pub fn _dclass(_X: f64) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _ldclass(_X: f64) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fdclass(_X: f32) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _dsign(_X: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ldsign(_X: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fdsign(_X: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _dpcomp(_X: f64, _Y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _ldpcomp(_X: f64, _Y: f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _fdpcomp(_X: f32, _Y: f32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _dtest(_Px: *mut f64) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _ldtest(_Px: *mut f64) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fdtest(_Px: *mut f32) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _d_int(_Px: *mut f64, _Xexp: ::std::os::raw::c_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _ld_int(_Px: *mut f64, _Xexp: ::std::os::raw::c_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fd_int(_Px: *mut f32, _Xexp: ::std::os::raw::c_short) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _dscale(_Px: *mut f64, _Lexp: ::std::os::raw::c_long) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _ldscale(_Px: *mut f64, _Lexp: ::std::os::raw::c_long) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fdscale(_Px: *mut f32, _Lexp: ::std::os::raw::c_long) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _dunscale(_Pex: *mut ::std::os::raw::c_short, _Px: *mut f64) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _ldunscale(_Pex: *mut ::std::os::raw::c_short, _Px: *mut f64)
        -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fdunscale(_Pex: *mut ::std::os::raw::c_short, _Px: *mut f32)
        -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _dexp(_Px: *mut f64, _Y: f64, _Eoff: ::std::os::raw::c_long) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _ldexp(_Px: *mut f64, _Y: f64, _Eoff: ::std::os::raw::c_long)
        -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fdexp(_Px: *mut f32, _Y: f32, _Eoff: ::std::os::raw::c_long)
        -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _dnorm(_Ps: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _fdnorm(_Ps: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_short;
}
extern "C" {
    pub fn _dpoly(_X: f64, _Tab: *const f64, _N: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn _ldpoly(_X: f64, _Tab: *const f64, _N: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn _fdpoly(_X: f32, _Tab: *const f32, _N: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn _dlog(_X: f64, _Baseflag: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn _ldlog(_X: f64, _Baseflag: ::std::os::raw::c_int) -> f64;
}
extern "C" {
    pub fn _fdlog(_X: f32, _Baseflag: ::std::os::raw::c_int) -> f32;
}
extern "C" {
    pub fn _dsin(_X: f64, _Qoff: ::std::os::raw::c_uint) -> f64;
}
extern "C" {
    pub fn _ldsin(_X: f64, _Qoff: ::std::os::raw::c_uint) -> f64;
}
extern "C" {
    pub fn _fdsin(_X: f32, _Qoff: ::std::os::raw::c_uint) -> f32;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _double_val {
    pub _Sh: [::std::os::raw::c_ushort; 4usize],
    pub _Val: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _double_val"][::std::mem::size_of::<_double_val>() - 8usize];
    ["Alignment of _double_val"][::std::mem::align_of::<_double_val>() - 8usize];
    ["Offset of field: _double_val::_Sh"][::std::mem::offset_of!(_double_val, _Sh) - 0usize];
